author: Florian Roth
category: proxy
date: 2019/10/21
description: Detects suspicious user agent strings used by crypto miners in proxy
  logs
detection:
  condition: selection
  selection:
    http.http_user_agent|startswith:
    - 'XMRig '
    - ccminer
falsepositives:
- Unknown
fields:
- src_ip
- http.url
- http.http_user_agent
id: fa935401-513b-467b-81f4-f9e77aa0dd78
level: high
logsource:
  category: proxy
  product: suricata
  service: http
modified: 2020/09/03
product: suricata
references:
- https://github.com/xmrig/xmrig/blob/da22b3e6c45825f3ac1f208255126cb8585cd4fc/src/base/kernel/Platform_win.cpp#L65
- https://github.com/xmrig/xmrig/blob/427b6516e0550200c17ca28675118f0fffcc323f/src/version.h
service: http
status: experimental
tags:
- attack.command_and_control
- attack.t1071.001
title: Crypto Miner User Agent
