author: Florian Roth
category: proxy
date: 2017/07/08
description: Detects suspicious malformed user agent strings in proxy logs
detection:
  condition: 1 of selection* and not falsepositives
  falsepositives:
  - http.http_user_agent: Mozilla/3.0 * Acrobat *
  - http.hostname|endswith:
    - .acrobat.com
    - .adobe.com
    - .adobe.io
  selection1:
    http.http_user_agent|startswith:
    - user-agent
    - 'Mozilla/3.0 '
    - 'Mozilla/2.0 '
    - 'Mozilla/1.0 '
    - 'Mozilla '
    - ' Mozilla/'
    - Mozila/
    - Mozilla/4.0 (compatible; MSIE 6.0; MS Web Services Client Protocol
  selection2:
    http.http_user_agent|contains:
    - ' (compatible;MSIE '
    - '.0;Windows NT '
    - loader
  selection3:
    http.http_user_agent:
    - _
    - CertUtil URL Agent
    - Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:60.0)
    - Mozilla/5.0 (Windows NT 6.3; WOW64; rv:28.0) Gecko/20100101 Firefox/28.0
    - HTTPS
falsepositives:
- Unknown
fields:
- src_ip
- http.url
- http.http_user_agent
- http.hostname
id: 7195a772-4b3f-43a4-a210-6a003d65caa1
level: high
logsource:
  category: proxy
  product: suricata
  service: http
modified: 2022/08/08
product: suricata
references:
- https://github.com/fastly/waf_testbed/blob/8bfc406551f3045e418cbaad7596cff8da331dfc/templates/default/scanners-user-agents.data.erb
service: http
status: experimental
tags:
- attack.command_and_control
- attack.t1071.001
title: Suspicious User Agent
