author: Axel Olsson
category: proxy
date: 2022/08/14
description: Detect update check performed by Advanced IP Scanner and Advanced Port
  Scanner
detection:
  condition: selection
  selection:
    http.url|contains: /checkupdate.php
    http.url|contains|all:
    - lng=
    - ver=
    - beta=
    - type=
    - rmode=
    - product=
falsepositives:
- Legitimate use by administrators
fields:
- src_ip
id: 1a9bb21a-1bb5-42d7-aa05-3219c7c8f47d
level: medium
logsource:
  category: proxy
  product: suricata
  service: http
product: suricata
references:
- https://www.advanced-ip-scanner.com/
- https://www.advanced-port-scanner.com/
service: http
status: experimental
tags:
- attack.discovery
- attack.t1590
title: Advanced IP/Port Scanner Update Check
