author: Florian Roth
category: proxy
date: 2019/12/05
description: Detects direct access to raw pastes in different paste services often
  used by malware in their second stages to download malicious code in encrypted or
  encoded form
detection:
  condition: selection
  selection:
    http.url|contains:
    - .paste.ee/r/
    - .pastebin.com/raw/
    - .hastebin.com/raw/
    - .ghostbin.co/paste/*/raw/
falsepositives:
- User activity (e.g. developer that shared and copied code snippets and used the
  raw link instead of just copy & paste)
fields:
- src_ip
- http.url
- http.http_user_agent
id: 5468045b-4fcc-4d1a-973c-c9c9578edacb
level: high
logsource:
  category: proxy
  product: suricata
  service: http
modified: 2020/09/03
product: suricata
references:
- https://www.virustotal.com/gui/domain/paste.ee/relations
service: http
status: experimental
tags:
- attack.command_and_control
- attack.t1071.001
- attack.t1102.001
- attack.t1102.003
- attack.defense_evasion
title: Raw Paste Service Access
