author: Florian Roth
category: proxy
date: 2018/06/05
description: Detects suspicious requests to Telegram API without the usual Telegram
  User-Agent
detection:
  condition: selection and not filter
  filter:
    http.http_user_agent|contains:
    - Telegram
    - Bot
  selection:
    http.hostname: api.telegram.org
falsepositives:
- Legitimate use of Telegram bots in the company
fields:
- src_ip
- http.url
- http.http_user_agent
id: b494b165-6634-483d-8c47-2026a6c52372
level: medium
logsource:
  category: proxy
  product: suricata
  service: http
modified: 2021/11/27
product: suricata
references:
- https://researchcenter.paloaltonetworks.com/2018/03/unit42-telerat-another-android-trojan-leveraging-telegrams-bot-api-to-target-iranian-users/
- https://blog.malwarebytes.com/threat-analysis/2016/11/telecrypt-the-ransomware-abusing-telegram-api-defeated/
- https://www.welivesecurity.com/2016/12/13/rise-telebots-analyzing-disruptive-killdisk-attacks/
service: http
status: test
tags:
- attack.defense_evasion
- attack.command_and_control
- attack.t1071.001
- attack.t1102.002
title: Telegram API Access
