author: Florian Roth
category: proxy
date: 2019/03/07
description: Detects Bitsadmin connections to domains with uncommon TLDs - https://twitter.com/jhencinski/status/1102695118455349248
  - https://isc.sans.edu/forums/diary/Investigating+Microsoft+BITS+Activity/23281/
detection:
  condition: selection and not falsepositives
  falsepositives:
    http.hostname|endswith:
    - .com
    - .net
    - .org
  selection:
    http.http_user_agent|startswith: Microsoft BITS/
falsepositives:
- Rare programs that use Bitsadmin and update from regional TLDs e.g. .uk or .ca
fields:
- src_ip
- http.url
- http.http_user_agent
id: 9eb68894-7476-4cd6-8752-23b51f5883a7
level: high
logsource:
  category: proxy
  product: suricata
  service: http
modified: 2021/08/09
product: suricata
service: http
status: experimental
tags:
- attack.command_and_control
- attack.t1071.001
- attack.defense_evasion
- attack.persistence
- attack.t1197
- attack.s0190
title: Bitsadmin to Uncommon TLD
