author: Florian Roth
category: proxy
date: 2018/04/06
description: Detects WebDav DownloadCradle
detection:
  condition: selection
  selection:
    http.http_method: GET
    http.http_user_agent|startswith: Microsoft-WebDAV-MiniRedir/
falsepositives:
- Administrative scripts that download files from the Internet
- Administrative scripts that retrieve certain website contents
- Legitimate WebDAV administration
fields:
- src_ip
- http.url
- http.http_user_agent
- http.http_method
id: e09aed7a-09e0-4c9a-90dd-f0d52507347e
level: high
logsource:
  category: proxy
  product: suricata
  service: http
modified: 2020/09/03
product: suricata
references:
- https://mgreen27.github.io/posts/2018/04/02/DownloadCradle.html
service: http
status: experimental
tags:
- attack.command_and_control
- attack.t1071.001
title: Windows WebDAV User Agent
