author: Florian Roth
category: proxy
date: 2021/05/06
description: Detects different malformed user agents used in Malleable Profiles used
  with Cobalt Strike
detection:
  condition: 1 of selection*
  selection1:
    http.http_user_agent:
    - Mozilla/4.0 (compatible; MSIE 6.0;Windows NT 5.1)
    - Mozilla/4.0 (compatible; MSIE 7.0; Windows NT 6.1; WOW64; Trident/4.0; SLCC2;
      .NET CLR 3.0.30729; .NET4.0C; .NET4.0E )
    - Mozilla/5.0 (Windows; U; MSIE 7.0; Windows NT 5.2) Java/1.5.0_08
  selection2:
    http.http_user_agent|endswith: ; MANM; MANM)
falsepositives:
- Unknown
id: 41b42a36-f62c-4c34-bd40-8cb804a34ad8
level: critical
logsource:
  category: proxy
  product: suricata
  service: http
modified: 2021/11/02
product: suricata
references:
- https://github.com/yeyintminthuhtut/Malleable-C2-Profiles-Collection/
service: http
status: experimental
tags:
- attack.defense_evasion
- attack.command_and_control
- attack.t1071.001
title: CobaltStrike Malformed UAs in Malleable Profiles
