author: Florian Roth
category: proxy
date: 2021/06/09
description: Detects Baby Shark C2 Framework communication patterns
detection:
  condition: selection
  selection:
    http.url|contains: momyshark\?key=
falsepositives:
- Unknown
id: 304810ed-8853-437f-9e36-c4975c3dfd7e
level: critical
logsource:
  category: proxy
  product: suricata
  service: http
modified: 2022/08/15
product: suricata
references:
- https://nasbench.medium.com/understanding-detecting-c2-frameworks-babyshark-641be4595845
service: http
status: experimental
tags:
- attack.command_and_control
- attack.t1071.001
title: BabyShark Agent Pattern
