author: Roberto Rodriguez @Cyb3rWard0g
category: image_load
date: 2019/09/12
description: Detects execution of PowerShell
detection:
  condition: selection
  selection:
    winlog.event_data.Description: System.Management.Automation
    winlog.event_data.ImageLoaded|contains: System.Management.Automation
falsepositives:
- Unknown
fields:
- winlog.ComputerName
- winlog.event_data.Image
- winlog.event_data.ProcessId
- winlog.event_data.ImageLoaded
id: 867613fb-fa60-4497-a017-a82df74a172c
level: medium
logsource:
  category: image_load
  product: windows
modified: 2019/11/10
product: windows
references:
- https://threathunterplaybook.com/notebooks/windows/02_execution/WIN-190410151110.html
status: experimental
tags:
- attack.execution
- attack.t1059.001
title: PowerShell Execution
