author: NVISO
category: image_load
date: 2020/05/04
description: The Fax service attempts to load ualapi.dll, which is non-existent. An
  attacker can then (side)load their own malicious DLL using this service.
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.ImageLoaded|startswith:
    - C:\Windows\WinSxS\
  selection:
    winlog.event_data.ImageLoaded|endswith:
    - ualapi.dll
    winlog.event_data.Image|endswith:
    - fxssvc.exe
falsepositives:
- Unlikely
id: 828af599-4c53-4ed2-ba4a-a9f835c434ea
level: high
logsource:
  category: image_load
  product: windows
modified: 2020/08/23
product: windows
references:
- https://windows-internals.com/faxing-your-way-to-system/
status: experimental
tags:
- attack.persistence
- attack.defense_evasion
- attack.t1574.001
- attack.t1574.002
title: Fax Service DLL Search Order Hijack
