author: Antonlovesdnb
category: image_load
date: 2020/02/19
description: Detects DLL's Loaded Via Word Containing VBA Macros
detection:
  condition: selection
  selection:
    winlog.event_data.ImageLoaded|endswith:
    - \VBE7.DLL
    - \VBEUI.DLL
    - \VBE7INTL.DLL
    winlog.event_data.Image|endswith:
    - \winword.exe
    - \powerpnt.exe
    - \excel.exe
    - \outlook.exe
falsepositives:
- Alerts on legitimate macro usage as well, will need to filter as appropriate
id: e6ce8457-68b1-485b-9bdd-3c2b5d679aa9
level: high
logsource:
  category: image_load
  product: windows
modified: 2020/08/23
product: windows
references:
- https://medium.com/threatpunter/detecting-adversary-tradecraft-with-image-load-event-logging-and-eql-8de93338c16
status: experimental
tags:
- attack.execution
- attack.t1204.002
title: VBA DLL Loaded Via Microsoft Word
