author: Markus Neis, @markus_neis
category: image_load
date: 2021/07/07
description: Detects the image load of vss_ps.dll by uncommon executables using OriginalFileName
  datapoint
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.Image|contains: c:\windows\
    winlog.event_data.Image|endswith:
    - \svchost.exe
    - \msiexec.exe
    - \vssvc.exe
    - \srtasks.exe
    - \tiworker.exe
    - \dllhost.exe
    - \searchindexer.exe
    - dismhost.exe
    - taskhostw.exe
    - \clussvc.exe
  selection:
    winlog.event_data.ImageLoaded|endswith:
    - \vss_ps.dll
falsepositives:
- unknown
id: 333cdbe8-27bb-4246-bf82-b41a0dca4b70
level: high
logsource:
  category: image_load
  product: windows
product: windows
references:
- 1bd85e1caa1415ebdc8852c91e37bbb7
- https://twitter.com/am0nsec/status/1412232114980982787
status: experimental
tags:
- attack.defense_evasion
- attack.impact
- attack.t1490
title: Image Load of VSS_PS.dll by Uncommon Executable
