author: Tim Burrell
category: process_access
date: 2020/01/02
description: Detects suspect access to svchost process memory such as that used by
  Invoke-Phantom to kill the winRM windows event logging service.
detection:
  condition: selection
  selection:
    winlog.event_data.CallTrace|contains:
    - unknown
    winlog.event_data.GrantedAccess: '0x1f3fff'
    winlog.event_data.TargetImage|endswith: \windows\system32\svchost.exe
falsepositives:
- unknown
id: 166e9c50-8cd9-44af-815d-d1f0c0e90dde
level: high
logsource:
  category: process_access
  product: windows
modified: 2020/08/24
product: windows
references:
- https://github.com/hlldz/Invoke-Phant0m
- https://twitter.com/timbmsft/status/900724491076214784
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.002
title: Suspect Svchost Memory Asccess
