author: Austin Songer @austinsonger
category: ThreatManagement
date: 2021/08/23
description: Detects when a Microsoft Cloud App Security reported for users whose
  account were terminated in Azure AD, but still perform activities in other platforms
  such as AWS or Salesforce. This is especially relevant for users who use another
  account to manage resources, since these accounts are often not terminated when
  a user leaves the company.
detection:
  condition: selection
  selection:
    eventName: Activity performed by terminated user
    eventSource: SecurityComplianceCenter
    status: success
falsepositives:
- Unknown
id: 2e669ed8-742e-4fe5-b3c4-5a59b486c2ee
level: medium
logsource:
  category: ThreatManagement
  service: m365
references:
- https://docs.microsoft.com/en-us/cloud-app-security/anomaly-detection-policy
- https://docs.microsoft.com/en-us/cloud-app-security/policy-template-reference
service: m365
status: experimental
tags:
- attack.impact
title: Activity Performed by Terminated User
