author: Austin Songer @austinsonger
category: ThreatManagement
date: 2020/07/06
description: Detects when a Microsoft Cloud App Security reported a risky sign-in
  attempt due to a login associated with an impossible travel.
detection:
  condition: selection
  selection:
    eventName: Impossible travel activity
    eventSource: SecurityComplianceCenter
    status: success
falsepositives:
- null
id: d7eab125-5f94-43df-8710-795b80fa1189
level: medium
logsource:
  category: ThreatManagement
  service: Office365
modified: 2020/07/06
references:
- https://docs.microsoft.com/en-us/cloud-app-security/anomaly-detection-policy
- https://docs.microsoft.com/en-us/cloud-app-security/policy-template-reference
service: Office365
status: experimental
tags:
- attack.initial_access
- attack.t1078
title: Microsoft 365 - Impossible Travel Activity
