author: Florian Roth
category: process_creation
date: 2020/08/26
description: Detects specific process characteristics of Snatch ransomware word document
  droppers
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains:
    - shutdown /r /f /t 00
    - net stop SuperBackupMan
falsepositives:
- Scripts that shutdown the system immediately and reboot them in safe mode are unlikely
fields:
- winlog.ComputerName
- winlog.event_data.User
- winlog.event_data.Image
id: 5325945e-f1f0-406e-97b8-65104d393fff
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
product: windows
references:
- https://news.sophos.com/en-us/2019/12/09/snatch-ransomware-reboots-pcs-into-safe-mode-to-bypass-protection/
status: stable
tags:
- attack.execution
- attack.t1204
title: Snatch Ransomware
