author: frack113
category: process_creation
date: 2022/01/05
description: Adversaries may attempt to extract credential material from the Security
  Account Manager (SAM) database either through Windows Registry where the SAM database
  is stored
detection:
  condition: all of selection_*
  selection_key:
    winlog.event_data.CommandLine|contains:
    - HKLM\sam
    - HKLM\system
    - HKLM\security
  selection_reg:
    winlog.event_data.CommandLine|contains: ' save '
falsepositives:
- Unknown
id: 038cd51c-3ad8-41c5-ba8f-5d1c92f3cc1e
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1003.002/T1003.002.md#atomic-test-1---registry-dump-of-sam-creds-and-secrets
status: experimental
tags:
- attack.credential_access
- attack.t1003.002
title: Registry Dump of SAM Creds and Secrets
