author: frack113
category: process_creation
date: 2022/03/06
description: Detects the use of Replace.exe which can be used to replace file with
  another file
detection:
  argument:
    winlog.event_data.CommandLine|contains:
    - /a
    - -a
  condition: selection and argument
  selection:
    winlog.event_data.Image|endswith: \replace.exe
falsepositives:
- Unknown
id: 9292293b-8496-4715-9db6-37028dcda4b3
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/06/22
product: windows
references:
- https://lolbas-project.github.io/lolbas/Binaries/Replace/
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/replace
status: experimental
tags:
- attack.command_and_control
- attack.t1105
title: Replace.exe Usage
