author: Florian Roth
category: process_creation
date: 2022/02/25
description: This command line patterns found in BlackByte Ransomware operations
detection:
  condition: 1 of selection*
  selection1:
    winlog.event_data.CommandLine|contains: ' -single '
    winlog.event_data.Image|startswith: C:\Users\Public\
  selection2:
    winlog.event_data.CommandLine|contains:
    - del C:\Windows\System32\Taskmgr.exe
    - ;Set-Service -StartupType Disabled $
    - powershell -command "$x =[System.Text.Encoding]::Unicode.GetString([System.Convert]::FromBase64String(
    - ' do start wordpad.exe /p '
falsepositives:
- Unknown
fields:
- winlog.ComputerName
- winlog.event_data.User
- winlog.event_data.CommandLine
id: 999e8307-a775-4d5f-addc-4855632335be
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://redcanary.com/blog/blackbyte-ransomware/
status: experimental
title: BlackByte Ransomware Patterns
