author: frack113
category: process_creation
date: 2021/07/16
description: Executes arbitrary PowerShell code using SyncAppvPublishingServer.vbs
detection:
  condition: select_vbs
  select_vbs:
    winlog.event_data.CommandLine|contains|all:
    - \SyncAppvPublishingServer.vbs
    - '"n;'
falsepositives:
- Unknown
fields:
- winlog.ComputerName
- winlog.event_data.User
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: 36475a7d-0f6d-4dce-9b01-6aeb473bbaf1
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2021/09/12
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1216/T1216.md
- https://lolbas-project.github.io/lolbas/Binaries/Syncappvpublishingserver/
status: experimental
tags:
- attack.defense_evasion
- attack.t1218
- attack.t1216
title: SyncAppvPublishingServer VBS Execute Arbitrary PowerShell Code
