author: frack113
category: process_creation
date: 2022/01/01
description: Use of reg to get MachineGuid information
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains|all:
    - SOFTWARE\Microsoft\Cryptography
    - '/v '
    - MachineGuid
    winlog.event_data.Image|endswith: \reg.exe
falsepositives:
- Unknown
id: f5240972-3938-4e56-8e4b-e33893176c1f
level: low
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1082/T1082.md#atomic-test-8---windows-machineguid-discovery
status: experimental
tags:
- attack.discovery
- attack.t1082
title: Suspicious Query of MachineGUID
