author: Florian Roth, John Lambert (idea), elhoim
category: process_creation
date: 2021/07/14
description: Detects a suspicious reg.exe invocation that looks as if it would disable
  an important security service
detection:
  condition: selection_reg_add and 1 of selection_cli_*
  selection_cli_reg_disable_defender:
    winlog.event_data.CommandLine|contains:
    - DisableIOAVProtection
    - DisableOnAccessProtection
    - DisableRoutinelyTakingAction
    - DisableScanOnRealtimeEnable
    - DisableBlockAtFirstSeen
    - DisableBehaviorMonitoring
    - DisableEnhancedNotifications
    - DisableAntiSpyware
    - DisableAntiSpywareRealtimeProtection
    - DisableConfig
    - DisablePrivacyMode
    - SignatureDisableUpdateOnStartupWithoutEngine
    - DisableArchiveScanning
    - DisableIntrusionPreventionSystem
    - DisableScriptScanning
    winlog.event_data.CommandLine|contains|all:
    - ' /d 1'
    - Windows Defender
  selection_cli_reg_start:
    winlog.event_data.CommandLine|contains:
    - \Sense
    - \WinDefend
    - \MsMpSvc
    - \NisSrv
    - \WdBoot
    - \WdNisDrv
    - \WdNisSvc
    - \wscsvc
    - \SecurityHealthService
    - \wuauserv
    - \UsoSvc
    - \WdFilter
    - \AppIDSvc
    winlog.event_data.CommandLine|contains|all:
    - ' /d 4'
    - ' /v Start'
  selection_reg_add:
    winlog.event_data.CommandLine|contains|all:
    - reg
    - add
falsepositives:
- Unknown
- Other security solution installers
id: 5e95028c-5229-4214-afae-d653d573d0ec
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/05/05
product: windows
references:
- https://twitter.com/JohnLaTwC/status/1415295021041979392
- https://github.com/gordonbay/Windows-On-Reins/blob/e587ac7a0407847865926d575e3c46f68cf7c68d/wor.ps1
- https://vms.drweb.fr/virus/?i=24144899
- https://bidouillesecurity.com/disable-windows-defender-in-powershell/
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001
title: Reg Disable Security Service
