author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
category: process_creation
date: 2020/05/02
description: A General detection for sdclt spawning new processes. This could be an
  indicator of sdclt being used for bypass UAC techniques.
detection:
  condition: selection
  selection:
    winlog.event_data.ParentImage|endswith: \sdclt.exe
falsepositives:
- Unknown
id: da2738f2-fadb-4394-afa7-0a0674885afa
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
product: windows
references:
- https://github.com/OTRF/detection-hackathon-apt29/issues/6
- https://threathunterplaybook.com/evals/apt29/detections/3.B.2_C36B49B5-DF58-4A34-9FE9-56189B9DEFEA.html
status: test
tags:
- attack.privilege_escalation
- attack.t1548.002
title: Sdclt Child Processes
