author: frack113
category: process_creation
date: 2022/01/01
description: An adversary might use WMI to list Processes running on the compromised
  host or list installed Software hotfix and patches.
detection:
  condition: all of selection* and not filter
  filter:
    winlog.event_data.CommandLine|contains|all:
    - call
    - create
  selection_cli:
    winlog.event_data.CommandLine|contains:
    - process
    - qfe
  selection_img:
  - winlog.event_data.Image|endswith: \WMIC.exe
  - winlog.event_data.OriginalFileName: wmic.exe
falsepositives:
- Unknown
id: 221b251a-357a-49a9-920a-271802777cc0
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/05/13
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1047/T1047.md
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/wmic
status: experimental
tags:
- attack.execution
- attack.t1047
title: Suspicious WMI Reconnaissance
