author: GossiTheDog (rule), frack113 (sigma version)
category: process_creation
date: 2022/06/09
description: Detects diagcab leveraging the "ms-msdt" handler or the "msdt.exe" binary
  to execute arbitrary commands as seen in CVE-2022-30190
detection:
  condition: all of selection_*
  selection_cmd:
    winlog.event_data.CommandLine|contains|all:
    - /cab
    - .diagcab
  selection_img:
  - winlog.event_data.Image|endswith: \msdt.exe
  - winlog.event_data.OriginalFileName: msdt.exe
falsepositives:
- Legitimate usage of ".diagcab" files
id: 6545ce61-a1bd-4119-b9be-fcbee42c0cf3
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://github.com/GossiTheDog/ThreatHunting/blob/e85884abbf05d5b41efc809ea6532b10b45bd05c/AdvancedHuntingQueries/DogWalk-DiagCab
status: experimental
tags:
- attack.defense_evasion
- attack.t1202
title: Execute MSDT.EXE Using Diagcab File
