author: '@ROxPinTeddy'
category: process_creation
date: 2020/05/12
description: Detects the use of rar.exe, on the command line, to create an archive
  with password protection or with a specific compression level. This is pretty indicative
  of malicious actions.
detection:
  condition: selection_password and selection_other
  selection_other:
    winlog.event_data.CommandLine|contains:
    - ' -m'
    - ' a '
  selection_password:
    winlog.event_data.CommandLine|contains: ' -hp'
falsepositives:
- Legitimate use of Winrar command line version
- Other command line tools, that use these flags
id: faa48cae-6b25-4f00-a094-08947fef582f
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/03/16
product: windows
references:
- https://labs.sentinelone.com/the-anatomy-of-an-apt-attack-and-cobaltstrike-beacons-encoded-configuration/
- https://ss64.com/bash/rar.html
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1560.001/T1560.001.md
status: experimental
tags:
- attack.collection
- attack.t1560.001
title: Rar Usage with Password and Compression Level
