author: frack113
category: process_creation
date: 2022/06/04
description: Detects a suspicious call to the user32.dll function that locks the user
  workstation
detection:
  condition: all of selection*
  selection_call:
    winlog.event_data.CommandLine|contains: user32.dll,
    winlog.event_data.Image|endswith: \rundll32.exe
    winlog.event_data.ParentImage|endswith: \cmd.exe
  selection_function:
    winlog.event_data.CommandLine|contains: LockWorkStation
falsepositives:
- Scripts or links on the user desktop used to lock the workstation instead of Windows+L
  or the menu option
fields:
- winlog.event_data.Image
- winlog.event_data.ParentImage
id: 3b5b0213-0460-4e3f-8937-3abf98ff7dcc
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://app.any.run/tasks/2aef9c63-f944-4763-b3ef-81eee209d128/
status: experimental
tags:
- attack.defense_evasion
title: Suspicious Workstation Locking via Rundll32
