author: frack113
category: process_creation
date: 2022/03/02
description: 'A symbolic link is a type of file that contains a reference to another
  file.

  This is probably done to make sure that the ransomware is able to follow shortcuts
  on the machine in order to find the original file to encrypt

  '
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains|all:
    - 'behavior '
    - 'set '
    - SymlinkEvaluation
    winlog.event_data.Image|endswith: \fsutil.exe
falsepositives:
- Legitimate use
id: c0b2768a-dd06-4671-8339-b16ca8d1f27f
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/06/02
product: windows
references:
- https://www.cybereason.com/blog/cybereason-vs.-blackcat-ransomware
- https://docs.microsoft.com/fr-fr/windows-server/administration/windows-commands/fsutil-behavior
status: experimental
tags:
- attack.execution
- attack.t1059
title: Fsutil Behavior Set SymlinkEvaluation
