author: Florian Roth
category: process_creation
date: 2022/08/12
description: Detects findstring commands that include the keyword lsass, which indicates
  recon actviity for the LSASS process PID
detection:
  condition: 1 of selection*
  selection1:
    winlog.event_data.CommandLine|contains: lsass
    winlog.event_data.Image|endswith: \findstr.exe
  selection2:
    winlog.event_data.CommandLine|contains:
    - ' /i lsass.exe'
    - ' /i "lsass'
    - findstr lsass
    - findstr.exe lsass
    - findstr "lsass
    - findstr.exe "lsass
falsepositives:
- Unknown
id: fe63010f-8823-4864-a96b-a7b4a0f7b929
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://blog.talosintelligence.com/2022/08/recent-cyber-attack.html?m=1
status: experimental
tags:
- attack.credential_access
- attack.t1552.006
title: Findstr LSASS
