author: frack113
category: process_creation
date: 2022/02/04
description: Detects the redirection of an alternate data stream (ADS) of / within
  a Windows command line session
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.CommandLine|contains: :\
  selection:
    winlog.event_data.CommandLine|contains|all:
    - '> '
    - ':'
    winlog.event_data.Image|endswith: \cmd.exe
falsepositives:
- Unknown
id: 70e68156-6571-427b-a6e9-4476a173a9b6
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/07/14
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1564.004/T1564.004.md#atomic-test-3---create-ads-command-prompt
status: experimental
tags:
- attack.defense_evasion
- attack.t1564.004
title: Cmd Stream Redirection
