author: Vadim Khrykov (ThreatIntel), Cyb3rEng (Rule)
category: process_creation
date: 2021/08/23
description: This rule will monitor LOLBin process creations by wmiprvse. Add more
  LOLBins to rule logic if needed.
detection:
  condition: selection1 and selection2
  selection1:
    winlog.event_data.Image|endswith:
    - regsvr32
    - rundll32
    - msiexec
    - mshta
    - verclsid
  selection2:
    winlog.event_data.ParentImage|endswith: \wbem\WmiPrvSE.exe
falsepositives:
- Unknown
id: 8a582fe2-0882-4b89-a82a-da6b2dc32937
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware/
- https://github.com/vadim-hunter/Detection-Ideas-Rules/blob/main/Threat%20Intelligence/The%20DFIR%20Report/20210329_Sodinokibi_(aka_REvil)_Ransomware.yaml
status: experimental
tags:
- attack.t1204.002
- attack.t1047
- attack.t1218.010
- attack.execution
- attack.defense_evasion
title: Lolbins Process Creation with WmiPrvse
