author: frack113
category: process_creation
date: 2021/12/30
description: 'Adversaries may execute their own malicious payloads by hijacking the
  Registry entries used by services.

  Adversaries may use flaws in the permissions for registry to redirect from the originally
  specified executable to one that they control, in order to launch their own code
  at Service start.

  Windows stores local service configuration information in the Registry under HKLM\SYSTEM\CurrentControlSet\Services

  '
detection:
  condition: all of selection*
  selection:
    winlog.event_data.CommandLine|contains|all:
    - 'add '
    - SYSTEM\CurrentControlSet\Services\
    - ' ImagePath '
    winlog.event_data.Image|endswith: \reg.exe
  selection_value:
    winlog.event_data.CommandLine|contains:
    - ' /d '
    - ' -d '
falsepositives:
- Unknown
id: 9b0b7ac3-6223-47aa-a3fd-e8f211e637db
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/03/29
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1574.011/T1574.011.md#atomic-test-2---service-imagepath-change-with-regexe
status: experimental
tags:
- attack.persistence
- attack.t1574.011
title: Service ImagePath Change with Reg.exe
