author: Florian Roth
category: process_creation
date: 2022/04/21
description: Detects the invocation of the Stored User Names and Passwords dialogue
  (Key Manager)
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains|all:
    - keymgr
    - KRShowKeyMgr
    winlog.event_data.Image|endswith: \rundll32.exe
falsepositives:
- Administrative activity
id: a4694263-59a8-4608-a3a0-6f8d3a51664c
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://twitter.com/NinjaParanoid/status/1516442028963659777
status: experimental
tags:
- attack.credential_access
- attack.t1555.004
title: Suspicious Key Manager Access
