author: Teymur Kheirkhabarov (idea), Vasiliy Burov (rule), oscd.community, Tim Shelton
category: process_creation
date: 2020/10/11
description: Detects specific encoding method of cOnvErTTO-SECUreStRIng in the PowerShell
  command lines
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains: ConvertTo-SecureString
    winlog.event_data.Image|endswith:
    - \powershell.exe
    - \pwsh.exe
falsepositives:
- Unlikely
id: 74403157-20f5-415d-89a7-c505779585cf
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/07/14
product: windows
references:
- https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=65
status: test
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
title: Encoded PowerShell Command Line Usage of ConvertTo-SecureString
