author: Nasreddine Bencherchali
category: process_creation
date: 2022/08/02
description: Detects the use of various cli utility related to web request exfiltrating
  data
detection:
  condition: (selection_iwr or all of selection_curl*) and payloads
  payloads:
  - winlog.event_data.CommandLine|contains:
    - ToBase64String
    - whoami
    - nltest
    - ifconfig
    - hostname
    - net view
    - qprocess
    - netstat
    - systeminfo
    - tasklist
    - sc query
  - winlog.event_data.CommandLine|contains|all:
    - 'type '
    - ' > '
    - ' C:\'
  selection_curl:
    winlog.event_data.CommandLine|contains: --ur
    winlog.event_data.Image|endswith: \curl.exe
  selection_curl_data:
    winlog.event_data.CommandLine|contains:
    - ' -d '
    - ' --data '
  selection_iwr:
    winlog.event_data.CommandLine|contains:
    - Invoke-WebRequest
    - 'iwr '
    - 'wget '
    - 'curl '
    winlog.event_data.CommandLine|contains|all:
    - ' -ur'
    - ' -me'
    - ' -b'
    - ' POST '
    winlog.event_data.Image|endswith:
    - \powershell.exe
    - \pwsh.exe
    - \cmd.exe
falsepositives:
- Unlikely
id: 7d1aaf3d-4304-425c-b7c3-162055e0b3ab
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://www.sentinelone.com/blog/living-off-windows-defender-lockbit-ransomware-sideloads-cobalt-strike-through-microsoft-security-tool/
status: experimental
tags:
- attack.execution
- attack.t1059.001
title: Possible Exfiltration Of Data Via CLI
