author: frack113
category: process_creation
date: 2021/11/29
description: utilizes REGSVR32.exe to execute this DLL masquerading as a Image file
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|endswith: .jpg
    winlog.event_data.Image|endswith: \regsvr32.exe
falsepositives:
- Unknown
id: 089fc3d2-71e8-4763-a8a5-c97fbb0a403e
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://thedfirreport.com/2021/11/29/continuing-the-bazar-ransomware-story/
- https://blog.talosintelligence.com/2021/10/threat-hunting-in-large-datasets-by.html
status: experimental
tags:
- attack.defense_evasion
- attack.t1218.010
title: Suspicious Regsvr32 Execution With Image Extension
