author: Romaissa Adjailia, FLorian Roth
category: process_creation
date: 2022/07/21
description: Detects launch of the PSEXESVC service, which means that this system
  was the target of a psexec remote execution
detection:
  condition: selection
  selection:
  - winlog.event_data.Image: C:\Windows\PSEXESVC.exe
  - winlog.event_data.OriginalFileName: psexesvc.exe
falsepositives:
- Legitimate administrative tasks
id: fdfcbd78-48f1-4a4b-90ac-d82241e368c5
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://docs.microsoft.com/en-us/sysinternals/downloads/psexec
- https://www.youtube.com/watch?v=ro2QuZTIMBM
related:
- id: fa91cc36-24c9-41ce-b3c8-3bbc3f2f67ba
  type: similar
status: experimental
tags:
- attack.execution
title: PsExec Service Execution
