author: Nasreddine Bencherchali
category: process_creation
date: 2022/06/09
description: The "AdPlus.exe" binary that is part of the Windows SDK can be used as
  a lolbin to dump process memory and execute arbitrary commands
detection:
  condition: all of selection*
  selection_cli:
    winlog.event_data.CommandLine|contains:
    - ' -hang '
    - ' -pn '
    - ' -pmn '
    - ' -p '
    - ' -po '
    - ' -c '
    - ' -sc '
  selection_img:
  - winlog.event_data.Image|endswith: \adplus.exe
  - winlog.event_data.OriginalFileName: Adplus.exe
falsepositives:
- Legitimate usage of Adplus
id: 2f869d59-7f6a-4931-992c-cce556ff2d53
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Adplus/
- https://twitter.com/nas_bench/status/1534916659676422152
- https://twitter.com/nas_bench/status/1534915321856917506
status: experimental
tags:
- attack.defense_evasion
- attack.execution
- attack.t1003.001
title: Use of Adplus.exe
