author: Beyu Denis, oscd.community, Nasreddine Bencherchali
category: process_creation
date: 2019/10/26
description: Launch 64-bit shellcode from a debugger script file using cdb.exe.
detection:
  condition: all of selection*
  selection_cli:
    winlog.event_data.CommandLine|contains:
    - ' -c '
    - ' -cf '
  selection_img:
  - winlog.event_data.Image|endswith: \cdb.exe
  - winlog.event_data.OriginalFileName: CDB.Exe
falsepositives:
- Legitimate use of debugging tools
id: b5c7395f-e501-4a08-94d4-57fe7a9da9d2
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/06/09
product: windows
references:
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Cdb/
- http://www.exploit-monday.com/2016/08/windbg-cdb-shellcode-runner.html
- https://twitter.com/nas_bench/status/1534957360032120833
status: test
tags:
- attack.execution
- attack.t1106
- attack.defense_evasion
- attack.t1218
- attack.t1127
title: Possible App Whitelisting Bypass via WinDbg/CDB as a Shellcode Runner
