author: Florian Roth
category: process_creation
date: 2022/06/28
description: Detects usage of bitsadmin downloading a file with a suspicious extension
detection:
  condition: all of selection*
  selection:
    winlog.event_data.CommandLine|contains:
    - ' /transfer '
    - ' /create '
    - ' /addfile '
    winlog.event_data.Image|endswith: \bitsadmin.exe
  selection_extension:
    winlog.event_data.CommandLine|contains:
    - .asax
    - .ashx
    - .asmx
    - .asp
    - .aspx
    - .bat
    - .cfm
    - .cgi
    - .chm
    - .cmd
    - .gif
    - .jpeg
    - .jpg
    - .jsp
    - .jspx
    - .png
    - .ps1
    - .psm1
    - .scf
    - .sct
    - .txt
    - .vbe
    - .vbs
    - .war
    - .wsf
    - .wsh
    - .zip
    - .rar
    - .dll
falsepositives:
- Unknown
fields:
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: 5b80a791-ad9b-4b75-bcc1-ad4e1e89c200
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://blog.netspi.com/15-ways-to-download-a-file/#bitsadmin
- https://isc.sans.edu/diary/22264
- https://lolbas-project.github.io/lolbas/Binaries/Bitsadmin/
status: experimental
tags:
- attack.defense_evasion
- attack.persistence
- attack.t1197
- attack.s0190
- attack.t1036.003
title: Bitsadmin Download File with Suspicious Extension
