author: xknow @xknow_infosec, Tim Shelton
category: process_creation
date: 2020/06/11
description: detects the usage of path traversal in cmd.exe indicating possible command/argument
  confusion/hijacking
detection:
  condition: selection and not 1 of falsepositive*
  falsepositive_1:
    winlog.event_data.CommandLine|contains: \Tasktop\keycloak\bin\/../../jre\bin\java
  selection:
    winlog.event_data.CommandLine|contains: /../../
    winlog.event_data.ParentCommandLine|contains|all:
    - cmd
    - /c
falsepositives:
- (not much) some benign Java tools may product false-positive commandlines for loading
  libraries
id: 087790e3-3287-436c-bccf-cbd0184a7db1
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/03/17
product: windows
references:
- https://hackingiscool.pl/cmdhijack-command-argument-confusion-with-path-traversal-in-cmd-exe/
- https://twitter.com/Oddvarmoe/status/1270633613449723905
status: test
tags:
- attack.execution
- attack.t1059.003
title: Cmd.exe CommandLine Path Traversal
