author: frack113
category: process_creation
date: 2021/08/19
description: 'Adversaries may establish persistence by executing malicious content
  triggered by user inactivity.

  Screensavers are programs that execute after a configurable time of user inactivity
  and consist of Portable Executable (PE) files with a .scr file extension

  '
detection:
  condition: selection_reg and 1 of selection_option_*
  selection_option_1:
    winlog.event_data.CommandLine|contains|all:
    - /v ScreenSaveActive
    - /t REG_SZ
    - /d 1
    - /f
  selection_option_2:
    winlog.event_data.CommandLine|contains|all:
    - /v ScreenSaveTimeout
    - /t REG_SZ
    - '/d '
    - /f
  selection_option_3:
    winlog.event_data.CommandLine|contains|all:
    - /v ScreenSaverIsSecure
    - /t REG_SZ
    - /d 0
    - /f
  selection_option_4:
    winlog.event_data.CommandLine|contains|all:
    - /v SCRNSAVE.EXE
    - /t REG_SZ
    - '/d '
    - .scr
    - /f
  selection_reg:
    winlog.event_data.CommandLine|contains:
    - HKEY_CURRENT_USER\Control Panel\Desktop
    - HKCU\Control Panel\Desktop
    winlog.event_data.Image|endswith: \reg.exe
falsepositives:
- GPO
id: 0fc35fc3-efe6-4898-8a37-0b233339524f
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/06/02
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1546.002/T1546.002.md
- https://www.welivesecurity.com/wp-content/uploads/2017/08/eset-gazer.pdf
status: experimental
tags:
- attack.privilege_escalation
- attack.t1546.002
title: Suspicious ScreenSave Change by Reg.exe
