author: _pete_0, TheDFIRReport
category: process_creation
date: 2022/05/06
description: Detects use of Cobalt Strike module commands accidentally entered in
  the CMD shell
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains:
    - Invoke-UserHunter
    - Invoke-ShareFinder
    - Invoke-Kerberoast
    - Invoke-SMBAutoBrute
    - Invoke-Nightmare
    - zerologon
    - av_query
    winlog.event_data.CommandLine|startswith:
    - cmd.exe
    - c:\windows\system32\cmd.exe
    winlog.event_data.Image|endswith: \cmd.exe
falsepositives:
- Unknown
fields:
- winlog.event_data.CommandLine
id: 4f154fb6-27d1-4813-a759-78b93e0b9c48
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/05/06
product: windows
references:
- https://hstechdocs.helpsystems.com/manuals/cobaltstrike/current/userguide/content/cobalt-4-5-user-guide.pdf
- https://thedfirreport.com/2021/10/04/bazarloader-and-the-conti-leaks/
- https://thedfirreport.com/2022/06/16/sans-ransomware-summit-2022-can-you-detect-this/
status: experimental
tags:
- attack.execution
- attack.t1059.003
title: Operator Bloopers Cobalt Strike Modules
