author: Florian Roth, Nasreddine Bencherchali
category: process_creation
date: 2022/01/04
description: Detects uses of the createdump.exe LOLOBIN utility to dump process memory
detection:
  condition: all of selection_*
  selection_cli:
    winlog.event_data.CommandLine|contains:
    - ' -u '
    - ' --full '
    - ' -f '
    - ' --name '
    - '.dmp '
  selection_img:
  - winlog.event_data.Image|endswith: \createdump.exe
  - winlog.event_data.OriginalFileName: FX_VER_INTERNALNAME_STR
falsepositives:
- Command lines that use the same flags
id: 515c8be5-e5df-4c5e-8f6d-a4a2f05e4b48
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/08/19
product: windows
references:
- https://www.crowdstrike.com/blog/overwatch-exposes-aquatic-panda-in-possession-of-log-4-shell-exploit-tools/
- https://twitter.com/bopin2020/status/1366400799199272960
status: experimental
tags:
- attack.defense_evasion
- attack.t1036
- attack.t1003.001
title: CreateDump Process Dump
