author: frack113
category: process_creation
date: 2021/11/26
description: Download and compress a remote file and store it in a cab file on local
  machine.
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains|all:
    - diantz.exe
    - ' \\\\'
    - .cab
falsepositives:
- Unknown
id: 185d7418-f250-42d0-b72e-0c8b70661e93
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/08/13
product: windows
references:
- https://lolbas-project.github.io/lolbas/Binaries/Diantz/
status: experimental
tags:
- attack.command_and_control
- attack.t1105
title: Suspicious Diantz Download and Compress Into a CAB File
