author: frack113
category: process_creation
date: 2022/01/07
description: Adversaries may use Valid Accounts to log into a computer using the Remote
  Desktop Protocol (RDP). The adversary may then perform actions as the logged-on
  user.
detection:
  condition: 1 of selection_*
  selection_mstsc:
    winlog.event_data.CommandLine|contains|all:
    - '-i '
    - '-u '
    - '-p '
    winlog.event_data.Image|endswith: \ruby.exe
falsepositives:
- Unknown
id: a197e378-d31b-41c0-9635-cfdf1c1bb423
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1021.006/T1021.006.md#atomic-test-3---winrm-access-with-evil-winrm
- https://github.com/Hackplayers/evil-winrm
status: experimental
tags:
- attack.lateral_movement
- attack.t1021.006
title: WinRM Access with Evil-WinRM
