author: Florian Roth
category: process_creation
date: 2022/07/11
description: Detects suspicious UTF16 and base64 encoded and often obfuscated PowerShell
  code often used in command lines
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains:
    - IAAtAGIAeABvAHIAIAAwAHgA
    - AALQBiAHgAbwByACAAMAB4A
    - gAC0AYgB4AG8AcgAgADAAeA
    - AC4ASQBuAHYAbwBrAGUAKAApACAAfAAg
    - AuAEkAbgB2AG8AawBlACgAKQAgAHwAI
    - ALgBJAG4AdgBvAGsAZQAoACkAIAB8AC
    - AHsAMQB9AHsAMAB9ACIAIAAtAGYAI
    - B7ADEAfQB7ADAAfQAiACAALQBmAC
    - AewAxAH0AewAwAH0AIgAgAC0AZgAg
    - AHsAMAB9AHsAMwB9ACIAIAAtAGYAI
    - B7ADAAfQB7ADMAfQAiACAALQBmAC
    - AewAwAH0AewAzAH0AIgAgAC0AZgAg
    - AHsAMgB9AHsAMAB9ACIAIAAtAGYAI
    - B7ADIAfQB7ADAAfQAiACAALQBmAC
    - AewAyAH0AewAwAH0AIgAgAC0AZgAg
    - AHsAMQB9AHsAMAB9ACcAIAAtAGYAI
    - B7ADEAfQB7ADAAfQAnACAALQBmAC
    - AewAxAH0AewAwAH0AJwAgAC0AZgAg
    - AHsAMAB9AHsAMwB9ACcAIAAtAGYAI
    - B7ADAAfQB7ADMAfQAnACAALQBmAC
    - AewAwAH0AewAzAH0AJwAgAC0AZgAg
    - AHsAMgB9AHsAMAB9ACcAIAAtAGYAI
    - B7ADIAfQB7ADAAfQAnACAALQBmAC
    - AewAyAH0AewAwAH0AJwAgAC0AZgAg
falsepositives:
- Unknown
id: 8d01b53f-456f-48ee-90f6-bc28e67d4e35
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://app.any.run/tasks/fcadca91-3580-4ede-aff4-4d2bf809bf99/
status: experimental
tags:
- attack.defense_evasion
title: Suspicious PowerShell Obfuscated PowerShell Code
