author: Florian Roth
category: process_creation
date: 2021/03/05
description: Detects suspicious process related to rundll32 based on command line
  that includes a *.sys file as seen being used by UNC2452
detection:
  condition: all of selection*
  selection1:
    winlog.event_data.CommandLine|contains: rundll32.exe
  selection2:
    winlog.event_data.CommandLine|contains:
    - .sys,
    - '.sys '
falsepositives:
- Unknown
id: 731231b9-0b5d-4219-94dd-abb6959aa7ea
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://www.microsoft.com/security/blog/2021/03/04/goldmax-goldfinder-sibot-analyzing-nobelium-malware/
status: experimental
tags:
- attack.defense_evasion
- attack.t1218.011
title: Suspicious Rundll32 Activity Invoking Sys File
