author: Nasreddine Bencherchali (rule)
category: process_creation
date: 2022/05/29
description: Detects processes leveraging the "ms-msdt" handler or the "msdt.exe"
  binary to execute arbitrary commands as seen in the follina (CVE-2022-30190) vulnerability
detection:
  condition: selection_img and (selection_cmd_inline or all of selection_cmd_answerfile*)
  selection_cmd_answerfile:
    winlog.event_data.CommandLine|contains: ' PCWDiagnostic'
  selection_cmd_answerfile_param:
    winlog.event_data.CommandLine|contains:
    - ' /af '
    - ' -af '
  selection_cmd_inline:
    winlog.event_data.CommandLine|contains: IT_BrowseForFile=
  selection_img:
  - winlog.event_data.Image|endswith: \msdt.exe
  - winlog.event_data.OriginalFileName: msdt.exe
falsepositives:
- Unknown
id: 258fc8ce-8352-443a-9120-8a11e4857fa5
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/06/13
product: windows
references:
- https://twitter.com/nao_sec/status/1530196847679401984
- https://app.any.run/tasks/713f05d2-fe78-4b9d-a744-f7c133e3fafb/
- https://twitter.com/_JohnHammond/status/1531672601067675648
status: experimental
tags:
- attack.defense_evasion
- attack.t1202
title: Execute Arbitrary Commands Using MSDT.EXE
