author: Matthew Green - @mgreen27, Florian Roth
category: process_creation
date: 2019/06/15
description: Detects the execution of a renamed binary often used by attackers or
  malware leveraging new Sysmon OriginalFileName datapoint.
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.Image|endswith:
    - \powershell.exe
    - \pwsh.exe
    - \powershell_ise.exe
    - \psexec.exe
    - \psexec64.exe
    - \cscript.exe
    - \wscript.exe
    - \mshta.exe
    - \regsvr32.exe
    - \wmic.exe
    - \certutil.exe
    - \rundll32.exe
    - \cmstp.exe
    - \msiexec.exe
  selection:
    winlog.event_data.OriginalFileName:
    - powershell.exe
    - pwsh.dll
    - powershell_ise.exe
    - psexec.exe
    - psexec.c
    - cscript.exe
    - wscript.exe
    - mshta.exe
    - regsvr32.exe
    - wmic.exe
    - certutil.exe
    - rundll32.exe
    - cmstp.exe
    - msiexec.exe
falsepositives:
- Custom applications use renamed binaries adding slight change to binary name. Typically
  this is easy to spot and add to whitelist
id: 0ba1da6d-b6ce-4366-828c-18826c9de23e
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/07/14
product: windows
references:
- https://attack.mitre.org/techniques/T1036/
- https://mgreen27.github.io/posts/2019/05/12/BinaryRename.html
- https://mgreen27.github.io/posts/2019/05/29/BinaryRename2.html
status: test
tags:
- attack.defense_evasion
- attack.t1036.003
title: Highly Relevant Renamed Binary
