author: Florian Roth, Maxime Thiebaut
category: process_creation
date: 2021/08/23
description: Detects a explorer.exe sub process of the RazerInstaller software which
  can be invoked from the installer to select a different installation folder but
  can also be exploited to escalate privileges to LOCAL SYSTEM
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.Image|startswith: C:\Windows\Installer\Razer\Installer\
  selection:
    winlog.event_data.IntegrityLevel: System
    winlog.event_data.ParentImage|endswith: \RazerInstaller.exe
falsepositives:
- User selecting a different installation folder (check for other sub processes of
  this explorer.exe process)
id: a4eaf250-7dc1-4842-862a-5e71cd59a167
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/08/24
product: windows
references:
- https://twitter.com/j0nh4t/status/1429049506021138437
- https://streamable.com/q2dsji
status: experimental
tags:
- attack.privilege_escalation
- attack.t1553
title: Suspicious RazerInstaller Explorer Subprocess
