author: pH-T
category: process_creation
date: 2022/03/01
description: Detects suspicious base64 encoded and obbfuscated LOAD string often used
  for reflection.assembly load
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains:
    - OgA6ACgAIgBMACIAKwAiAG8AYQBkACIAKQ
    - oAOgAoACIATAAiACsAIgBvAGEAZAAiACkA
    - 6ADoAKAAiAEwAIgArACIAbwBhAGQAIgApA
    - OgA6ACgAIgBMAG8AIgArACIAYQBkACIAKQ
    - oAOgAoACIATABvACIAKwAiAGEAZAAiACkA
    - 6ADoAKAAiAEwAbwAiACsAIgBhAGQAIgApA
    - OgA6ACgAIgBMAG8AYQAiACsAIgBkACIAKQ
    - oAOgAoACIATABvAGEAIgArACIAZAAiACkA
    - 6ADoAKAAiAEwAbwBhACIAKwAiAGQAIgApA
    - OgA6ACgAJwBMACcAKwAnAG8AYQBkACcAKQ
    - oAOgAoACcATAAnACsAJwBvAGEAZAAnACkA
    - 6ADoAKAAnAEwAJwArACcAbwBhAGQAJwApA
    - OgA6ACgAJwBMAG8AJwArACcAYQBkACcAKQ
    - oAOgAoACcATABvACcAKwAnAGEAZAAnACkA
    - 6ADoAKAAnAEwAbwAnACsAJwBhAGQAJwApA
    - OgA6ACgAJwBMAG8AYQAnACsAJwBkACcAKQ
    - oAOgAoACcATABvAGEAJwArACcAZAAnACkA
    - 6ADoAKAAnAEwAbwBhACcAKwAnAGQAJwApA
falsepositives:
- Unlikely
fields:
- winlog.event_data.CommandLine
id: 9c0295ce-d60d-40bd-bd74-84673b7592b1
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/05/20
product: windows
references:
- https://github.com/Neo23x0/Raccine/blob/20a569fa21625086433dcce8bb2765d0ea08dcb6/yara/mal_revil.yar
- https://thedfirreport.com/2022/05/09/seo-poisoning-a-gootloader-story/
related:
- id: 62b7ccc9-23b4-471e-aa15-6da3663c4d59
  type: similar
status: test
tags:
- attack.execution
- attack.t1059.001
- attack.defense_evasion
- attack.t1027
title: Suspicious Encoded Obfuscated LOAD String
