author: Beyu Denis, oscd.community, Nasreddine Bencherchali (update)
category: process_creation
date: 2019/10/26
description: Detects execution of of Dxcap.exe
detection:
  condition: all of selection*
  selection_cli:
    winlog.event_data.CommandLine|contains: ' -c '
  selection_img:
  - winlog.event_data.Image|endswith: \DXCap.exe
  - winlog.event_data.OriginalFileName: DXCap.exe
falsepositives:
- Legitimate execution of dxcap.exe by legitimate user
id: 60f16a96-db70-42eb-8f76-16763e333590
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/06/09
product: windows
references:
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Dxcap/
- https://twitter.com/harr0ey/status/992008180904419328
status: test
tags:
- attack.defense_evasion
- attack.t1218
title: Application Whitelisting Bypass via Dxcap.exe
