author: Florian Roth
category: process_creation
date: 2021/11/23
description: Detects suspicious flags used by PsExec and PAExec to escalate a command
  line to LOCAL_SYSTEM rights
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains:
    - PsExec
    - PAExec
    - accepteula
    - 'cmd /c '
    - 'cmd /k '
    winlog.event_data.CommandLine|endswith: ' -s cmd.exe'
falsepositives:
- Admins that use PsExec or PAExec to escalate to the SYSTEM account for maintenance
  purposes (rare)
id: 8834e2f7-6b4b-4f09-8906-d2276470ee23
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/08/24
product: windows
references:
- https://docs.microsoft.com/en-us/sysinternals/downloads/psexec
- https://www.poweradmin.com/paexec/
- https://www.fireeye.com/blog/threat-research/2020/10/kegtap-and-singlemalt-with-a-ransomware-chaser.html
status: experimental
tags:
- attack.resource_development
- attack.t1587.001
title: PsExec/PAExec Escalation to LOCAL SYSTEM
