author: Florian Roth
category: process_creation
date: 2021/12/28
description: Detects suspicious way to dump the kernel on Windows systems using dtrace.exe,
  which is available on Windows systems since Windows 10 19H1
detection:
  condition: 1 of selection*
  selection_obfuscated:
    winlog.event_data.CommandLine|contains|all:
    - syscall:::return
    - lkd(
  selection_plain:
    winlog.event_data.CommandLine|contains: lkd(0)
    winlog.event_data.Image|endswith: \dtrace.exe
falsepositives:
- Unknown
id: 7124aebe-4cd7-4ccb-8df0-6d6b93c96795
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://twitter.com/0gtweet/status/1474899714290208777?s=12
- https://docs.microsoft.com/en-us/windows-hardware/drivers/devtest/dtrace
status: experimental
title: Suspicious Kernel Dump Using Dtrace
