author: Kirill Kiryanov, Beyu Denis, Daniil Yugoslavskiy, oscd.community
category: process_creation
date: 2019/10/25
description: Detects defence evasion attempt via odbcconf.exe execution to load DLL
detection:
  condition: 1 of selection_*
  selection_1:
    winlog.event_data.CommandLine|contains:
    - -f
    - regsvr
    winlog.event_data.Image|endswith: \odbcconf.exe
  selection_2:
    winlog.event_data.Image|endswith: \rundll32.exe
    winlog.event_data.ParentImage|endswith: \odbcconf.exe
falsepositives:
- Legitimate use of odbcconf.exe by legitimate user
id: 65d2be45-8600-4042-b4c0-577a1ff8a60e
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
product: windows
references:
- https://lolbas-project.github.io/lolbas/Binaries/Odbcconf/
- https://twitter.com/Hexacorn/status/1187143326673330176
- https://redcanary.com/blog/raspberry-robin/
status: test
tags:
- attack.defense_evasion
- attack.t1218.008
title: Application Whitelisting Bypass via DLL Loaded by odbcconf.exe
