author: Furkan CALISKAN, @caliskanfurkan_, @oscd_initiative
category: process_creation
date: 2020/10/05
description: Attackers can use print.exe for remote file copy
detection:
  condition: selection and not filter_print
  filter_print:
    winlog.event_data.CommandLine|contains: print.exe
  selection:
    winlog.event_data.CommandLine|contains|all:
    - /D
    - .exe
    winlog.event_data.CommandLine|startswith: print
    winlog.event_data.Image|endswith: \print.exe
falsepositives:
- Unknown
id: bafac3d6-7de9-4dd9-8874-4a1194b493ed
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/07/07
product: windows
references:
- https://lolbas-project.github.io/lolbas/Binaries/Print/
- https://twitter.com/Oddvarmoe/status/985518877076541440
status: test
tags:
- attack.defense_evasion
- attack.t1218
title: Abusing Print Executable
