author: '@Kostastsale, @TheDFIRReport, slightly modified by pH-T'
category: process_creation
date: 2022/02/12
description: Detects the creation of a schtask that executes a base64 encoded payload
  stored in the Windows Registry using PowerShell.
detection:
  condition: all of selection*
  selection1:
    winlog.event_data.CommandLine|contains|all:
    - /Create
    - /SC
    - FromBase64String
    - Get-ItemProperty
    winlog.event_data.Image|endswith: \schtasks.exe
  selection2:
    winlog.event_data.CommandLine|contains:
    - 'HKCU:'
    - 'HKLM:'
    - 'registry::'
    - HKEY_
falsepositives:
- Unknown
id: c4eeeeae-89f4-43a7-8b48-8d1bdfa66c78
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/03/15
product: windows
references:
- https://thedfirreport.com/2022/02/21/qbot-and-zerologon-lead-to-full-domain-compromise/
status: experimental
tags:
- attack.execution
- attack.persistence
- attack.t1053.005
- attack.t1059.001
title: Scheduled Task Executing Powershell Encoded Payload from Registry
