author: frack113
category: process_creation
date: 2021/12/02
description: Detects suspicious command line to remove and 'exe' or 'dll'
detection:
  condition: susp_del_exe or susp_del_dll
  susp_del_dll:
    winlog.event_data.CommandLine|contains|all:
    - 'del '
    - \*.dll
    - C:\ProgramData\
  susp_del_exe:
    winlog.event_data.CommandLine|contains|all:
    - 'del '
    - \*.exe
    - '/f '
    - '/q '
falsepositives:
- Unknown
id: 204b17ae-4007-471b-917b-b917b315c5db
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/08/24
product: windows
references:
- https://www.joesandbox.com/analysis/509330/0/html#1044F3BDBE3BB6F734E357235F4D5898582D
status: experimental
tags:
- attack.defense_evasion
- attack.t1070.004
title: Suspicious Del in CommandLine
