author: Nasreddine Bencherchali @nas_bench
category: process_creation
date: 2021/12/18
description: Threat actors can use the PsLogList utility to dump event log in order
  to extract admin accounts and perform account discovery.
detection:
  condition: 1 of selection*
  selection_flgs:
    winlog.event_data.CommandLine|contains:
    - ' -d'
    - ' /d'
    - ' -x'
    - ' /x'
    - ' -s'
    - ' /s'
    winlog.event_data.CommandLine|contains|all:
    - security
    - accepteula
  selection_img:
  - winlog.event_data.OriginalFileName: psloglist.exe
  - winlog.event_data.Image|endswith:
    - \psloglist.exe
    - \psloglist64.exe
falsepositives:
- Another tool that uses the command line switches of PsLogList
- Legitimate use of PsLogList by an administrator
id: aae1243f-d8af-40d8-ab20-33fc6d0c55bc
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/06/16
product: windows
references:
- https://research.nccgroup.com/2021/01/12/abusing-cloud-services-to-fly-under-the-radar/
- https://www.cybereason.com/blog/deadringer-exposing-chinese-threat-actors-targeting-major-telcos
- https://github.com/3CORESec/MAL-CL/tree/master/Descriptors/Sysinternals/PsLogList
status: experimental
tags:
- attack.discovery
- attack.t1087
- attack.t1087.001
- attack.t1087.002
title: Suspicious Use of PsLogList
