author: frack113
category: process_creation
date: 2022/04/16
description: Adversaries may abuse msiexec.exe to proxy the execution of malicious
  payloads
detection:
  condition: selection and not 1 of filter*
  filter_splunk_ufw:
    winlog.event_data.CommandLine|contains: C:\Program Files\SplunkUniversalForwarder\bin\
    winlog.event_data.Image|endswith: :\Windows\System32\cmd.exe
  filter_vs:
  - winlog.event_data.CommandLine|contains: \DismFoDInstall.cmd
  - winlog.event_data.ParentCommandLine|contains|all:
    - '\MsiExec.exe -Embedding '
    - Global\MSI0000
  selection:
    winlog.event_data.Image|endswith:
    - \powershell.exe
    - \pwsh.exe
    - \cmd.exe
    winlog.event_data.ParentCommandLine|contains|all:
    - MsiExec.exe
    - '-Embedding '
falsepositives:
- Unknown
id: 4a2a2c3e-209f-4d01-b513-4155a540b469
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/07/14
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218.007/T1218.007.md
status: experimental
tags:
- attack.t1218.007
- attack.defense_evasion
title: Suspicious MsiExec Embedding Parent
