author: Florian Roth
category: process_creation
date: 2022/01/11
description: Detects a certain command line flag combination used by Microsoft.NodejsTools.PressAnyKey.exe
  that can be used to execute any other binary
detection:
  condition: 1 of selection* and not 1 of filter*
  filter:
    winlog.event_data.Image|contains: \Microsoft\NodeJsTools\NodeJsTools
  selection1:
    winlog.event_data.CommandLine|contains: 'Microsoft.NodejsTools.PressAnyKey.exe
      normal '
  selection2:
    winlog.event_data.CommandLine|contains: '.exe normal '
    winlog.event_data.CommandLine|endswith: .exe
falsepositives:
- Other tools with the same command line flag combination
- Legitimate uses as part of Visual Studio development
id: a20391f8-76fb-437b-abc0-dba2df1952c6
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://twitter.com/mrd0x/status/1463526834918854661
status: experimental
tags:
- attack.execution
- attack.defense_evasion
- attack.t1218
title: NodejsTools PressAnyKey Lolbin
