author: Nasreddine Bencherchali
category: process_creation
date: 2022/06/14
description: Execute commands and binaries from the context of "forfiles". This is
  used as a LOLBIN for example to bypass application whitelisting.
detection:
  condition: all of selection*
  selection_cli_c:
    winlog.event_data.CommandLine|contains:
    - ' /c '
    - ' -c '
  selection_cli_m:
    winlog.event_data.CommandLine|contains:
    - ' /m '
    - ' -m '
  selection_cli_p:
    winlog.event_data.CommandLine|contains:
    - ' /p '
    - ' -p '
  selection_img:
  - winlog.event_data.Image|endswith: \forfiles.exe
  - winlog.event_data.OriginalFileName: forfiles.exe
falsepositives:
- Legitimate use by a via a batch script or by an administrator.
id: 9aa5106d-bce3-4b13-86df-3a20f1d5cf0b
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://lolbas-project.github.io/lolbas/Binaries/Forfiles/
- https://pentestlab.blog/2020/07/06/indirect-command-execution/
status: experimental
tags:
- attack.execution
- attack.t1059
title: Use of Forfiles For Execution
