author: Thomas Patzke
category: process_creation
date: 2017/06/12
description: Detects PsExec service installation and execution events (service and
  Sysmon)
detection:
  condition: selection
  selection:
    winlog.event_data.Image|endswith: \PSEXESVC.exe
    winlog.event_data.User|contains:
    - AUTHORI
    - AUTORI
falsepositives:
- Unknown
fields:
- winlog.event_id
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
- winlog.event_data.ServiceName
- winlog.event_data.ServiceFileName
- winlog.event_data.TargetFilename
- winlog.event_data.PipeName
id: fa91cc36-24c9-41ce-b3c8-3bbc3f2f67ba
level: low
logsource:
  category: process_creation
  product: windows
modified: 2022/05/27
product: windows
references:
- https://www.jpcert.or.jp/english/pub/sr/ir_research.html
- https://jpcertcc.github.io/ToolAnalysisResultSheet
related:
- id: 42c575ea-e41e-41f1-b248-8093c3e82a28
  type: derived
status: experimental
tags:
- attack.execution
- attack.t1569.002
- attack.s0029
title: PsExec Tool Execution
