author: Jakob Weinzettl, oscd.community, Nasreddine Bencherchali
category: process_creation
date: 2019/10/23
description: Detects a file or folder's permissions being modified.
detection:
  condition: 1 of selection* and not 1 of filter*
  filter_grant:
    winlog.event_data.CommandLine|contains|all:
    - 'ICACLS C:\ProgramData\dynatrace\gateway\config\config.properties /grant :r '
    - S-1-5-19:F
  filter_programs:
  - winlog.event_data.Image|contains: \AppData\Local\Programs\Microsoft VS Code
  - winlog.event_data.Image|endswith: \Microsoft VS Code\Code.exe
  filter_reset:
    winlog.event_data.CommandLine|endswith: ICACLS C:\ProgramData\dynatrace\gateway\config\connectivity.history
      /reset
  selection:
    winlog.event_data.CommandLine|contains: /grant
    winlog.event_data.Image|endswith:
    - \takeown.exe
    - \cacls.exe
    - \icacls.exe
    - \net.exe
    - \net1.exe
  selection2:
    winlog.event_data.CommandLine|contains: -r
    winlog.event_data.Image|endswith: \attrib.exe
falsepositives:
- Users interacting with the files on their own (unlikely unless privileged users).
- Dynatrace app
fields:
- winlog.ComputerName
- winlog.event_data.User
- winlog.event_data.CommandLine
id: 37ae075c-271b-459b-8d7b-55ad5f993dd8
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/09/03
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1222.001/T1222.001.md
- https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/hh750728(v=ws.11)
status: test
tags:
- attack.defense_evasion
- attack.t1222.001
title: File or Folder Permissions Modifications
