author: Florian Roth
category: process_creation
date: 2022/07/23
description: Detects the use of parent process ID spoofing tools like Didier Stevens
  tool SelectMyParent
detection:
  condition: selection
  selection:
  - winlog.event_data.Image|endswith: \SelectMyParent.exe
  - winlog.event_data.CommandLine|contains:
    - PPID-spoof
    - ppid_spoof
    - spoof-ppid
    - spoof_ppid
    - ppidspoof
    - spoofppid
    - spoofedppid
    - ' -spawnto '
  - winlog.event_data.OriginalFileName|contains:
    - PPID-spoof
    - ppid_spoof
    - spoof-ppid
    - spoof_ppid
    - ppidspoof
    - spoofppid
    - spoofedppid
  - winlog.event_data.Description: SelectMyParent
  - winlog.event_data.Imphash:
    - 04d974875bd225f00902b4cad9af3fbc
    - a782af154c9e743ddf3f3eb2b8f3d16e
    - 89059503d7fbf470e68f7e63313da3ad
    - ca28337632625c8281ab8a130b3d6bad
  - winlog.event_data.Hashes|contains:
    - IMPHASH=04D974875BD225F00902B4CAD9AF3FBC
    - IMPHASH=A782AF154C9E743DDF3F3EB2B8F3D16E
    - IMPHASH=89059503D7FBF470E68F7E63313DA3AD
    - IMPHASH=CA28337632625C8281AB8A130B3D6BAD
falsepositives:
- Unlikely
id: 52ff7941-8211-46f9-84f8-9903efb7077d
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://pentestlab.blog/2020/02/24/parent-pid-spoofing/
- https://www.picussecurity.com/resource/blog/how-to-detect-parent-pid-ppid-spoofing-attacks
- https://www.ired.team/offensive-security/defense-evasion/parent-process-id-ppid-spoofing
- https://www.virustotal.com/gui/search/filename%253A*spoof*%2520filename%253A*ppid*/files
status: test
tags:
- attack.defense_evasion
- attack.t1134.004
title: PPID Spoofing Tool Usage
