author: Teymur Kheirkhabarov (idea), Vasiliy Burov (rule), oscd.community, Tim Shelton
category: process_creation
date: 2020/10/11
description: Detects specific combinations of encoding methods in the PowerShell command
  lines
detection:
  condition: selection_img and (all of selection_to_* or 1 of selection_gen_*)
  selection_gen_1:
    winlog.event_data.CommandLine|contains|all:
    - char
    - join
  selection_gen_2:
    winlog.event_data.CommandLine|contains|all:
    - split
    - join
  selection_img:
    winlog.event_data.Image|endswith:
    - \powershell.exe
    - \pwsh.exe
  selection_to_1:
    winlog.event_data.CommandLine|contains:
    - ToInt
    - ToDecimal
    - ToByte
    - ToUint
    - ToSingle
    - ToSByte
  selection_to_2:
    winlog.event_data.CommandLine|contains:
    - ToChar
    - ToString
    - String
falsepositives:
- Unlikely
id: cdf05894-89e7-4ead-b2b0-0a5f97a90f2f
level: low
logsource:
  category: process_creation
  product: windows
modified: 2022/07/14
product: windows
references:
- https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=65
related:
- id: 5b572dcf-254b-425c-a8c5-d9af6bea35a6
  type: similar
status: test
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
title: Encoded PowerShell Command Line
