author: Victor Sergeev, oscd.community
category: process_creation
date: 2020/10/09
description: Detects when verclsid.exe is used to run COM object via GUID
detection:
  condition: all of selection_*
  selection_cli:
    winlog.event_data.CommandLine|contains|all:
    - /S
    - /C
  selection_img:
  - winlog.event_data.Image|endswith: \verclsid.exe
  - winlog.event_data.OriginalFileName: verclsid.exe
falsepositives:
- Unknown
fields:
- winlog.event_data.CommandLine
id: d06be4b9-8045-428b-a567-740a26d9db25
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/07/11
product: windows
references:
- https://lolbas-project.github.io/lolbas/Binaries/Verclsid/
- https://gist.github.com/NickTyrer/0598b60112eaafe6d07789f7964290d5
- https://bohops.com/2018/08/18/abusing-the-com-registry-structure-part-2-loading-techniques-for-evasion-and-persistence/
status: test
tags:
- attack.defense_evasion
- attack.t1218
title: Verclsid.exe Runs COM Object
