author: Florian Roth
category: process_creation
date: 2021/04/29
description: Detects requests to exclude files, folders or processes from Antivirus
  scanning using PowerShell cmdlets
detection:
  condition: all of selection*
  selection1:
    winlog.event_data.CommandLine|contains:
    - 'Add-MpPreference '
    - 'Set-MpPreference '
  selection2:
    winlog.event_data.CommandLine|contains:
    - ' -ExclusionPath '
    - ' -ExclusionExtension '
    - ' -ExclusionProcess '
    - ' -ExclusionIpAddress '
falsepositives:
- Possible Admin Activity
- Other Cmdlets that may use the same parameters
id: 17769c90-230e-488b-a463-e05c08e9d48f
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/05/12
product: windows
references:
- https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/configure-process-opened-file-exclusions-microsoft-defender-antivirus
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md
- https://twitter.com/AdamTheAnalyst/status/1483497517119590403
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001
title: Powershell Defender Exclusion
