author: omkar72
category: process_creation
date: 2020/10/30
description: Detects user accept agreement execution in psexec commandline
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains: accepteula
    winlog.event_data.Image|endswith: \psexec.exe
falsepositives:
- Administrative scripts.
fields:
- winlog.event_data.Image
- winlog.event_data.CommandLine
id: 730fc21b-eaff-474b-ad23-90fd265d4988
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/06/23
product: windows
references:
- https://www.fireeye.com/blog/threat-research/2020/10/kegtap-and-singlemalt-with-a-ransomware-chaser.html
status: test
tags:
- attack.execution
- attack.t1569
- attack.t1021
title: Psexec Accepteula Condition
