author: Florian Roth
category: process_creation
date: 2022/02/25
description: Detects suspicious sub processes started by the ScreenConnect client
  service, which indicates the use of the so-called Backstage mode
detection:
  condition: selection
  selection:
    winlog.event_data.Image|endswith:
    - \cmd.exe
    - \powershell.exe
    - \pwsh.exe
    winlog.event_data.ParentImage|endswith: ScreenConnect.ClientService.exe
falsepositives:
- Case in which administrators are allowed to use ScreenConnect's Backstage mode
id: 7b582f1a-b318-4c6a-bf4e-66fe49bf55a5
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/07/27
product: windows
references:
- https://www.mandiant.com/resources/telegram-malware-iranian-espionage
- https://docs.connectwise.com/ConnectWise_Control_Documentation/Get_started/Host_client/View_menu/Backstage_mode
status: experimental
tags:
- attack.command_and_control
- attack.t1219
title: ScreenConnect Backstage Mode Anomaly
