author: frack113
category: process_creation
date: 2022/05/07
description: Detect use of ie4uinit.exe to execute commands from a specially prepared
  ie4uinit.inf file from a directory other than the usual directories
detection:
  condition: lolbin and not 1 of filter_*
  filter_correct:
    winlog.event_data.CurrentDirectory:
    - c:\windows\system32\
    - c:\windows\sysWOW64\
  filter_missing:
    winlog.event_data.CurrentDirectory: null
  lolbin:
  - winlog.event_data.Image|endswith: \ie4uinit.exe
  - winlog.event_data.OriginalFileName: IE4UINIT.EXE
falsepositives:
- Unknown
id: d3bf399f-b0cf-4250-8bb4-dfc192ab81dc
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/05/16
product: windows
references:
- https://lolbas-project.github.io/lolbas/Binaries/Ie4uinit/
- https://bohops.com/2018/03/10/leveraging-inf-sct-fetch-execute-techniques-for-bypass-evasion-persistence-part-2/
status: experimental
tags:
- attack.defense_evasion
- attack.t1218
title: Ie4uinit Lolbin Use From Invalid Path
