author: David Burkett
category: process_creation
date: 2019/12/28
description: It is extremely abnormal for svchost.exe to spawn without any CLI arguments
  and is normally observed when a malicious process spawns the process and injects
  code into the process memory space.
detection:
  condition: selection and not filter
  filter:
  - winlog.event_data.ParentImage|endswith:
    - \rpcnet.exe
    - \rpcnetp.exe
  - winlog.event_data.CommandLine: null
  selection:
    winlog.event_data.CommandLine|endswith: svchost.exe
    winlog.event_data.Image|endswith: \svchost.exe
falsepositives:
- Rpcnet.exe / rpcnetp.exe which is a lojack style software. https://www.blackhat.com/docs/us-14/materials/us-14-Kamlyuk-Kamluk-Computrace-Backdoor-Revisited.pdf
fields:
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: 16c37b52-b141-42a5-a3ea-bbe098444397
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/06/27
product: windows
references:
- https://securitybytes.io/blue-team-fundamentals-part-two-windows-processes-759fe15965e2
status: experimental
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1055
title: Suspect Svchost Activity
