author: Andreas Hunkeler (@Karneades)
category: process_creation
date: 2021/12/22
description: Detects suspicious shell spawn from Java utility keytool process (e.g.
  adselfservice plus exploitation)
detection:
  condition: selection
  selection:
    winlog.event_data.Image|endswith:
    - \cmd.exe
    - \sh.exe
    - \bash.exe
    - \powershell.exe
    - \pwsh.exe
    - \schtasks.exe
    - \certutil.exe
    - \whoami.exe
    - \bitsadmin.exe
    - \wscript.exe
    - \cscript.exe
    - \scrcons.exe
    - \regsvr32.exe
    - \hh.exe
    - \wmic.exe
    - \mshta.exe
    - \rundll32.exe
    - \forfiles.exe
    - \scriptrunner.exe
    - \mftrace.exe
    - \AppVLP.exe
    winlog.event_data.ParentImage|endswith: \keytool.exe
falsepositives:
- Unknown
id: 90fb5e62-ca1f-4e22-b42e-cc521874c938
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/07/14
product: windows
references:
- https://redcanary.com/blog/intelligence-insights-december-2021
- https://www.synacktiv.com/en/publications/how-to-exploit-cve-2021-40539-on-manageengine-adselfservice-plus.html
status: experimental
tags:
- attack.initial_access
- attack.persistence
- attack.privilege_escalation
title: Suspicious Shells Spawn by Java Utility Keytool
