author: Nasreddine Bencherchali
category: process_creation
date: 2022/09/01
description: Detects usage of a CLSID folder name located in a suspicious location
  from the commandline as seen being used in IcedID
detection:
  condition: all of selection_* and not filter
  filter:
    winlog.event_data.Image|contains|all:
    - \{
    - '}\'
  selection_clsid:
    winlog.event_data.CommandLine|contains|all:
    - \{
    - '}\'
  selection_folder:
    winlog.event_data.CommandLine|contains:
    - \AppData\Roaming\
    - \AppData\Local\Temp\
falsepositives:
- Some FP is expected with some installers
id: 90b63c33-2b97-4631-a011-ceb0f47b77c3
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://twitter.com/Kostastsale/status/1565257924204986369
status: experimental
tags:
- attack.defense_evasion
- attack.t1027
title: Suspicious CLSID Folder Name In Suspicious Locations
