author: Florian Roth
category: process_creation
date: 2020/07/10
description: Detects Golden Chickens deployment method as used by Evilnum in report
  published in July 2020
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains|all:
    - regsvr32
    - /s
    - /i
    - \AppData\Roaming\
    - .ocx
falsepositives:
- Unknown
id: 8acf3cfa-1e8c-4099-83de-a0c4038e18f0
level: critical
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
product: windows
references:
- https://www.welivesecurity.com/2020/07/09/more-evil-deep-look-evilnum-toolset/
- https://app.any.run/tasks/33d37fdf-158d-4930-aa68-813e1d5eb8ba/
status: test
tags:
- attack.defense_evasion
- attack.t1218.011
title: EvilNum Golden Chickens Deployment via OCX Files
