author: Teymur Kheirkhabarov, oscd.community, David ANDRE (additional keywords), Tim
  Shelton
category: process_creation
date: 2019/10/22
description: Detection well-known mimikatz command line arguments
detection:
  condition: ( selection_1 or (module_names and mimikatz_separator) or (function_names
    and mimikatz_separator) ) and not 1 of filter*
  filter_1:
    winlog.event_data.CommandLine|contains: function Convert-GuidToCompressedGuid
  function_names:
    winlog.event_data.CommandLine|contains:
    - aadcookie
    - detours
    - memssp
    - mflt
    - ncroutemon
    - ngcsign
    - printnightmare
    - skeleton
    - preshutdown
    - mstsc
    - multirdp
  mimikatz_separator:
    winlog.event_data.CommandLine|contains: '::'
  module_names:
    winlog.event_data.CommandLine|contains:
    - rpc
    - token
    - crypto
    - dpapi
    - sekurlsa
    - kerberos
    - lsadump
    - privilege
    - process
    - vault
  selection_1:
    winlog.event_data.CommandLine|contains:
    - DumpCreds
    - invoke-mimikatz
falsepositives:
- Legitimate Administrator using tool for password recovery
id: a642964e-bead-4bed-8910-1bb4d63e3b4d
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/02/07
product: windows
references:
- https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
- https://tools.thehacker.recipes/mimikatz/modules
status: test
tags:
- attack.credential_access
- attack.t1003.001
- attack.t1003.002
- attack.t1003.004
- attack.t1003.005
- attack.t1003.006
title: Mimikatz Command Line
