author: Nik Seetharaman, frack113
category: process_creation
date: 2019/01/16
description: Detects invocation of Microsoft Workflow Compiler, which may permit the
  execution of arbitrary unsigned code.
detection:
  condition: selection or selection_t1218
  selection:
    winlog.event_data.Image|endswith: \Microsoft.Workflow.Compiler.exe
  selection_t1218:
    winlog.event_data.CommandLine|contains: .xml
    winlog.event_data.OriginalFileName: Microsoft.Workflow.Compiler.exe
falsepositives:
- Legitimate MWC use (unlikely in modern enterprise environments)
fields:
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: 419dbf2b-8a9b-4bea-bf99-7544b050ec8d
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/07/13
product: windows
references:
- https://posts.specterops.io/arbitrary-unsigned-code-execution-vector-in-microsoft-workflow-compiler-exe-3d9294bc5efb
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218/T1218.md
status: experimental
tags:
- attack.defense_evasion
- attack.execution
- attack.t1127
- attack.t1218
title: Microsoft Workflow Compiler
