author: omkar72
category: process_creation
date: 2020/10/25
description: Detects the conhost execution as parent process. Can be used to evaded
  defense mechanism.
detection:
  condition: selection and not filter
  filter:
    Provider_Name: SystemTraceProvider-Process
  selection:
    winlog.event_data.ParentImage|endswith: \conhost.exe
falsepositives:
- Unlikely, conhost is a child less process
fields:
- winlog.event_data.Image
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: 7dc2dedd-7603-461a-bc13-15803d132355
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2021/12/17
product: windows
references:
- http://www.hexacorn.com/blog/2020/05/25/how-to-con-your-host/
status: experimental
tags:
- attack.defense_evasion
- attack.t1202
title: Conhost Parent Process Executions
