author: Timur Zinniatullin, Daniil Yugoslavskiy, oscd.community
category: process_creation
date: 2019/10/21
description: Detects creation of a new service.
detection:
  condition: 1 of selection*
  selection_posh:
    winlog.event_data.CommandLine|contains|all:
    - New-Service
    - -BinaryPathName
  selection_sc:
    winlog.event_data.CommandLine|contains|all:
    - create
    - binPath
    winlog.event_data.Image|endswith: \sc.exe
falsepositives:
- Legitimate administrator or user creates a service for legitimate reasons.
id: 7fe71fc9-de3b-432a-8d57-8c809efc10ab
level: low
logsource:
  category: process_creation
  product: windows
modified: 2022/07/14
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1543.003/T1543.003.md
status: test
tags:
- attack.persistence
- attack.privilege_escalation
- attack.t1543.003
title: New Service Creation
