author: Ecco, E.M. Anhaus, oscd.community
category: process_creation
date: 2019/09/26
description: Detects suspicious parameters of fsutil (deleting USN journal, configuring
  it with small size, etc). Might be used by ransomwares during the attack (seen by
  NotPetya and others).
detection:
  condition: all of selection_*
  selection_cli:
    winlog.event_data.CommandLine|contains:
    - deletejournal
    - createjournal
  selection_img:
  - winlog.event_data.Image|endswith: \fsutil.exe
  - winlog.event_data.OriginalFileName: fsutil.exe
falsepositives:
- Admin activity
- Scripts and administrative tools used in the monitored environment
id: add64136-62e5-48ea-807e-88638d02df1e
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/07/11
product: windows
references:
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/fsutil-usn
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1070/T1070.md
- https://eqllib.readthedocs.io/en/latest/analytics/c91f422a-5214-4b17-8664-c5fcf115c0a2.html
status: stable
tags:
- attack.defense_evasion
- attack.t1070
title: Fsutil Suspicious Invocation
