author: Nasreddine Bencherchali
category: process_creation
date: 2022/06/28
description: Detects usage of attrib with "+s" option to set suspicious script or
  executable as system files to hide them from users and make them unable to delete
  with simple rights. The rule limit the search to specific extensions and directories
  to avoid FP's
detection:
  condition: all of selection* and not filter
  filter:
    winlog.event_data.CommandLine|contains|all:
    - \Windows\TEMP\
    - .exe
  selection_basic:
    winlog.event_data.CommandLine|contains: ' +s'
    winlog.event_data.Image|endswith: \attrib.exe
  selection_ext:
    winlog.event_data.CommandLine|contains:
    - .bat
    - .ps1
    - .vbe
    - .vbs
    - .exe
  selection_paths:
    winlog.event_data.CommandLine|contains:
    - ' %'
    - \Users\Public\
    - \AppData\Local\
    - \ProgramData\
    - \Downloads\
    - \Windows\Temp\
falsepositives:
- Unknown
id: efec536f-72e8-4656-8960-5e85d091345b
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://app.any.run/tasks/c28cabc8-a19f-40f3-a78b-cae506a5c0d4
- https://app.any.run/tasks/cfc8870b-ccd7-4210-88cf-a8087476a6d0
related:
- id: bb19e94c-59ae-4c15-8c12-c563d23fe52b
  type: derived
status: experimental
tags:
- attack.defense_evasion
- attack.t1564.001
title: Set Suspicious Files as System Files Using Attrib
