author: Florian Roth
category: process_creation
date: 2018/12/19
description: Detects the execution of the hacktool Rubeus via PE information of command
  line parameters
detection:
  condition: selection
  selection:
  - winlog.event_data.Image|endswith: \Rubeus.exe
  - winlog.event_data.OriginalFileName: Rubeus.exe
  - winlog.event_data.CommandLine|contains:
    - ' asreproast '
    - ' dump /service:krbtgt '
    - ' kerberoast '
    - ' createnetonly /program:'
    - ' ptt /ticket:'
    - ' /impersonateuser:'
    - ' renew /ticket:'
    - ' asktgt /user:'
    - ' harvest /interval:'
    - ' s4u /user:'
    - ' s4u /ticket:'
    - ' hash /password:'
falsepositives:
- Unlikely
id: 7ec2c172-dceb-4c10-92c9-87c1881b7e18
level: critical
logsource:
  category: process_creation
  product: windows
modified: 2022/07/20
product: windows
references:
- https://www.harmj0y.net/blog/redteaming/from-kekeo-to-rubeus/
- https://m0chan.github.io/2019/07/31/How-To-Attack-Kerberos-101.html
status: stable
tags:
- attack.credential_access
- attack.t1003
- attack.t1558.003
- attack.lateral_movement
- attack.t1550.003
title: Rubeus Hack Tool
