author: Sreeman
category: process_creation
date: 2020/10/29
description: Detects dropping of dll files in system32 that may be used to retrieve
  user credentials from LSASS
detection:
  condition: selection_cmdline
  selection_cmdline:
    winlog.event_data.CommandLine|contains|all:
    - HKLM\SYSTEM\CurrentControlSet\Control\Lsa
    - scecli\0*
    - reg add
falsepositives:
- Unknown
id: b7966f4a-b333-455b-8370-8ca53c229762
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2021/06/11
product: windows
references:
- https://pentestlab.blog/2020/02/10/credential-access-password-filter-dll/
- https://github.com/3gstudent/PasswordFilter/tree/master/PasswordFilter
status: experimental
tags:
- attack.credential_access
- attack.t1556.002
title: Dropping Of Password Filter DLL
