author: Furkan CALISKAN, @caliskanfurkan_, @oscd_initiative, Nasreddine Bencherchali
category: process_creation
date: 2020/10/05
description: Attackers can use findstr to hide their artifacts or search specific
  strings and evade defense mechanism
detection:
  condition: selection_findstr and (all of selection_cli_download* or all of selection_cli_creds*)
  selection_cli_creds_1:
    winlog.event_data.CommandLine|contains:
    - /s
    - -s
  selection_cli_creds_2:
    winlog.event_data.CommandLine|contains:
    - /i
    - -i
  selection_cli_download_1:
    winlog.event_data.CommandLine|contains:
    - /v
    - -v
  selection_cli_download_2:
    winlog.event_data.CommandLine|contains:
    - /l
    - -l
  selection_findstr:
  - winlog.event_data.CommandLine|contains: findstr
  - winlog.event_data.Image|endswith: findstr.exe
  - winlog.event_data.OriginalFileName: FINDSTR.EXE
falsepositives:
- Administrative findstr usage
id: bf6c39fc-e203-45b9-9538-05397c1b4f3f
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/06/20
product: windows
references:
- https://lolbas-project.github.io/lolbas/Binaries/Findstr/
- https://oddvar.moe/2018/04/11/putting-data-in-alternate-data-streams-and-how-to-execute-it-part-2/
- https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f
status: test
tags:
- attack.defense_evasion
- attack.t1218
- attack.t1564.004
- attack.t1552.001
- attack.t1105
title: Abusing Findstr for Defense Evasion
