author: frack113
category: process_creation
date: 2021/11/26
description: Extract data from cab file and hide it in an alternate data stream
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains|all:
    - extrac32.exe
    - .cab
    winlog.event_data.CommandLine|re: :[^\\\\]
falsepositives:
- Unknown
id: 4b13db67-0c45-40f1-aba8-66a1a7198a1e
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://lolbas-project.github.io/lolbas/Binaries/Extrac32/
status: experimental
tags:
- attack.defense_evasion
- attack.t1564.004
title: Suspicious Extrac32 Alternate Data Stream Execution
