author: Florian Roth
category: process_creation
date: 2019/05/21
description: Detects the execution of a renamed PsExec often used by attackers or
  malware
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.Image|endswith:
    - \PsExec.exe
    - \PsExec64.exe
  selection:
    winlog.event_data.Description: Execute processes remotely
    winlog.event_data.Product: Sysinternals PsExec
falsepositives:
- Software that illegaly integrates PsExec in a renamed form
- Administrators that have renamed PsExec and no one knows why
id: a7a7e0e5-1d57-49df-9c58-9fe5bc0346a2
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
product: windows
references:
- https://www.trendmicro.com/vinfo/hk-en/security/news/cybercrime-and-digital-threats/megacortex-ransomware-spotted-attacking-enterprise-networks
status: test
tags:
- car.2013-05-009
- attack.defense_evasion
- attack.t1036.003
title: Renamed PsExec
