author: Nextron Systems
category: process_creation
date: 2022/06/01
description: Detects msdt.exe executed by a suspicious parent as seen in CVE-2022-30190
  / Follina exploitation
detection:
  condition: all of selection_*
  selection_msdt:
  - winlog.event_data.Image|endswith: \msdt.exe
  - winlog.event_data.OriginalFileName: msdt.exe
  selection_parent:
    winlog.event_data.ParentImage|endswith:
    - \powershell.exe
    - \pwsh.exe
    - \cmd.exe
    - \mshta.exe
    - \cscript.exe
    - \wscript.exe
    - \wsl.exe
    - \rundll32.exe
    - \regsvr32.exe
falsepositives:
- Unknown
id: 7a74da6b-ea76-47db-92cc-874ad90df734
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/07/14
product: windows
references:
- https://twitter.com/nao_sec/status/1530196847679401984
- https://app.any.run/tasks/713f05d2-fe78-4b9d-a744-f7c133e3fafb/
status: experimental
tags:
- attack.defense_evasion
- attack.t1036
- attack.t1218
title: MSDT Executed with Suspicious Parent
