author: Avneet Singh @v3t0_, oscd.community
category: process_creation
date: 2020/10/18
description: This rule detects the execution of Run Once task as configured in the
  registry
detection:
  condition: all of selection*
  selection_cli:
    winlog.event_data.CommandLine|contains: ' /AlternateShellStartup'
  selection_img:
  - winlog.event_data.Image|endswith: \runonce.exe
  - winlog.event_data.Description: Run Once Wrapper
falsepositives:
- Unknown
id: 198effb6-6c98-4d0c-9ea3-451fa143c45c
level: low
logsource:
  category: process_creation
  product: windows
modified: 2022/07/11
product: windows
references:
- https://twitter.com/pabraeken/status/990717080805789697
- https://lolbas-project.github.io/lolbas/Binaries/Runonce/
status: test
tags:
- attack.defense_evasion
- attack.t1112
title: Run Once Task Execution as Configured in Registry
