author: Markus Neis, Sander Wiebing
category: process_creation
date: 2019/01/29
description: Allow Incoming Connections by Port or Application on Windows Firewall
detection:
  condition: all of selection* and not 1 of filter_*
  filter_dropbox:
    winlog.event_data.CommandLine|contains:
    - \netsh.exe advfirewall firewall add rule name=Dropbox dir=in action=allow "program=C:\Program
      Files (x86)\Dropbox\Client\Dropbox.exe" enable=yes profile=Any
    - \netsh.exe advfirewall firewall add rule name=Dropbox dir=in action=allow "program=C:\Program
      Files\Dropbox\Client\Dropbox.exe" enable=yes profile=Any
  selection1:
    winlog.event_data.Image|endswith: \netsh.exe
  selection2:
    winlog.event_data.CommandLine|contains|all:
    - firewall
    - add
falsepositives:
- Legitimate administration
id: cd5cfd80-aa5f-44c0-9c20-108c4ae12e3c
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/02/10
product: windows
references:
- https://attack.mitre.org/software/S0246/ (Lazarus HARDRAIN)
- https://www.operationblockbuster.com/wp-content/uploads/2016/02/Operation-Blockbuster-RAT-and-Staging-Report.pdf
status: test
tags:
- attack.defense_evasion
- attack.t1562.004
title: Netsh Port or Application Allowed
