author: elhoim, CD_ROM_
category: process_creation
date: 2022/04/27
description: Detects RunDLL32.exe spawning explorer.exe as child, which is very uncommon,
  often observes Gamarue spawning the explorer.exe process in an unusual way
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.ParentCommandLine|contains: \shell32.dll,Control_RunDLL
  selection:
    winlog.event_data.Image|endswith: \explorer.exe
    winlog.event_data.ParentImage|endswith: \rundll32.exe
falsepositives:
- Unknown
id: caa06de8-fdef-4c91-826a-7f9e163eef4b
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/05/25
product: windows
references:
- https://redcanary.com/blog/intelligence-insights-november-2021/
status: experimental
tags:
- attack.defense_evasion
- attack.t1218.011
title: RunDLL32 Spawning Explorer
