author: Nasreddine Bencherchali
category: process_creation
date: 2022/06/20
description: Detects wmic known recon method to look for installed hotfixes, often
  used by pentest and attackers enum scripts
detection:
  condition: all of selection*
  selection_cli:
    winlog.event_data.CommandLine|contains|all:
    - ' qfe '
    - ' get '
    - Caption,Description,HotFixID,InstalledOn
  selection_img:
  - winlog.event_data.OriginalFileName: wmic.exe
  - winlog.event_data.Image|endswith: \WMIC.exe
falsepositives:
- Unknown
id: dfd2fcb7-8bd5-4daa-b132-5adb61d6ad45
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://github.com/carlospolop/PEASS-ng/blob/fa0f2e17fbc1d86f1fd66338a40e665e7182501d/winPEAS/winPEASbat/winPEAS.bat
- https://sushant747.gitbooks.io/total-oscp-guide/content/privilege_escalation_windows.html
status: experimental
tags:
- attack.execution
- attack.t1047
title: WMIC Hotfix Recon
