author: frack113
category: process_creation
date: 2021/12/13
description: Detects the execution of a AdFind for enumeration based on it's commadline
  flags
detection:
  condition: 1 of selection_*
  selection_enum_ad:
    winlog.event_data.CommandLine|contains: -sc admincountdmp
  selection_enum_exchange:
    winlog.event_data.CommandLine|contains: -sc exchaddresses
  selection_password:
    winlog.event_data.CommandLine|contains:
    - lockoutduration
    - lockoutthreshold
    - lockoutobservationwindow
    - maxpwdage
    - minpwdage
    - minpwdlength
    - pwdhistorylength
    - pwdproperties
falsepositives:
- Administrative activity
id: 455b9d50-15a1-4b99-853f-8d37655a4c1b
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/08/12
product: windows
references:
- https://www.joeware.net/freetools/tools/adfind/
- https://social.technet.microsoft.com/wiki/contents/articles/7535.adfind-command-examples.aspx
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1087.002/T1087.002.md
status: experimental
tags:
- attack.discovery
- attack.t1087.002
title: Suspicious AdFind Enumeration
