author: Florian Roth, Markus Neis, Jonhnathan Ribeiro, Daniil Yugoslavskiy, oscd.community
category: process_creation
date: 2018/03/23
description: Detects Chafer activity attributed to OilRig as reported in Nyotron report
  in March 2018
detection:
  condition: 1 of selection*
  selection_process0:
    winlog.event_data.CommandLine|contains: \Service.exe
    winlog.event_data.CommandLine|endswith:
    - i
    - u
  selection_process1:
  - winlog.event_data.CommandLine|endswith: \microsoft\Taskbar\autoit3.exe
  - winlog.event_data.CommandLine|startswith: C:\wsc.exe
  selection_process2:
    winlog.event_data.Image|contains: \Windows\Temp\DB\
    winlog.event_data.Image|endswith: .exe
  selection_process3:
    winlog.event_data.CommandLine|contains|all:
    - \nslookup.exe
    - -q=TXT
    winlog.event_data.ParentImage|contains: \Autoit
falsepositives:
- Unknown
id: ce6e34ca-966d-41c9-8d93-5b06c8b97a06
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/09/19
product: windows
references:
- https://nyotron.com/nyotron-discovers-next-generation-oilrig-attacks/
related:
- id: 53ba33fd-3a50-4468-a5ef-c583635cfa92
  type: derived
status: test
tags:
- attack.persistence
- attack.g0049
- attack.t1053.005
- attack.s0111
- attack.t1543.003
- attack.defense_evasion
- attack.t1112
- attack.command_and_control
- attack.t1071.004
title: Chafer Activity
