author: Andreas Hunkeler (@Karneades), Florian Roth
category: process_creation
date: 2021/12/17
description: Detects suspicious shell spawned from Java host process (e.g. log4j exploitation)
detection:
  condition: selection
  selection:
    winlog.event_data.Image|endswith:
    - \sh.exe
    - \bash.exe
    - \powershell.exe
    - \pwsh.exe
    - \schtasks.exe
    - \certutil.exe
    - \whoami.exe
    - \bitsadmin.exe
    - \wscript.exe
    - \cscript.exe
    - \scrcons.exe
    - \regsvr32.exe
    - \hh.exe
    - \wmic.exe
    - \mshta.exe
    - \rundll32.exe
    - \forfiles.exe
    - \scriptrunner.exe
    - \mftrace.exe
    - \AppVLP.exe
    - \curl.exe
    winlog.event_data.ParentImage|endswith: \java.exe
falsepositives:
- Legitimate calls to system binaries
- Company specific internal usage
id: 0d34ed8b-1c12-4ff2-828c-16fc860b766d
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/08/02
product: windows
status: experimental
tags:
- attack.initial_access
- attack.persistence
- attack.privilege_escalation
title: Suspicious Shells Spawned by Java
