author: frack113
category: process_creation
date: 2022/01/01
description: Detects usage of the "systeminfo" command to retrieve information
detection:
  condition: selection
  selection:
  - winlog.event_data.Image|endswith: \systeminfo.exe
  - winlog.event_data.OriginalFileName: sysinfo.exe
falsepositives:
- Unknown
id: 0ef56343-059e-4cb6-adc1-4c3c967c5e46
level: low
logsource:
  category: process_creation
  product: windows
modified: 2022/07/14
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1082/T1082.md#atomic-test-1---system-information-discovery
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/systeminfo
status: experimental
tags:
- attack.discovery
- attack.t1082
title: Suspicious Execution of Systeminfo
