author: Sreeman, Florian Roth
category: process_creation
date: 2022/01/04
description: This is an unusual method to download files. It starts a browser headless
  and downloads a file from a location. This can be used by threat actors to download
  files.
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains|all:
    - --headless
    - dump-dom
    - http
    winlog.event_data.Image|endswith:
    - \msedge.exe
    - \chrome.exe
falsepositives:
- Unknown
fields:
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: 0e8cfe08-02c9-4815-a2f8-0d157b7ed33e
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://twitter.com/mrd0x/status/1478234484881436672?s=12
status: experimental
tags:
- attack.command_and_control
- attack.t1105
title: File Download with Headless Browser
