author: frack113
category: process_creation
date: 2021/10/12
description: Conti ransomware command line ioc
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains|all:
    - '-m '
    - '-net '
    - '-size '
    - '-nomutex '
    - -p \\
    - $
falsepositives:
- Unknown should be low
id: 689308fc-cfba-4f72-9897-796c1dc61487
level: critical
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://news.sophos.com/en-us/2021/09/03/conti-affiliates-use-proxyshell-exchange-exploit-in-ransomware-attacks/
- https://twitter.com/VK_Intel/status/1447795359900704769?t=Xz7vaLTvaaCZ5kHoZa6gMw&s=19
status: experimental
tags:
- attack.impact
- attack.s0575
- attack.t1486
title: Conti Ransomware Execution
