author: Florian Roth
category: process_creation
date: 2019/02/21
description: Detects Judgement Panda activity as described in Global Threat Report
  2019 by Crowdstrike
detection:
  condition: selection1 or selection2
  selection1:
  - winlog.event_data.CommandLine|endswith: eprod.ldf
  - winlog.event_data.CommandLine|contains:
    - '\ldifde.exe -f -n '
    - '\7za.exe a 1.7z '
    - \aaaa\procdump64.exe
    - \aaaa\netsess.exe
    - \aaaa\7za.exe
    - copy .\1.7z \
    - copy \\client\c$\aaaa\
  selection2:
    winlog.event_data.Image: C:\Users\Public\7za.exe
falsepositives:
- Unknown
id: 03e2746e-2b31-42f1-ab7a-eb39365b2422
level: critical
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
product: windows
references:
- https://www.crowdstrike.com/resources/reports/2019-crowdstrike-global-threat-report/
status: test
tags:
- attack.lateral_movement
- attack.g0010
- attack.credential_access
- attack.t1003.001
- attack.exfiltration
- attack.t1560.001
title: Judgement Panda Exfil Activity
