author: Kirill Kiryanov, oscd.community
category: process_creation
date: 2020/10/08
description: Detects process dump via legitimate sqldumper.exe binary
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains:
    - '0x0110'
    - 0x01100:40
    winlog.event_data.Image|endswith: \sqldumper.exe
falsepositives:
- Legitimate MSSQL Server actions
id: 23ceaf5c-b6f1-4a32-8559-f2ff734be516
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
product: windows
references:
- https://twitter.com/countuponsec/status/910977826853068800
- https://twitter.com/countuponsec/status/910969424215232518
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Sqldumper/
status: test
tags:
- attack.credential_access
- attack.t1003.001
title: Dumping Process via Sqldumper.exe
