author: Nasreddine Bencherchali
category: process_creation
date: 2022/07/28
description: Detects the creation or update of a scheduled task to run with "NT AUTHORITY\SYSTEM"
  privileges
detection:
  condition: all of selection_* and not filter
  filter:
    winlog.event_data.CommandLine|contains: /TN TVInstallRestore
    winlog.event_data.Image|endswith: \schtasks.exe
    winlog.event_data.ParentImage|contains|all:
    - \AppData\Local\Temp\
    - TeamViewer_.exe
  selection_root:
    winlog.event_data.CommandLine|contains:
    - ' /change '
    - ' /create '
    winlog.event_data.Image|endswith: \schtasks.exe
  selection_run:
    winlog.event_data.CommandLine|contains: '/ru '
  selection_user:
    winlog.event_data.CommandLine|contains:
    - NT AUT
    - ' SYSTEM '
falsepositives:
- Unknown
id: 89ca78fd-b37c-4310-b3d3-81a023f83936
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://www.elastic.co/security-labs/exploring-the-qbot-attack-pattern
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/schtasks
status: experimental
tags:
- attack.execution
- attack.persistence
- attack.t1053.005
title: Schtasks Creation Or Modification With SYSTEM Privileges
