author: frack113, Florian Roth
category: process_creation
date: 2021/07/12
description: Detects process injection using the signed Windows tool "Mavinject" via
  the "INJECTRUNNING" flag or a renamed execution of the tool
detection:
  condition: selection_flag or (selection_renamed and not filter_renamed)
  filter_renamed:
    winlog.event_data.Image|endswith:
    - \mavinject32.exe
    - \mavinject64.exe
  selection_flag:
    winlog.event_data.CommandLine|contains: ' /INJECTRUNNING '
  selection_renamed:
    winlog.event_data.OriginalFileName:
    - mavinject32.exe
    - mavinject64.exe
falsepositives:
- Unlikely
fields:
- winlog.ComputerName
- winlog.event_data.User
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: 4f73421b-5a0b-4bbf-a892-5a7fb99bea66
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/09/07
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218/T1218.md
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1056.004/T1056.004.md
- https://posts.specterops.io/mavinject-exe-functionality-deconstructed-c29ab2cf5c0e
- https://twitter.com/gN3mes1s/status/941315826107510784
- https://reaqta.com/2017/12/mavinject-microsoft-injector/
- https://twitter.com/Hexacorn/status/776122138063409152
related:
- id: 17eb8e57-9983-420d-ad8a-2c4976c22eb8
  type: obsoletes
status: experimental
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1055.001
- attack.t1218.013
title: Mavinject Inject DLL Into Running Process
