author: frack113
category: process_creation
date: 2022/01/01
description: 'This tool enables enumeration and exporting of all DNS records in the
  zone for recon purposes of internal networks Python 3 and python.exe must be installed,

  Usee to Query/modify DNS records for Active Directory integrated DNS via LDAP

  '
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains: adidnsdump
    winlog.event_data.Image|endswith: \python.exe
falsepositives:
- Unknown
id: 26d3f0a2-f514-4a3f-a8a7-e7e48a8d9160
level: low
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1018/T1018.md#atomic-test-9---remote-system-discovery---adidnsdump
status: experimental
tags:
- attack.discovery
- attack.t1018
title: Suspicious Execution of Adidnsdump
