author: Vadim Khrykov (ThreatIntel), Cyb3rEng (Rule)
category: process_creation
date: 2021/08/23
description: Initial execution of malicious document calls wmic to execute the file
  with regsvr32
detection:
  condition: selection1 and selection2
  selection1:
  - winlog.event_data.Image|endswith: \wbem\WMIC.exe
  - winlog.event_data.ProcessCommandLine|contains: 'wmic '
  selection2:
    winlog.event_data.ParentImage:
    - winword.exe
    - excel.exe
    - powerpnt.exe
falsepositives:
- Unknown
id: 04f5363a-6bca-42ff-be70-0d28bf629ead
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware/
- https://github.com/vadim-hunter/Detection-Ideas-Rules/blob/main/Threat%20Intelligence/The%20DFIR%20Report/20210329_Sodinokibi_(aka_REvil)_Ransomware.yaml
status: experimental
tags:
- attack.t1204.002
- attack.t1047
- attack.t1218.010
- attack.execution
- attack.defense_evasion
title: Office Applications Spawning Wmi Cli
