author: Jonathan Cheong, oscd.community
category: process_creation
date: 2020/10/15
description: Detects Obfuscated use of stdin to execute PowerShell
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|re: .*cmd.{0,5}(?:\/c|\/r).+powershell.+(?:\$\{?input\}?|noexit).+\"
falsepositives:
- Unknown
id: 6c96fc76-0eb1-11eb-adc1-0242ac120002
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
product: windows
references:
- https://github.com/Neo23x0/sigma/issues/1009
status: test
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
title: Invoke-Obfuscation STDIN+ Launcher
