author: Florian Roth
category: process_creation
date: 2018/03/18
description: Detects the creation of taskmgr.exe process in context of LOCAL_SYSTEM
detection:
  condition: selection
  selection:
    winlog.event_data.Image|endswith: \taskmgr.exe
    winlog.event_data.User|contains:
    - AUTHORI
    - AUTORI
falsepositives:
- Unknown
id: 9fff585c-c33e-4a86-b3cd-39312079a65f
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/05/27
product: windows
status: experimental
tags:
- attack.defense_evasion
- attack.t1036
title: Taskmgr as LOCAL_SYSTEM
