author: Florian Roth
category: process_creation
date: 2019/02/06
description: Detects execution of the Notepad++ updater in a suspicious directory,
  which is often used in DLL side-loading attacks
detection:
  condition: selection and not 1 of filter_*
  filter_end:
    winlog.event_data.Image|endswith:
    - \Program Files\Notepad++\updater\GUP.exe
    - \Program Files (x86)\Notepad++\updater\GUP.exe
  filter_user:
    winlog.event_data.Image|contains: \Users\
    winlog.event_data.Image|endswith:
    - \AppData\Local\Notepad++\updater\GUP.exe
    - \AppData\Roaming\Notepad++\updater\GUP.exe
  selection:
    winlog.event_data.Image|endswith: \GUP.exe
falsepositives:
- Execution of tools named GUP.exe and located in folders different than Notepad++\updater
id: 0a4f6091-223b-41f6-8743-f322ec84930b
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/08/13
product: windows
references:
- https://www.fireeye.com/blog/threat-research/2018/09/apt10-targeting-japanese-corporations-using-updated-ttps.html
status: test
tags:
- attack.defense_evasion
- attack.t1574.002
title: Suspicious GUP Usage
