author: Christopher Peacock @SecurePeacock, SCYTHE @scythe_io
category: process_creation
date: 2022/06/01
description: VisualUiaVerifyNative.exe is a Windows SDK that can be used for AWL bypass
  and is listed in Microsoft's recommended block rules.
detection:
  condition: selection
  selection:
  - winlog.event_data.Image|endswith: \VisualUiaVerifyNative.exe
  - winlog.event_data.OriginalFileName: VisualUiaVerifyNative.exe
falsepositives:
- Legitimate testing of Microsoft UI parts.
id: b30a8bc5-e21b-4ca2-9420-0a94019ac56a
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/VisualUiaVerifyNative/
- https://docs.microsoft.com/en-us/windows/security/threat-protection/windows-defender-application-control/microsoft-recommended-block-rules
- https://bohops.com/2020/10/15/exploring-the-wdac-microsoft-recommended-block-rules-visualuiaverifynative/
- https://github.com/MicrosoftDocs/windows-itpro-docs/commit/937db704b9148e9cee7c7010cad4d00ce9c4fdad
status: experimental
tags:
- attack.defense_evasion
- attack.t1218
title: Use of VisualUiaVerifyNative.exe
