author: Wojciech Lesicki
category: process_creation
date: 2021/06/01
description: Rundll32 can be use by Cobalt Strike with StartW function to load DLLs
  from the command line.
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains|all:
    - rundll32.exe
    - .dll
    winlog.event_data.CommandLine|endswith:
    - ' StartW'
    - ',StartW'
falsepositives:
- Unknown
id: ae9c6a7c-9521-42a6-915e-5aaa8689d529
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/03/04
product: windows
references:
- https://www.cobaltstrike.com/help-windows-executable
- https://redcanary.com/threat-detection-report/
- https://thedfirreport.com/2020/10/18/ryuk-in-5-hours/
status: test
tags:
- attack.defense_evasion
- attack.t1218.011
title: CobaltStrike Load by Rundll32
