author: Max Altgelt
category: process_creation
date: 2021/12/09
description: Checks whether the image specified in a process creation event doesn't
  refer to an .exe file (caused by process ghosting or other unorthodox methods to
  start a process)
detection:
  condition: not known_image_extension and not 1 of filter*
  filter_com:
    winlog.event_data.Image|endswith: .com
    winlog.event_data.Image|startswith:
    - C:\Windows\System32\
    - C:\Windows\SysWOW64\
  filter_emc_networker:
    winlog.event_data.Image:
    - C:\Program Files\EMC NetWorker\Management\GST\apache\cgi-bin\update_jnlp.cgi
    - C:\Program Files (x86)\EMC NetWorker\Management\GST\apache\cgi-bin\update_jnlp.cgi
  filter_empty:
    winlog.event_data.Image:
    - '-'
    - ''
  filter_image:
    winlog.event_data.Image:
    - Registry
    - MemCompression
  filter_libreoffice:
    winlog.event_data.Image|endswith: \program\soffice.bin
  filter_lzma_exe:
    winlog.event_data.Image|endswith: \LZMA_EXE
  filter_msi_rollbackfiles:
    winlog.event_data.Image|endswith:
    - .rbf
    - .rbs
    winlog.event_data.Image|startswith: C:\Config.Msi\
  filter_myq_server:
    winlog.event_data.Image:
    - C:\Program Files (x86)\MyQ\Server\pcltool.dll
    - C:\Program Files\MyQ\Server\pcltool.dll
  filter_null:
    winlog.event_data.Image: null
  filter_nvidia:
    winlog.event_data.Image|contains: NVIDIA\NvBackend\
    winlog.event_data.Image|endswith: .dat
  filter_pstarts:
    winlog.event_data.ParentImage|startswith:
    - C:\ProgramData\Avira\
    - C:\Windows\System32\DriverStore\FileRepository\
  filter_screensaver:
    winlog.event_data.Image|endswith: .scr
  filter_starts:
    winlog.event_data.Image|startswith: C:\Windows\Installer\MSI
  filter_visualstudio:
    winlog.event_data.Image|endswith: .com
    winlog.event_data.Image|startswith:
    - C:\Program Files\Microsoft Visual Studio\
    - C:\Program Files (x86)\Microsoft Visual Studio
  filter_vscode:
    winlog.event_data.Image|contains|all:
    - C:\Users\
    - \AppData\
    - .tmp
    - CodeSetup
  filter_winpakpro:
    winlog.event_data.Image|endswith: .ngn
    winlog.event_data.Image|startswith:
    - C:\Program Files (x86)\WINPAKPRO\
    - C:\Program Files\WINPAKPRO\
  filter_winscp:
    winlog.event_data.Image|endswith: \WinSCP.com
  filter_wsl:
    winlog.event_data.Image|contains|all:
    - \AppData\Local\Packages\
    - \LocalState\rootfs\
  known_image_extension:
    winlog.event_data.Image|endswith:
    - .exe
    - .tmp
falsepositives:
- Unknown
id: c09dad97-1c78-4f71-b127-7edb2b8e491a
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/06/20
product: windows
references:
- https://pentestlaboratories.com/2021/12/08/process-ghosting/
status: experimental
tags:
- attack.defense_evasion
title: Execution of Suspicious File Type Extension
