author: blueteamer8699
category: process_creation
date: 2022/01/03
description: Adversaries can abuse of C:\Windows\System32\gatherNetworkInfo.vbs script
  along with cscript.exe to gather information about the target
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains|all:
    - cscript.exe
    - gatherNetworkInfo.vbs
falsepositives:
- Administrative activity
fields:
- winlog.event_data.CommandLine
- winlog.event_data.ParentImage
id: 575dce0c-8139-4e30-9295-1ee75969f7fe
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://posts.slayerlabs.com/living-off-the-land/#gathernetworkinfovbs
status: experimental
tags:
- attack.discovery
- attack.group_policy_discovery
- attack.execution
- attack.command_and_scripting_interpreter
- attack.visual_basic
- attack.t1059.005
title: GatherNetworkInfo.vbs Script Usage
