author: frack113
category: process_creation
date: 2022/01/23
description: Detects a suspicious curl process start on Windows with set useragent
  options
detection:
  condition: all of selection_*
  selection_curl:
  - winlog.event_data.Image|endswith: \curl.exe
  - winlog.event_data.Product: The curl executable
  selection_opt:
    winlog.event_data.CommandLine|contains:
    - ' -A '
    - ' --user-agent '
falsepositives:
- Scripts created by developers and admins
- Administrative activity
fields:
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: 3286d37a-00fd-41c2-a624-a672dcd34e60
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://curl.se/docs/manpage.html
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1071.001/T1071.001.md#atomic-test-2---malicious-user-agents---cmd
status: experimental
tags:
- attack.command_and_control
- attack.t1071.001
title: Suspicious Curl Change User Agents
