author: frack113
category: process_creation
date: 2022/02/13
description: load malicious registered COM objects
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains:
    - '-sta '
    - '-localserver '
    winlog.event_data.CommandLine|contains|all:
    - '{'
    - '}'
    winlog.event_data.Image|endswith: \rundll32.exe
falsepositives:
- Legitimate use
id: f1edd233-30b5-4823-9e6a-c4171b24d316
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://nasbench.medium.com/a-deep-dive-into-rundll32-exe-642344b41e90
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1546.015/T1546.015.md
status: experimental
tags:
- attack.privilege_escalation
- attack.persistence
- attack.t1546.015
title: Rundll32 Registered COM Objects
