author: Beyu Denis, oscd.community
category: process_creation
date: 2019/10/26
description: Downloads payload from remote server
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains: http
    winlog.event_data.Image|endswith:
    - \powerpnt.exe
    - \winword.exe
    - \excel.exe
falsepositives:
- Unknown
id: 0c79148b-118e-472b-bdb7-9b57b444cc19
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
product: windows
references:
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Powerpnt/
- https://medium.com/@reegun/unsanitized-file-validation-leads-to-malicious-payload-download-via-office-binaries-202d02db7191
- Reegun J (OCBC Bank)
status: test
tags:
- attack.command_and_control
- attack.t1105
title: Malicious Payload Download via Office Binaries
