author: Kirill Kiryanov, oscd.community
category: process_creation
date: 2019/10/23
description: Detect possible Sysmon driver unload
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains|all:
    - unload
    - sys
    winlog.event_data.Image|endswith: \fltmc.exe
falsepositives:
- Unknown
fields:
- winlog.event_data.CommandLine
- winlog.event_data.Details
id: 4d7cda18-1b12-4e52-b45c-d28653210df8
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/09/27
product: windows
references:
- https://www.darkoperator.com/blog/2018/10/5/operating-offensively-against-sysmon
status: experimental
tags:
- attack.defense_evasion
- attack.t1070
- attack.t1562
- attack.t1562.002
title: Sysmon Driver Unload
