author: frack113
category: process_creation
date: 2021/11/15
description: Suspicious add key for BitLocker
detection:
  condition: set and key
  key:
    winlog.event_data.CommandLine|contains:
    - EnableBDEWithNoTPM
    - UseAdvancedStartup
    - UseTPM
    - UseTPMKey
    - UseTPMKeyPIN
    - RecoveryKeyMessageSource
    - UseTPMPIN
    - RecoveryKeyMessage
  set:
    winlog.event_data.CommandLine|contains|all:
    - REG
    - ADD
    - \SOFTWARE\Policies\Microsoft\FVE
    - /v
    - /f
falsepositives:
- Unknown
id: 0e0255bf-2548-47b8-9582-c0955c9283f5
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/08/05
product: windows
references:
- https://thedfirreport.com/2021/11/15/exchange-exploit-leads-to-domain-wide-ransomware/
status: experimental
tags:
- attack.impact
- attack.t1486
title: Suspicious Reg Add BitLocker
