author: Florian Roth, Bartlomiej Czyz (@bczyz1)
category: process_creation
date: 2019/03/04
description: Detects the deactivation and disabling of the Scheduled defragmentation
  task as seen by Slingshot APT group
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains:
    - /delete
    - /change
    winlog.event_data.CommandLine|contains|all:
    - /TN
    - \Microsoft\Windows\Defrag\ScheduledDefrag
    winlog.event_data.Image|endswith: \schtasks.exe
falsepositives:
- Unknown
id: 958d81aa-8566-4cea-a565-59ccd4df27b0
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2021/09/19
product: windows
references:
- https://securelist.com/apt-slingshot/84312/
tags:
- attack.persistence
- attack.s0111
title: Defrag Deactivation
