author: Avneet Singh @v3t0_, oscd.community
category: process_creation
date: 2020/10/18
description: This rule detects DLL injection and execution via LOLBAS - Tracker.exe
detection:
  condition: all of selection_*
  selection_cli:
    winlog.event_data.CommandLine|contains:
    - ' /d '
    - ' /c '
  selection_img:
  - winlog.event_data.Image|endswith: \tracker.exe
  - winlog.event_data.Description: Tracker
falsepositives:
- Unknown
id: 148431ce-4b70-403d-8525-fcc2993f29ea
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
product: windows
references:
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Tracker/
status: test
tags:
- attack.defense_evasion
- attack.t1055.001
title: DLL Injection with Tracker.exe
