author: frack113
category: process_creation
date: 2021/12/20
description: 'Adversaries may search the Registry on compromised systems for insecurely
  stored credentials.

  The Windows Registry stores configuration information that can be used by the system
  or other programs.

  Adversaries may query the Registry looking for credentials and passwords that have
  been stored for use by other programs or services

  '
detection:
  condition: reg and hive
  hive:
  - winlog.event_data.CommandLine|contains|all:
    - '/f '
    - HKLM
  - winlog.event_data.CommandLine|contains|all:
    - '/f '
    - HKCU
  - winlog.event_data.CommandLine|contains: HKCU\Software\SimonTatham\PuTTY\Sessions
  reg:
    winlog.event_data.CommandLine|contains|all:
    - ' query '
    - '/t '
    - REG_SZ
    - /s
    winlog.event_data.Image|endswith: \reg.exe
falsepositives:
- Unknown
id: e0b0c2ab-3d52-46d9-8cb7-049dc775fbd1
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1552.002/T1552.002.md
status: experimental
tags:
- attack.credential_access
- attack.t1552.002
title: Enumeration for Credentials in Registry
