author: Florian Roth
category: process_creation
date: 2022/08/04
description: Execution of well known tools for data exfiltration and tunneling
detection:
  condition: selection_a or all of selection_b*
  selection_a:
    winlog.event_data.CommandLine|contains: :127.0.0.1:3389
    winlog.event_data.Image|endswith: \plink.exe
  selection_b1:
    winlog.event_data.CommandLine|contains: :3389
    winlog.event_data.Image|endswith: \plink.exe
  selection_b2:
    winlog.event_data.CommandLine|contains:
    - ' -P 443'
    - ' -P 22'
falsepositives:
- Administrative activity
id: f38ce0b9-5e97-4b47-a211-7dc8d8b871da
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://www.microsoft.com/security/blog/2022/07/26/malicious-iis-extensions-quietly-open-persistent-backdoors-into-servers/
status: test
tags:
- attack.command_and_control
- attack.t1572
title: Suspicious Plink Usage RDP Tunneling
