author: Nasreddine Bencherchali
category: process_creation
date: 2022/08/19
description: Detects the execution of sigverif binary as a parent process which could
  indicate it being used as a LOLBIN to proxy execution
detection:
  condition: selection
  selection:
    winlog.event_data.ParentImage|endswith: \sigverif.exe
falsepositives:
- Unknown
id: 7d4aaec2-08ed-4430-8b96-28420e030e04
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://www.hexacorn.com/blog/2018/04/27/i-shot-the-sigverif-exe-the-gui-based-lolbin/
- https://twitter.com/0gtweet/status/1457676633809330184
status: experimental
tags:
- attack.defense_evasion
- attack.t1216
title: Suspicious Sigverif Execution
