author: Nasreddine Bencherchali
category: process_creation
date: 2022/09/05
description: Detects usage of the Sharp Chisel via the commandline arguments
detection:
  condition: 1 of selection_*
  selection_client_server:
    winlog.event_data.CommandLine|contains:
    - 'exe client '
    - 'exe server '
  selection_flags:
    winlog.event_data.CommandLine|contains:
    - ' --socks5'
    - ' --reverse'
    - ' r:'
    - ':127.0.0.1:'
  selection_img:
    winlog.event_data.Image|endswith: \SharpChisel.exe
falsepositives:
- Some flalse positives may occure with other tools with similar commandlines
id: cf93e05e-d798-4d9e-b522-b0248dc61eaf
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://github.com/shantanu561993/SharpChisel
- https://www.sentinelone.com/labs/wading-through-muddy-waters-recent-activity-of-an-iranian-state-sponsored-threat-actor/
status: experimental
tags:
- attack.command_and_control
- attack.t1090.001
title: SharpChisel Usage
