author: frack113
category: process_creation
date: 2021/12/27
description: Look for the encrypted cpassword value within Group Policy Preference
  files on the Domain Controller. This value can be decrypted with gpp-decrypt.
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains|all:
    - cpassword
    - \sysvol\
    - .xml
    winlog.event_data.Image|endswith: \findstr.exe
falsepositives:
- Unknown
id: 91a2c315-9ee6-4052-a853-6f6a8238f90d
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1552.006/T1552.006.md#atomic-test-1---gpp-passwords-findstr
status: experimental
tags:
- attack.credential_access
- attack.t1552.006
title: Findstr GPP Passwords
