author: frack113
category: process_creation
date: 2022/02/13
description: 'An adversary may use legitimate desktop support and remote access software,
  such as Team Viewer, Go2Assist, LogMein, AmmyyAdmin, etc, to establish an interactive
  command and control channel to target systems within networks.

  These services are commonly used as legitimate technical support software, and may
  be allowed by application control within a target environment.

  Remote access tools like VNC, Ammyy, and Teamviewer are used frequently when compared
  with other legitimate software commonly used by adversaries. (Citation: Symantec
  Living off the Land)

  '
detection:
  condition: selection
  selection:
  - winlog.event_data.Description: ScreenConnect Service
  - winlog.event_data.Product: ScreenConnect
  - winlog.event_data.Company: ScreenConnect Software
falsepositives:
- Legitimate use
id: 57bff678-25d1-4d6c-8211-8ca106d12053
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1219/T1219.md#atomic-test-5---screenconnect-application-download-and-install-on-windows
status: experimental
tags:
- attack.command_and_control
- attack.t1219
title: Use of ScreenConnect Remote Access Software
