author: Nasreddine Bencherchali
category: process_creation
date: 2022/08/19
description: Detects usage of "MSOHTMED" to download arbitrary files
detection:
  condition: all of selection*
  selection_cli:
    winlog.event_data.CommandLine|contains:
    - http://
    - https://
    - ftp://
  selection_img:
  - winlog.event_data.Image|endswith: \MSOHTMED.exe
  - winlog.event_data.OriginalFileName: MsoHtmEd.exe
falsepositives:
- Unknown
id: 459f2f98-397b-4a4a-9f47-6a5ec2f1c69d
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://github.com/LOLBAS-Project/LOLBAS/pull/238/files
status: experimental
tags:
- attack.defense_evasion
- attack.execution
- attack.t1218
title: Download Arbitrary Files Via MSOHTMED.EXE
