author: frack113
category: process_creation
date: 2022/03/13
description: An adversary might use WMI to execute commands on a remote system
detection:
  condition: all of selection*
  selection_cli:
    winlog.event_data.CommandLine|contains|all:
    - '/node:'
    - process
    - call
    - create
  selection_img:
  - winlog.event_data.Image|endswith: \WMIC.exe
  - winlog.event_data.OriginalFileName: wmic.exe
falsepositives:
- Unknown
id: e42af9df-d90b-4306-b7fb-05c863847ebd
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/05/13
product: windows
references:
- https://securelist.com/moonbounce-the-dark-side-of-uefi-firmware/105468/
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/wmic
status: experimental
tags:
- attack.execution
- attack.t1047
title: WMI Remote Command Execution
