author: Christian Burkard
category: process_creation
date: 2021/11/24
description: Detects shell32.dll executing a DLL in a suspicious directory
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains:
    - '%AppData%'
    - '%LocalAppData%'
    - '%Temp%'
    - \AppData\
    - \Temp\
    - \Users\Public\
    winlog.event_data.CommandLine|contains|all:
    - shell32.dll
    - Control_RunDLL
    winlog.event_data.Image|endswith: \rundll32.exe
falsepositives:
- Unknown
id: 32b96012-7892-429e-b26c-ac2bf46066ff
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://www.group-ib.com/resources/threat-research/red-curl-2.html
status: experimental
tags:
- attack.defense_evasion
- attack.execution
- attack.t1218.011
title: Shell32 DLL Execution in Suspicious Directory
