author: frack113, Nasreddine Bencherchali
category: process_creation
date: 2022/08/20
description: Detects code execution via Pester.bat (Pester - Powershell Modulte for
  testing)
detection:
  condition: all of selection_*
  selection_cli:
    winlog.event_data.ParentCommandLine|contains:
    - '{ Invoke-Pester -EnableExit ;'
    - '{ Get-Help "'
  selection_module:
    winlog.event_data.ParentCommandLine|contains: \WindowsPowerShell\Modules\Pester\
    winlog.event_data.ParentImage|endswith:
    - \powershell.exe
    - \pwsh.exe
falsepositives:
- Legitimate use of Pester for writing tests for Powershell scripts and modules
id: 18988e1b-9087-4f8a-82fe-0414dce49878
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://twitter.com/Oddvarmoe/status/993383596244258816
- https://twitter.com/_st0pp3r_/status/1560072680887525378
related:
- id: 59e938ff-0d6d-4dc3-b13f-36cc28734d4e
  type: similar
status: experimental
tags:
- attack.execution
- attack.t1059.001
- attack.defense_evasion
- attack.t1216
title: Execute Code with Pester.bat as Parent
