author: Nasreddine Bencherchali, Tim Shelton
category: process_creation
date: 2022/08/08
description: Detects execution of "reg.exe" commands with the "delete" flag on safe
  boot registry keys. Often used by attacker to prevent safeboot execution of security
  products
detection:
  condition: all of selection*
  selection_delete:
    winlog.event_data.CommandLine|contains|all:
    - ' delete '
    - \SYSTEM\CurrentControlSet\Control\SafeBoot
  selection_img:
  - winlog.event_data.Image|endswith: reg.exe
  - winlog.event_data.OriginalFileName: reg.exe
falsepositives:
- Unlikely
id: fc0e89b5-adb0-43c1-b749-c12a10ec37de
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/08/12
product: windows
references:
- https://www.trendmicro.com/en_us/research/22/e/avoslocker-ransomware-variant-abuses-driver-file-to-disable-anti-Virus-scans-log4shell.html
related:
- id: d7662ff6-9e97-4596-a61d-9839e32dee8d
  type: similar
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001
title: Delete SafeBoot Keys Via Reg Utility
