author: Vadim Khrykov (ThreatIntel), Cyb3rEng (Rule)
category: process_creation
date: 2021/08/23
description: Excel called wmic to finally proxy execute regsvr32 with the payload.
  An attacker wanted to break suspicious parent-child chain (Office app spawns LOLBin).But
  we have command-line in the event which allow us to "restore" this suspicious parent-child
  chain and detect it. Monitor process creation with "wmic process call create" and
  LOLBins in command-line with parent Office application processes.
detection:
  condition: selection1 and selection2 and selection3 and selection4
  selection1:
  - winlog.event_data.Image|endswith: \wbem\WMIC.exe
  - winlog.event_data.ProcessCommandLine|contains: 'wmic '
  - winlog.event_data.OriginalFileName: wmic.exe
  - winlog.event_data.Description: WMI Commandline Utility
  selection2:
    winlog.event_data.CommandLine|contains:
    - regsvr32
    - rundll32
    - msiexec
    - mshta
    - verclsid
  selection3:
    winlog.event_data.ParentImage|endswith:
    - winword.exe
    - excel.exe
    - powerpnt.exe
  selection4:
    processCommandLine|contains|all:
    - process
    - create
    - call
falsepositives:
- Unknown
id: 9d1c72f5-43f0-4da5-9320-648cf2099dd0
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware/
- https://github.com/vadim-hunter/Detection-Ideas-Rules/blob/main/Threat%20Intelligence/The%20DFIR%20Report/20210329_Sodinokibi_(aka_REvil)_Ransomware.yaml
status: experimental
tags:
- attack.t1204.002
- attack.t1047
- attack.t1218.010
- attack.execution
- attack.defense_evasion
title: Excel Proxy Executing Regsvr32 With Payload
