author: Florian Roth
category: process_creation
date: 2022/05/20
description: 'An adversary may use legitimate desktop support and remote access software,
  such as Team Viewer, Go2Assist, LogMein, AmmyyAdmin, etc, to establish an interactive
  command and control channel to target systems within networks.

  These services are commonly used as legitimate technical support software, and may
  be allowed by application control within a target environment.

  Remote access tools like VNC, Ammyy, and Teamviewer are used frequently when compared
  with other legitimate software commonly used by adversaries. (Citation: Symantec
  Living off the Land)

  '
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.Image|contains:
    - \AppData\
    - Program Files (x86)\AnyDesk
    - Program Files\AnyDesk
  selection:
  - winlog.event_data.Image|endswith: \AnyDesk.exe
  - winlog.event_data.Description: AnyDesk
  - winlog.event_data.Product: AnyDesk
  - winlog.event_data.Company: AnyDesk Software GmbH
falsepositives:
- Legitimate use of AnyDesk from a non-standard folder
id: 065b00ca-5d5c-4557-ac95-64a6d0b64d86
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/08/13
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1219/T1219.md#atomic-test-2---anydesk-files-detected-test-on-windows
status: experimental
tags:
- attack.command_and_control
- attack.t1219
title: Use of Anydesk Remote Access Software from Suspicious Folder
