author: frack113
category: process_creation
date: 2022/08/19
description: Detects when an adversary uses the 'AppDataLow' subkeys as a place to
  store data as seen in the URSNIF phishing campaign
detection:
  condition: all of selection_*
  selection_path:
    winlog.event_data.CommandLine|contains:
    - \Software\AppDataLow\Software\Microsoft\
    - \Software\Policies\Microsoft\Windows\OOBE
    - \Software\Policies\Microsoft\Windows NT\CurrentVersion\Winlogon
  selection_reg:
  - winlog.event_data.Image|endswith: \reg.exe
  - winlog.event_data.OriginalFileName: reg.exe
falsepositives:
- Legitimate use
id: b7e2a8d4-74bb-4b78-adc9-3f92af2d4829
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/08/20
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1112/T1112.md
- https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1562.001/T1562.001.md
status: experimental
tags:
- attack.defense_evasion
- attack.t1112
- attack.t1562.001
title: Reg Add Suspicious Path To AppDataLow
