author: Nasreddine Bencherchali
category: process_creation
date: 2022/08/25
description: Detects suspicious execution of Regasm/Regsvcs utilities
detection:
  condition: all of selection_* or (selection_img and not filter_dll)
  filter_dll:
    winlog.event_data.CommandLine|contains: .dll
  selection_dir:
    winlog.event_data.CommandLine|contains:
    - \Users\Public\
    - \AppData\Local\Temp\
    - \Desktop\
    - \Downloads\
    - \PerfLogs\
    - \Windows\Temp\
    - \Microsoft\Windows\Start Menu\Programs\Startup\
  selection_img:
  - winlog.event_data.Image|endswith:
    - \Regsvcs.exe
    - \Regasm.exe
  - winlog.event_data.OriginalFileName:
    - RegSvcs.exe
    - RegAsm.exe
falsepositives:
- Unknown
id: cc368ed0-2411-45dc-a222-510ace303cb2
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://www.fortiguard.com/threat-signal-report/4718?s=09
- https://lolbas-project.github.io/lolbas/Binaries/Regasm/
- https://lolbas-project.github.io/lolbas/Binaries/Regsvcs/
status: experimental
tags:
- attack.defense_evasion
- attack.t1218.009
title: Regasm/Regsvcs Suspicious Execution
