author: Austin Songer (@austinsonger)
category: process_creation
date: 2021/10/21
description: Detects the use of stordiag.exe to execute schtasks.exe systeminfo.exe
  and fltmc.exe
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.ParentImage|startswith:
    - c:\windows\system32\
    - c:\windows\syswow64\
  selection:
    winlog.event_data.Image|endswith:
    - \schtasks.exe
    - \systeminfo.exe
    - \fltmc.exe
    winlog.event_data.ParentImage|endswith: \stordiag.exe
falsepositives:
- Legitimate usage of stordiag.exe.
id: 961e0abb-1b1e-4c84-a453-aafe56ad0d34
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://strontic.github.io/xcyclopedia/library/stordiag.exe-1F08FC87C373673944F6A7E8B18CD845.html
- https://twitter.com/eral4m/status/1451112385041911809
status: experimental
tags:
- attack.defense_evasion
- attack.t1218
title: Execution via stordiag.exe
