author: A. Sungurov , oscd.community
category: process_creation
date: 2020/10/12
description: Detect indirect command execution via Program Compatibility Assistant
  pcwrun.exe
detection:
  condition: selection
  selection:
    winlog.event_data.ParentImage|endswith: \pcwrun.exe
falsepositives:
- Need to use extra processing with 'unique_count' / 'filter' to focus on outliers
  as opposed to commonly seen artifacts
- Legit usage of scripts
fields:
- winlog.ComputerName
- winlog.event_data.User
- winlog.event_data.ParentCommandLine
- winlog.event_data.CommandLine
id: b97cd4b1-30b8-4a9d-bd72-6293928d52bc
level: low
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
product: windows
references:
- https://twitter.com/pabraeken/status/991335019833708544
- https://lolbas-project.github.io/lolbas/Binaries/Pcwrun/
status: test
tags:
- attack.defense_evasion
- attack.t1218
- attack.execution
title: Indirect Command Execution By Program Compatibility Wizard
