author: Nasreddine Bencherchali
category: process_creation
date: 2022/08/19
description: Detects the use of a Microsoft signed script 'REGISTER_APP.VBS' to register
  a VSS/VDS Provider as a COM+ application.
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains|all:
    - \register_app.vbs
    - -register
falsepositives:
- Legitimate usage of the script. Always investigate what's being registered to confirm
  if it's benign
id: 1c8774a0-44d4-4db0-91f8-e792359c70bd
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://twitter.com/sblmsrsn/status/1456613494783160325?s=20
status: experimental
tags:
- attack.defense_evasion
- attack.t1218
title: REGISTER_APP.VBS Proxy Execution
