author: Christopher Peacock '@securepeacock', SCYTHE '@scythe_io'
category: process_creation
date: 2022/01/25
description: Detects rundll32.exe executing from an abnormal drive such as a mounted
  ISO.
detection:
  condition: selection and not 1 of filter*
  filter:
  - winlog.event_data.CurrentDirectory|contains: C:\
  - winlog.event_data.CurrentDirectory: ''
  filter_null:
    winlog.event_data.CurrentDirectory: null
  selection:
    winlog.event_data.Image|endswith: \rundll32.exe
falsepositives:
- Rare false positives could occur on servers with multiple drives.
id: d4ca7c59-e9e4-42d8-bf57-91a776efcb87
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/02/14
product: windows
references:
- https://thedfirreport.com/2021/12/13/diavol-ransomware/
status: experimental
tags:
- attack.t1218.001
title: Rundll32 From Abnormal Drive
