author: Florian Roth
category: process_creation
date: 2022/02/08
description: Detects a suspicious script executions in temporary folders or folders
  accessible by environment variables
detection:
  condition: 1 of selection* and folders
  folders:
    winlog.event_data.Image|contains:
    - \Windows\Temp
    - \Temporary Internet
    - \AppData\Local\Temp
    - \AppData\Roaming\Temp
    - C:\Users\Public\
    - C:\Perflogs\
  selection_flags:
    winlog.event_data.CommandLine|contains:
    - ' -w hidden '
    - ' -ep bypass '
    - '/e:vbscript '
    - '/e:javascript '
  selection_image:
    winlog.event_data.Image|endswith:
    - \powershell.exe
    - \pwsh.exe
    - \mshta.exe
    - \wscript.exe
    - \cscript.exe
    - \cmd.exe
  selection_original:
    winlog.event_data.OriginalFileName:
    - powershell.exe
    - pwsh.dll
    - mshta.exe
    - wscript.exe
    - cscript.exe
    - cmd.exe
falsepositives:
- Unknown
id: 1228c958-e64e-4e71-92ad-7d429f4138ba
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://www.virustotal.com/gui/file/91ba814a86ddedc7a9d546e26f912c541205b47a853d227756ab1334ade92c3f
status: experimental
tags:
- attack.execution
- attack.t1059
title: Script Interpreter Execution From Suspicious Folder
