author: '@ROxPinTeddy'
category: process_creation
date: 2020/05/12
description: Detects the use of Advanced IP Scanner. Seems to be a popular tool for
  ransomware groups.
detection:
  condition: selection
  selection:
    winlog.event_data.Image|contains: \advanced_ip_scanner
falsepositives:
- Legitimate administrative use
id: bef37fa2-f205-4a7b-b484-0759bfd5f86f
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2021/09/12
product: windows
references:
- https://news.sophos.com/en-us/2019/12/09/snatch-ransomware-reboots-pcs-into-safe-mode-to-bypass-protection/
- https://www.fireeye.com/blog/threat-research/2020/05/tactics-techniques-procedures-associated-with-maze-ransomware-incidents.html
- https://labs.f-secure.com/blog/prelude-to-ransomware-systembc
- https://assets.documentcloud.org/documents/20444693/fbi-pin-egregor-ransomware-bc-01062021.pdf
- https://thedfirreport.com/2021/01/18/all-that-for-a-coinminer
status: experimental
tags:
- attack.discovery
- attack.t1046
title: Advanced IP Scanner
