author: Florian Roth, oscd.community
category: process_creation
date: 2019/01/29
description: Detects netsh commands that configure a port forwarding of port 3389
  used for RDP
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains|all:
    - i
    - ' p'
    - =3389
    - ' c'
    winlog.event_data.Image|endswith: \netsh.exe
falsepositives:
- Legitimate administration
id: 782d6f3e-4c5d-4b8c-92a3-1d05fed72e63
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/01/07
product: windows
references:
- https://www.fireeye.com/blog/threat-research/2019/01/bypassing-network-restrictions-through-rdp-tunneling.html
status: test
tags:
- attack.lateral_movement
- attack.defense_evasion
- attack.command_and_control
- attack.t1090
title: Netsh RDP Port Forwarding
