author: Nasreddine Bencherchali
category: process_creation
date: 2022/06/06
description: Execution of a renamed version of the Plink binary
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.Image|endswith: \plink.exe
  selection:
  - winlog.event_data.OriginalFileName: Plink
  - winlog.event_data.CommandLine|contains|all:
    - ' -l forward'
    - ' -P '
    - ' -R '
falsepositives:
- Unknown
id: 1c12727d-02bf-45ff-a9f3-d49806a3cf43
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/08/04
product: windows
references:
- https://thedfirreport.com/2022/06/06/will-the-real-msiexec-please-stand-up-exploit-leads-to-data-exfiltration/
- https://the.earth.li/~sgtatham/putty/0.58/htmldoc/Chapter7.html
status: experimental
tags:
- attack.defense_evasion
- attack.t1036
title: Execution Of Renamed Plink Binary
