author: Sami Ruohonen
category: process_creation
date: 2019/01/16
description: Detects usage of attrib.exe to hide files from users.
detection:
  condition: selection and not (ini or intel)
  ini:
    winlog.event_data.CommandLine|contains: '\desktop.ini '
  intel:
    winlog.event_data.CommandLine: +R +H +S +A \\*.cui
    winlog.event_data.ParentCommandLine: C:\WINDOWS\system32\\*.bat
    winlog.event_data.ParentImage|endswith: \cmd.exe
  selection:
    winlog.event_data.CommandLine|contains: ' +h '
    winlog.event_data.Image|endswith: \attrib.exe
falsepositives:
- IgfxCUIService.exe hiding *.cui files via .bat script (attrib.exe a child of cmd.exe
  and igfxCUIService.exe is the parent of the cmd.exe)
- Msiexec.exe hiding desktop.ini
fields:
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
- winlog.event_data.User
id: 4281cb20-2994-4580-aa63-c8b86d019934
level: low
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
product: windows
status: test
tags:
- attack.defense_evasion
- attack.t1564.001
title: Hiding Files with Attrib.exe
