author: Christopher Peacock @SecurePeacock, SCYTHE @scythe_io
category: process_creation
date: 2022/06/02
description: The FSharp Interpreters, FsiAnyCpu.exe and FSi.exe, can be used for AWL
  bypass and is listed in Microsoft recommended block rules.
detection:
  condition: selection
  selection:
  - winlog.event_data.Image|endswith: \fsianycpu.exe
  - winlog.event_data.OriginalFileName: fsianycpu.exe
  - winlog.event_data.Image|endswith: \fsi.exe
  - winlog.event_data.OriginalFileName: fsi.exe
falsepositives:
- Legitimate use by a software developer.
id: b96b2031-7c17-4473-afe7-a30ce714db29
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://docs.microsoft.com/en-us/windows/security/threat-protection/windows-defender-application-control/microsoft-recommended-block-rules
- https://bohops.com/2020/11/02/exploring-the-wdac-microsoft-recommended-block-rules-part-ii-wfc-fsi/
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/FsiAnyCpu/
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Fsi/
status: experimental
tags:
- attack.execution
- attack.t1059
title: Use of FSharp Interpreters
