author: Florian Roth
category: process_creation
date: 2022/01/20
description: Detects the execution of AdvancedRun utility in the context of the TrustedInstaller,
  SYSTEM, Local Service or Network Service accounts
detection:
  condition: all of selection*
  selection:
    winlog.event_data.CommandLine|contains:
    - /EXEFilename
    - /CommandLine
  selection_runas:
  - winlog.event_data.CommandLine|contains:
    - ' /RunAs 8 '
    - ' /RunAs 4 '
    - ' /RunAs 10 '
    - ' /RunAs 11 '
  - winlog.event_data.CommandLine|endswith:
    - /RunAs 8
    - /RunAs 4
    - /RunAs 10
    - /RunAs 11
falsepositives:
- Unknown
id: fa00b701-44c6-4679-994d-5a18afa8a707
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/05/05
product: windows
references:
- https://twitter.com/splinter_code/status/1483815103279603714
- https://medium.com/s2wblog/analysis-of-destructive-malware-whispergate-targeting-ukraine-9d5d158f19f3
- https://elastic.github.io/security-research/malware/2022/01/01.operation-bleeding-bear/article/
- https://www.winhelponline.com/blog/run-program-as-system-localsystem-account-windows/
status: experimental
title: Suspicious AdvancedRun Runas Priv User
