author: Florian Roth, Nasreddine Bencherchali (updated)
category: process_creation
date: 2020/07/03
description: Detects a suspicious curl process start on Windows and outputs the requested
  document to a local file
detection:
  condition: selection_curl and 1 of selection_susp*
  selection_curl:
  - winlog.event_data.Image|endswith: \curl.exe
  - winlog.event_data.Product: The curl executable
  selection_susp_extensions:
    winlog.event_data.CommandLine|endswith:
    - .jpg
    - .jpeg
    - .png
    - .gif
    - .tmp
    - .temp
    - .txt
  selection_susp_locations:
    winlog.event_data.CommandLine|contains:
    - \AppData\
    - \Users\Public\
    - \Temp\
    - '%AppData%'
    - '%Temp%'
    - '%Public%'
    - \Desktop\
  selection_susp_remote_name_or_output:
    winlog.event_data.CommandLine|contains:
    - ' -O'
    - --remote-name
    - --output
falsepositives:
- Unknown
fields:
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: e218595b-bbe7-4ee5-8a96-f32a24ad3468
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/07/28
product: windows
references:
- https://twitter.com/max_mal_/status/1542461200797163522
- https://web.archive.org/web/20200128160046/https://twitter.com/reegun21/status/1222093798009790464
- https://github.com/pr0xylife/Qakbot/blob/4f0795d79dabee5bc9dd69f17a626b48852e7869/Qakbot_AA_23.06.2022.txt
- https://www.volexity.com/blog/2022/07/28/sharptongue-deploys-clever-mail-stealing-browser-extension-sharpext/
status: experimental
tags:
- attack.command_and_control
- attack.t1105
title: Suspicious Curl Usage on Windows
