author: Florian Roth
category: process_creation
date: 2021/12/06
description: Detects suspicious command line in which a user gets added to the local
  Remote Desktop Users group
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains|all:
    - 'net '
    - localgroup
    - Remote Desktop Users
    - /add
falsepositives:
- Administrative activity
fields:
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: ffa28e60-bdb1-46e0-9f82-05f7a61cc06e
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://www.microsoft.com/security/blog/2021/11/16/evolving-trends-in-iranian-threat-actor-activity-mstic-presentation-at-cyberwarcon-2021/
status: experimental
tags:
- attack.persistence
- attack.t1133
- attack.t1136.001
- attack.lateral_movement
- attack.t1021.001
title: Suspicious Add User to Remote Desktop Users Group
