author: Florian Roth
category: process_creation
date: 2022/01/06
description: Detects the use of the filename DumpStack.log to evade Microsoft Defender
detection:
  condition: 1 of selection*
  selection:
    winlog.event_data.Image|endswith: \DumpStack.log
  selection_download:
    winlog.event_data.CommandLine|contains: ' -o DumpStack.log'
falsepositives:
- Unknown
id: 4f647cfa-b598-4e12-ad69-c68dd16caef8
level: critical
logsource:
  category: process_creation
  product: windows
modified: 2022/06/17
product: windows
references:
- https://twitter.com/mrd0x/status/1479094189048713219
status: test
tags:
- attack.defense_evasion
title: DumpStack.log Defender Evasion
