author: Elastic (idea), Tobias Michalski
category: process_creation
date: 2022/05/04
description: Detects a privilege elevation attempt by coercing NTLM authentication
  on the Printer Spooler service
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains:
    - spoolss
    - srvsvc
    - /print/pipe/
    winlog.event_data.CommandLine|contains|all:
    - C:\windows\system32\davclnt.dll,DavSetCookie
    - http
    winlog.event_data.Image|endswith: \rundll32.exe
falsepositives:
- Unknown
id: bb76d96b-821c-47cf-944b-7ce377864492
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://twitter.com/med0x2e/status/1520402518685200384
- https://github.com/elastic/detection-rules/blob/dd224fb3f81d0b4bf8593c5f02a029d647ba2b2d/rules/windows/credential_access_relay_ntlm_auth_via_http_spoolss.toml
status: experimental
tags:
- attack.privilege_escalation
- attack.credential_access
- attack.t1212
title: Suspicious WebDav Client Execution
