author: Markus Neis
category: process_creation
date: 2017/11/07
description: Detects automated lateral movement by Turla group
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine:
    - net use \\%DomainController%\C$ "P@ssw0rd" *
    - dir c:\\*.doc* /s
    - dir %TEMP%\\*.exe
falsepositives:
- Unknown
id: c601f20d-570a-4cde-a7d6-e17f99cb8e7f
level: critical
logsource:
  category: process_creation
  product: windows
modified: 2021/09/19
product: windows
references:
- https://securelist.com/the-epic-turla-operation/65545/
status: experimental
tags:
- attack.g0010
- attack.execution
- attack.t1059
- attack.lateral_movement
- attack.t1021.002
- attack.discovery
- attack.t1083
- attack.t1135
title: Turla Group Lateral Movement
