author: oscd.community, @redcanary, Zach Stanford @svch0st
category: process_creation
date: 2020/10/08
description: Detects when when a mounted share is removed. Adversaries may remove
  share connections that are no longer useful in order to clean up traces of their
  operation
detection:
  condition: all of selection*
  selection_cli:
    winlog.event_data.CommandLine|contains|all:
    - share
    - /delete
  selection_img:
  - winlog.event_data.Image|endswith:
    - \net.exe
    - \net1.exe
  - winlog.event_data.OriginalFileName:
    - net.exe
    - net1.exe
falsepositives:
- Administrators or Power users may remove their shares via cmd line
id: cb7c4a03-2871-43c0-9bbb-18bbdb079896
level: low
logsource:
  category: process_creation
  product: windows
modified: 2022/07/11
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1070.005/T1070.005.md
status: test
tags:
- attack.defense_evasion
- attack.t1070.005
title: Mounted Share Deleted
