author: Florian Roth
category: process_creation
date: 2022/01/04
description: Detects uses of the rdrleakdiag.exe LOLOBIN utility to dump process memory
detection:
  condition: selection1 or selection2
  selection1:
    winlog.event_data.CommandLine|contains: /fullmemdmp
    winlog.event_data.Image|endswith: \rdrleakdiag.exe
  selection2:
    winlog.event_data.CommandLine|contains|all:
    - /fullmemdmp
    - ' /o '
    - ' /p '
falsepositives:
- Unknown
id: 6355a919-2e97-4285-a673-74645566340d
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/05/10
product: windows
references:
- https://www.crowdstrike.com/blog/overwatch-exposes-aquatic-panda-in-possession-of-log-4-shell-exploit-tools/
status: experimental
tags:
- attack.defense_evasion
- attack.t1036
- attack.t1003.001
title: RdrLeakDiag Process Dump
