author: frack113
category: process_creation
date: 2021/12/04
description: Detects suspicious process related to rundll32 based on arguments
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains:
    - 'javascript:'
    - 'vbscript:'
    winlog.event_data.CommandLine|contains|all:
    - rundll32
    - mshtml,RunHTMLApplication
falsepositives:
- False positives depend on scripts and administrative tools used in the monitored
  environment
id: 73fcad2e-ff14-4c38-b11d-4172c8ac86c7
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/07/11
product: windows
references:
- https://gist.github.com/ryhanson/227229866af52e2d963cf941af135a52
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218.011/T1218.011.md
status: experimental
tags:
- attack.defense_evasion
- attack.t1218.011
title: Suspicious Rundll32 Script in CommandLine
