author: Victor Sergeev, oscd.community
category: process_creation
date: 2020/10/09
description: Detects renamed ftp.exe, ftp.exe script execution and child processes
  ran by ftp.exe
detection:
  cmd_with_script_modifier:
    winlog.event_data.CommandLine|contains: '-s:'
  condition: (ftp_path and cmd_with_script_modifier) or (ftp_metadata and cmd_with_script_modifier)
    or (ftp_metadata and not ftp_path) or parent_path
  ftp_metadata:
    winlog.event_data.OriginalFileName: ftp.exe
  ftp_path:
    winlog.event_data.Image|endswith: ftp.exe
  parent_path:
    winlog.event_data.ParentImage|endswith: ftp.exe
falsepositives:
- Unknown
fields:
- winlog.event_data.CommandLine
- winlog.event_data.ParentImage
id: 06b401f4-107c-4ff9-947f-9ec1e7649f1e
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/05/13
product: windows
references:
- https://lolbas-project.github.io/lolbas/Binaries/Ftp/
status: test
tags:
- attack.execution
- attack.t1059
- attack.defense_evasion
- attack.t1202
title: Suspicious ftp.exe
