author: pH-T
category: process_creation
date: 2022/09/01
description: Detects net use command combo which executes files from WebDAV server;
  seen in malicious LNK files
detection:
  condition: image and all of selection*
  image:
    winlog.event_data.Image|contains: \cmd.exe
  selection_base:
    winlog.event_data.CommandLine|contains|all:
    - ' net use http'
    - '& start /b '
    - \DavWWWRoot\
  selection_ext:
    winlog.event_data.CommandLine|contains:
    - '.exe '
    - '.dll '
    - '.bat '
    - '.vbs '
    - '.ps1 '
falsepositives:
- Unknown
id: f0507c0f-a3a2-40f5-acc6-7f543c334993
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://twitter.com/ShadowChasing1/status/1552595370961944576
- https://www.virustotal.com/gui/file/a63376ee1dba76361df73338928e528ca5b20171ea74c24581605366dcaa0104/behavior
status: experimental
tags:
- attack.execution
- attack.t1059.001
title: Suspicious Net Use Command Combo
