author: sam0x90
category: process_creation
date: 2021/08/06
description: Conti recommendation to its affiliates to use esentutl to access NTDS
  dumped file. Trickbot also uses this utilities to get MSEdge info via its module
  pwgrab.
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains|all:
    - esentutl
    - ' /p'
falsepositives:
- To be determined
fields:
- winlog.event_data.User
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
- winlog.event_data.CurrentDirectory
id: 7df1713a-1a5b-4a4b-a071-dc83b144a101
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://twitter.com/vxunderground/status/1423336151860002816
- https://attack.mitre.org/software/S0404/
- https://thedfirreport.com/2021/08/01/bazarcall-to-conti-ransomware-via-trickbot-and-cobalt-strike/
status: experimental
tags:
- attack.credential_access
- attack.t1003
- attack.t1003.003
title: Esentutl Gather Credentials
