author: Nasreddine Bencherchali
category: process_creation
date: 2022/06/20
description: Detects usage of wmic to start or stop a service
detection:
  condition: all of selection*
  selection_cli:
    winlog.event_data.CommandLine|contains:
    - stopservice
    - startservice
    winlog.event_data.CommandLine|contains|all:
    - ' service '
    - ' call '
  selection_img:
  - winlog.event_data.OriginalFileName: wmic.exe
  - winlog.event_data.Image|endswith: \WMIC.exe
falsepositives:
- Unknown
id: 0b7163dc-7eee-4960-af17-c0cd517f92da
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://sushant747.gitbooks.io/total-oscp-guide/content/privilege_escalation_windows.html
status: experimental
tags:
- attack.execution
- attack.t1047
title: WMIC Service Start/Stop
