author: frack113
category: process_creation
date: 2022/07/18
description: Detect use of icacls to deny access for everyone in Users folder sometimes
  used to hide malicious files
detection:
  condition: all of selection*
  selection_cmd:
    winlog.event_data.CommandLine|contains|all:
    - C:\Users\
    - /deny
    - '*S-1-1-0:'
  selection_icacls:
  - winlog.event_data.OriginalFileName: iCACLS.EXE
  - winlog.event_data.Image|endswith: \icacls.exe
falsepositives:
- Legitimate use
id: 4ae81040-fc1c-4249-bfa3-938d260214d9
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://app.any.run/tasks/1df999e6-1cb8-45e3-8b61-499d1b7d5a9b/
status: experimental
tags:
- attack.defense_evasion
- attack.t1564.001
title: Use Icacls to Hide File to Everyone
