author: Nasreddine Bencherchali
category: process_creation
date: 2022/06/20
description: Detects possible password spraying attempts using Dsacls
detection:
  condition: all of selection*
  selection_cli:
    winlog.event_data.CommandLine|contains|all:
    - '/user:'
    - '/passwd:'
  selection_img:
  - winlog.event_data.Image|endswith: \dsacls.exe
  - winlog.event_data.OriginalFileName: DSACLS.EXE
falsepositives:
- Legitimate use of dsacls to bind to an LDAP session
id: bac9fb54-2da7-44e9-988f-11e9a5edbc0c
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://www.ired.team/offensive-security-experiments/active-directory-kerberos-abuse/using-dsacls-to-check-ad-object-permissions#password-spraying-anyone
- https://ss64.com/nt/dsacls.html
- https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/cc771151(v=ws.11)
status: experimental
tags:
- attack.execution
- attack.t1218
title: Password Spraying Attempts Using Dsacls
