author: Florian Roth
category: process_creation
date: 2022/09/06
description: Detects the use of a renamed SysInternals Sdelete, which is something
  an administrator shouldn't do (the renaming)
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.Image|endswith:
    - \sdelete.exe
    - \sdelete64.exe
  selection:
    winlog.event_data.OriginalFileName: sdelete.exe
falsepositives:
- System administrator usage
fields:
- winlog.ComputerName
- winlog.event_data.User
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: c1d867fe-8d95-4487-aab4-e53f2d339f90
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://docs.microsoft.com/en-us/sysinternals/downloads/sdelete
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1485/T1485.md
status: experimental
tags:
- attack.impact
- attack.t1485
title: Renamed Sysinternals Sdelete Usage
