author: frack113
category: process_creation
date: 2021/11/26
description: Extexport.exe loads dll and is execute from other folder the original
  path
detection:
  condition: selection
  selection:
  - winlog.event_data.CommandLine|contains: Extexport.exe
  - winlog.event_data.Image|endswith: \Extexport.exe
  - winlog.event_data.OriginalFileName: extexport.exe
falsepositives:
- Unknown
id: fb0b815b-f5f6-4f50-970f-ffe21f253f7a
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/05/16
product: windows
references:
- https://lolbas-project.github.io/lolbas/Binaries/Extexport/
status: experimental
tags:
- attack.defense_evasion
- attack.t1218
title: Suspicious Extexport Execution
