author: Michael Haag, Florian Roth, Markus Neis, Elastic, FPT.EagleEye Team
category: process_creation
date: 2018/04/06
description: Detects a Windows command and scripting interpreter executable started
  from Microsoft Word, Excel, Powerpoint, Publisher and Visio
detection:
  condition: selection
  selection:
    winlog.event_data.Image|endswith:
    - \cmd.exe
    - \powershell.exe
    - \pwsh.exe
    - \wscript.exe
    - \cscript.exe
    - \sh.exe
    - \bash.exe
    - \scrcons.exe
    - \schtasks.exe
    - \regsvr32.exe
    - \hh.exe
    - \wmic.exe
    - \mshta.exe
    - \rundll32.exe
    - \msiexec.exe
    - \forfiles.exe
    - \scriptrunner.exe
    - \mftrace.exe
    - \AppVLP.exe
    - \svchost.exe
    - \msbuild.exe
    winlog.event_data.ParentImage|endswith:
    - \WINWORD.EXE
    - \EXCEL.EXE
    - \POWERPNT.exe
    - \MSPUB.exe
    - \VISIO.exe
    - \MSACCESS.EXE
    - \EQNEDT32.EXE
falsepositives:
- Unknown
fields:
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: 438025f9-5856-4663-83f7-52f878a70a50
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/07/14
product: windows
references:
- https://www.hybrid-analysis.com/sample/465aabe132ccb949e75b8ab9c5bda36d80cf2fd503d52b8bad54e295f28bbc21?environmentId=100
- https://mgreen27.github.io/posts/2018/04/02/DownloadCradle.html
status: test
tags:
- attack.execution
- attack.t1204.002
title: Microsoft Office Product Spawning Windows Shell
