author: frack113
category: process_creation
date: 2022/01/07
description: Adversaries may use Valid Accounts to log into a computer using the Remote
  Desktop Protocol (RDP). The adversary may then perform actions as the logged-on
  user.
detection:
  condition: all of selection_mstsc* or all of selection_cmdkey*
  selection_cmdkey_cli:
    winlog.event_data.CommandLine|contains|all:
    - ' /g'
    - ' /u'
    - ' /p'
  selection_cmdkey_img:
  - winlog.event_data.Image|endswith: \cmdkey.exe
  - winlog.event_data.OriginalFileName: cmdkey.exe
  selection_mstsc_cli:
    winlog.event_data.CommandLine|contains: ' /v:'
  selection_mstsc_img:
  - winlog.event_data.Image|endswith: \mstsc.exe
  - winlog.event_data.OriginalFileName: mstsc.exe
falsepositives:
- Unknown
id: 954f0af7-62dd-418f-b3df-a84bc2c7a774
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/06/12
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1021.001/T1021.001.md#t1021001---remote-desktop-protocol
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/mstsc
status: experimental
tags:
- attack.lateral_movement
- attack.t1021.001
title: Remote Desktop Protocol Use Mstsc
