author: frack113
category: process_creation
date: 2021/12/26
description: Payloads may be compressed, archived, or encrypted in order to avoid
  detection
detection:
  condition: selection
  selection:
    winlog.event_data.Image|contains: .zip\
falsepositives:
- Unknown
id: 1a70042a-6622-4a2b-8958-267625349abf
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1027/T1027.md#atomic-test-4---execution-from-compressed-file
status: experimental
tags:
- attack.impact
- attack.t1485
title: Run from a Zip File
