author: frack113
category: process_creation
date: 2022/01/09
description: Adversaries may  modify system firewalls in order to bypass controls
  limiting network usage
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains|all:
    - advfirewall
    - firewall
    - set
    - rule
    - group=
    - new
    - enable=Yes
    winlog.event_data.Image|endswith: \netsh.exe
falsepositives:
- Legitimate administration
id: 347906f3-e207-4d18-ae5b-a9403d6bcdef
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.004/T1562.004.md#atomic-test-3---allow-smb-and-rdp-on-microsoft-defender-firewall
- https://docs.microsoft.com/en-us/troubleshoot/windows-server/networking/netsh-advfirewall-firewall-control-firewall-behavior
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.004
title: Netsh Allow Group Policy on Microsoft Defender Firewall
