author: Florian Roth
category: process_creation
date: 2018/02/09
description: Detects suspicious msiexec process starts with web addresses as parameter
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains|all:
    - ' msiexec'
    - ://
falsepositives:
- False positives depend on scripts and administrative tools used in the monitored
  environment
id: f7b5f842-a6af-4da5-9e95-e32478f3cd2f
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/01/07
product: windows
references:
- https://blog.trendmicro.com/trendlabs-security-intelligence/attack-using-windows-installer-msiexec-exe-leads-lokibot/
status: test
tags:
- attack.defense_evasion
- attack.t1218.007
- attack.command_and_control
- attack.t1105
title: MsiExec Web Install
