author: frack113
category: process_creation
date: 2021/12/16
description: Discovery of an installed Sysinternals Sysmon service using driver altitude
  (even if the name is changed).
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains: ' 385201'
    winlog.event_data.Image|endswith: \findstr.exe
falsepositives:
- Unknown
id: 37db85d1-b089-490a-a59a-c7b6f984f480
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1518.001/T1518.001.md#atomic-test-5---security-software-discovery---sysmon-service
status: experimental
tags:
- attack.discovery
- attack.t1518.001
title: Suspicious Findstr 385201 Execution
