author: frack113
category: process_creation
date: 2022/01/23
description: Uses the .NET InstallUtil.exe application in order to execute image without
  log
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains|all:
    - '/logfile= '
    - /LogToConsole=false
    winlog.event_data.Image|contains: Microsoft.NET\Framework
    winlog.event_data.Image|endswith: \InstallUtil.exe
falsepositives:
- Unknown
id: d042284c-a296-4988-9be5-f424fadcc28c
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/02/04
product: windows
references:
- https://securelist.com/moonbounce-the-dark-side-of-uefi-firmware/105468/
- https://docs.microsoft.com/en-us/dotnet/framework/tools/installutil-exe-installer-tool
status: experimental
tags:
- attack.defense_evasion
title: Suspicious Execution of InstallUtil Without Log
