author: Florian Roth
category: process_creation
date: 2018/03/17
description: Detects a tscon.exe start as LOCAL SYSTEM
detection:
  condition: selection
  selection:
    winlog.event_data.Image|endswith: \tscon.exe
    winlog.event_data.User|contains:
    - AUTHORI
    - AUTORI
falsepositives:
- Unknown
id: 9847f263-4a81-424f-970c-875dab15b79b
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/05/27
product: windows
references:
- http://www.korznikov.com/2017/03/0-day-or-feature-privilege-escalation.html
- https://medium.com/@networksecurity/rdp-hijacking-how-to-hijack-rds-and-remoteapp-sessions-transparently-to-move-through-an-da2a1e73a5f6
- https://www.ired.team/offensive-security/lateral-movement/t1076-rdp-hijacking-for-lateral-movement
status: experimental
tags:
- attack.command_and_control
- attack.t1219
title: Suspicious TSCON Start as SYSTEM
