author: Nasreddine Bencherchali
category: process_creation
date: 2022/06/10
description: Detects execution of the Notepad++ updater (gup) from a process other
  than Notepad++ to download files.
detection:
  condition: all of selection* and not filter
  filter:
    winlog.event_data.ParentImage|endswith: \notepad++.exe
  selection_cli:
    winlog.event_data.CommandLine|contains|all:
    - ' -unzipTo '
    - http
  selection_img:
  - winlog.event_data.Image|endswith: \GUP.exe
  - winlog.event_data.OriginalFileName: gup.exe
falsepositives:
- Other parent processes other than notepad++ using GUP that are not currently identified
id: 44143844-0631-49ab-97a0-96387d6b2d7c
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://twitter.com/nas_bench/status/1535322182863179776
status: experimental
tags:
- attack.command_and_control
- attack.t1105
title: Download Files Using Notepad++ GUP Utility
