author: Nasreddine Bencherchali
category: process_creation
date: 2022/09/02
description: Detects execution of "reg.exe" commands with the "add" or "copy" flags
  on safe boot registry keys. Often used by attacker to allow the ransomware to work
  in safe mode as some security products do not
detection:
  condition: all of selection*
  selection_flag:
    winlog.event_data.CommandLine|contains:
    - ' copy '
    - ' add '
  selection_img:
  - winlog.event_data.Image|endswith: reg.exe
  - winlog.event_data.OriginalFileName: reg.exe
  selection_safeboot:
    winlog.event_data.CommandLine|contains: \SYSTEM\CurrentControlSet\Control\SafeBoot
falsepositives:
- Unlikely
id: d7662ff6-9e97-4596-a61d-9839e32dee8d
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://redacted.com/blog/bianlian-ransomware-gang-gives-it-a-go/
related:
- id: fc0e89b5-adb0-43c1-b749-c12a10ec37de
  type: similar
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001
title: Add SafeBoot Keys Via Reg Utility
