author: Christian Burkard
category: process_creation
date: 2021/08/31
description: Detects tools such as UACMe used to bypass UAC with computerdefaults.exe
  (UACMe 59)
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.ParentImage|contains:
    - :\Windows\System32
    - :\Program Files
  selection:
    winlog.event_data.Image: C:\Windows\System32\ComputerDefaults.exe
    winlog.event_data.IntegrityLevel:
    - High
    - System
falsepositives:
- Unknown
id: 3c05e90d-7eba-4324-9972-5d7f711a60a8
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://github.com/hfiref0x/UACME
status: experimental
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1548.002
title: UAC Bypass Tools Using ComputerDefaults
