author: frack113
category: process_creation
date: 2022/04/17
description: 7-Zip through 21.07 on Windows allows privilege escalation (CVE-2022-29072)
  and command execution when a file with the .7z extension is dragged to the Help>Contents
  area. This is caused by misconfiguration of 7z.dll and a heap overflow. The command
  runs in a child process under the 7zFM.exe process.
detection:
  condition: selection and not 1 of filter_*
  filter_bat:
    winlog.event_data.CommandLine|contains: ' /c '
  filter_null:
    winlog.event_data.CommandLine: null
  selection:
    winlog.event_data.Image|endswith: \cmd.exe
    winlog.event_data.ParentImage|endswith: \7zFM.exe
falsepositives:
- Unknown
id: 9a4ccd1a-3526-4d99-b980-9f9c5d3a6ee3
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/04/19
product: windows
references:
- https://github.com/kagancapar/CVE-2022-29072
- https://twitter.com/kagancapar/status/1515219358234161153
status: experimental
tags:
- cve.2022.29072
title: Suspicious 7zip Subprocess
