author: Florian Roth
category: process_creation
date: 2022/03/24
description: Detects suspicious ways to download files or content and execute them
  using PowerShell
detection:
  condition: selection and execution
  execution:
    winlog.event_data.CommandLine|contains:
    - IEX(
    - IEX (
    - I`EX
    - IE`X
    - I`E`X
    - '| IEX'
    - '|IEX '
    - Invoke-Execution
    - ;iex $
  selection:
    winlog.event_data.CommandLine|contains:
    - .DownloadString(
    - .DownloadFile(
    - 'Invoke-WebRequest '
falsepositives:
- Scripts or tools that download files and execute them
id: 85b0b087-eddf-4a2b-b033-d771fa2b9775
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/09/02
product: windows
references:
- https://github.com/VirtualAlllocEx/Payload-Download-Cradles/blob/88e8eca34464a547c90d9140d70e9866dcbc6a12/Download-Cradles.cmd
status: experimental
tags:
- attack.execution
- attack.t1059
title: PowerShell Web Download and Execution
