author: frack113
category: process_creation
date: 2021/12/12
description: 'Adversaries may attempt to find local system groups and permission settings.

  The knowledge of local system permission groups can help adversaries determine which
  groups exist and which users belong to a particular group.

  Adversaries may use this information to determine which users have elevated permissions,
  such as the users found within the local administrators group.

  '
detection:
  condition: all of selection*
  selection_cli:
    winlog.event_data.CommandLine|contains: ' group'
  selection_img:
  - winlog.event_data.Image|endswith: \wmic.exe
  - winlog.event_data.OriginalFileName: wmic.exe
falsepositives:
- Unknown
id: 164eda96-11b2-430b-85ff-6a265c15bf32
level: low
logsource:
  category: process_creation
  product: windows
modified: 2022/05/13
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1069.001/T1069.001.md
status: experimental
tags:
- attack.discovery
- attack.t1069.001
title: Suspicious Get Local Groups Information with WMIC
