author: Trent Liffick (@tliffick), Bartlomiej Czyz (@bczyz1)
category: process_creation
date: 2020/06/03
description: Detects executables launched outside their default directories as used
  by Lazarus Group (Bluenoroff)
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.Image|startswith:
    - C:\Windows\System32\
    - C:\Windows\SysWOW64\
  selection:
    winlog.event_data.Image|endswith:
    - \msdtc.exe
    - \gpvc.exe
falsepositives:
- Unknown
id: 3f7f5b0b-5b16-476c-a85f-ab477f6dd24b
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
product: windows
references:
- https://media.kasperskycontenthub.com/wp-content/uploads/sites/43/2018/03/07180244/Lazarus_Under_The_Hood_PDF_final.pdf
status: test
tags:
- attack.defense_evasion
- attack.t1036.005
title: Lazarus Session Highjacker
