author: Victor Sergeev, oscd.community
category: process_creation
date: 2020/10/09
description: Detects execution of powershell scripts via Runscripthelper.exe
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains: surfacecheck
    winlog.event_data.Image|endswith: \Runscripthelper.exe
falsepositives:
- Unknown
fields:
- winlog.event_data.CommandLine
id: eca49c87-8a75-4f13-9c73-a5a29e845f03
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/07/11
product: windows
references:
- https://lolbas-project.github.io/lolbas/Binaries/Runscripthelper/
status: test
tags:
- attack.execution
- attack.t1059
- attack.defense_evasion
- attack.t1202
title: Suspicious Runscripthelper.exe
