author: oscd.community, Natalia Shornikova
category: process_creation
date: 2020/10/14
description: Detects Execution via SyncInvoke in CL_Invocation.ps1 module
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains|all:
    - CL_Invocation.ps1
    - SyncInvoke
falsepositives:
- Unknown
id: a0459f02-ac51-4c09-b511-b8c9203fc429
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/05/21
product: windows
references:
- https://lolbas-project.github.io/lolbas/Scripts/Cl_invocation/
- https://twitter.com/bohops/status/948061991012327424
status: experimental
tags:
- attack.defense_evasion
- attack.t1216
title: Execution via CL_Invocation.ps1
