author: Nasreddine Bencherchali
category: process_creation
date: 2022/06/21
description: Detects execution of msdt.exe using the "cab" flag which could indicates
  suspicious diagcab files with embedded answer files leveraging CVE-2022-30190
detection:
  condition: all of selection_*
  selection_cmd:
    winlog.event_data.CommandLine|contains:
    - ' /cab '
    - ' -cab '
  selection_img:
  - winlog.event_data.Image|endswith: \msdt.exe
  - winlog.event_data.OriginalFileName: msdt.exe
falsepositives:
- Legitimate usage of ".diagcab" files
id: dc4576d4-7467-424f-9eee-fd2b02855fe0
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://twitter.com/nas_bench/status/1537896324837781506
status: experimental
tags:
- attack.defense_evasion
- attack.t1202
title: MSDT.EXE Execution With Suspicious Cab Option
