author: Bhabesh Raj
category: process_creation
date: 2021/05/05
description: Detects the use of Pingback backdoor that creates ICMP tunnel for C2
  as described in the trustwave report
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains|all:
    - config
    - msdtc
    - start
    - auto
    winlog.event_data.ParentImage|endswith: updata.exe
falsepositives:
- Very unlikely
id: b2400ffb-7680-47c0-b08a-098a7de7e7a9
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/09/09
product: windows
references:
- https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/backdoor-at-the-end-of-the-icmp-tunnel
- https://app.any.run/tasks/4a54c651-b70b-4b72-84d7-f34d301d6406
status: experimental
tags:
- attack.persistence
- attack.t1574.001
title: Pingback Backdoor
