author: Florian Roth
category: process_creation
date: 2022/01/11
description: Detects the suspicious minimized start of MsEdge browser, which can be
  used to download files from the Internet
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains: start /min msedge
falsepositives:
- Software that uses MsEdge to download components in the background (see ParentImage,
  ParentCommandLine)
fields:
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: 94771a71-ba41-4b6e-a757-b531372eaab6
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://twitter.com/mrd0x/status/1478234484881436672?s=12
status: experimental
tags:
- attack.command_and_control
- attack.t1105
title: Suspicious Minimized MSEdge Start
