author: Beyu Denis, oscd.community
category: process_creation
date: 2019/10/26
description: Execute C# code located in the consoleapp folder
detection:
  condition: selection
  selection:
    winlog.event_data.Image|endswith: \dnx.exe
falsepositives:
- Legitimate use of dnx.exe by legitimate user
id: 81ebd28b-9607-4478-bf06-974ed9d53ed7
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
product: windows
references:
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Csi/
- https://enigma0x3.net/2016/11/17/bypassing-application-whitelisting-by-using-dnx-exe/
status: test
tags:
- attack.defense_evasion
- attack.t1218
- attack.t1027.004
title: Application Whitelisting Bypass via Dnx.exe
