author: Florian Roth, Tim Shelton
category: process_creation
date: 2018/04/06
description: Detects a suspicious child process of a Windows shell
detection:
  condition: selection and not 1 of falsepositives*
  falsepositives_1:
    winlog.event_data.CurrentDirectory|contains: \ccmcache\
  falsepositives_2:
    winlog.event_data.ParentCommandLine|contains:
    - \Program Files\Amazon\WorkSpacesConfig\Scripts\setup-scheduledtask.ps1
    - \Program Files\Amazon\WorkSpacesConfig\Scripts\set-selfhealing.ps1
    - \Program Files\Amazon\WorkSpacesConfig\Scripts\check-workspacehealth.ps1
    - \nessus_
  falsepositives_3:
    winlog.event_data.CommandLine|contains: \nessus_
  selection:
    winlog.event_data.Image|endswith:
    - \schtasks.exe
    - \nslookup.exe
    - \certutil.exe
    - \bitsadmin.exe
    - \mshta.exe
    winlog.event_data.ParentImage|endswith:
    - \mshta.exe
    - \powershell.exe
    - \pwsh.exe
    - \rundll32.exe
    - \cscript.exe
    - \wscript.exe
    - \wmiprvse.exe
    - \regsvr32.exe
falsepositives:
- Administrative scripts
- Microsoft SCCM
fields:
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
- winlog.event_data.CurrentDirectory
- winlog.event_data.Image
- winlog.event_data.ParentImage
id: 3a6586ad-127a-4d3b-a677-1e6eacdf8fde
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/07/27
product: windows
references:
- https://mgreen27.github.io/posts/2018/04/02/DownloadCradle.html
status: test
tags:
- attack.execution
- attack.defense_evasion
- attack.t1059.005
- attack.t1059.001
- attack.t1218
title: Windows Shell Spawning Suspicious Program
