author: frack113
category: process_creation
date: 2022/02/20
description: Detects the use of Tor or Tor-Browser to connect to onion routing networks
detection:
  condition: selection
  selection:
    winlog.event_data.Image|endswith:
    - \tor.exe
    - \Tor Browser\Browser\firefox.exe
falsepositives:
- Unknown
id: 62f7c9bf-9135-49b2-8aeb-1e54a6ecc13c
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://www.logpoint.com/en/blog/detecting-tor-use-with-logpoint/
status: experimental
tags:
- attack.command_and_control
- attack.t1090.003
title: Tor Client or Tor Browser Use
