author: FPT.EagleEye
category: process_creation
date: 2021/03/03
description: Detects adding and using Exchange PowerShell snap-ins to export mailbox
  data by HAFNIUM
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains: add-pssnapin microsoft.exchange.powershell.snapin
    winlog.event_data.Image|endswith:
    - \powershell.exe
    - \pwsh.exe
falsepositives:
- Unknown
fields:
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: 25676e10-2121-446e-80a4-71ff8506af47
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/07/14
product: windows
references:
- https://www.volexity.com/blog/2021/03/02/active-exploitation-of-microsoft-exchange-zero-day-vulnerabilities/
- https://www.microsoft.com/security/blog/2021/03/02/hafnium-targeting-exchange-servers/
status: experimental
tags:
- attack.execution
- attack.t1059.001
- attack.collection
- attack.t1114
title: Exchange PowerShell Snap-Ins Used by HAFNIUM
