author: Nasreddine Bencherchali
category: process_creation
date: 2022/08/31
description: Detects the presence of the keywords "Wscript", "Shell" and "Run" in
  the command, which could indicate a suspicious activity
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains|all:
    - Wscript.
    - .Shell
    - .Run
falsepositives:
- Rare legitimate inline scripting by some administrators
id: 2c28c248-7f50-417a-9186-a85b223010ee
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- http://blog.talosintelligence.com/2022/08/modernloader-delivers-multiple-stealers.html
status: experimental
tags:
- attack.execution
- attack.t1059
title: Wscript Shell Run In CommandLine
