author: frack113
category: process_creation
date: 2022/08/20
description: Detect use of TruffleSnout.exe
detection:
  condition: selection
  selection:
  - winlog.event_data.OriginalFileName: TruffleSnout.exe
  - winlog.event_data.Image|endswith: \TruffleSnout.exe
falsepositives:
- Legitimate use
id: 69ca006d-b9a9-47f5-80ff-ecd4d25d481a
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1482/T1482.md
- https://github.com/dsnezhkov/TruffleSnout
status: experimental
tags:
- attack.discovery
- attack.t1482
title: Launch TruffleSnout Executable
