author: Alexander McDonald
category: process_creation
date: 2022/06/24
description: Detects process injection using Microsoft Remote Asssistance (Msra.exe)
  which has been used for discovery and persistence tactics
detection:
  condition: selection
  selection:
    winlog.event_data.Image|endswith:
    - \arp.exe
    - \cmd.exe
    - \net.exe
    - \netstat.exe
    - \nslookup.exe
    - \route.exe
    - \schtasks.exe
    - \whoami.exe
    winlog.event_data.ParentCommandLine|endswith: msra.exe
    winlog.event_data.ParentImage|endswith: \msra.exe
falsepositives:
- Legitimate use of Msra.exe
id: 744a188b-0415-4792-896f-11ddb0588dbc
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://www.microsoft.com/security/blog/2021/12/09/a-closer-look-at-qakbots-latest-building-blocks-and-how-to-knock-them-down/
- https://www.fortinet.com/content/dam/fortinet/assets/analyst-reports/ar-qakbot.pdf
status: experimental
tags:
- attack.defense_evasion
- attack.t1055
title: Msra.exe Process Injection
