author: Nasreddine Bencherchali
category: process_creation
date: 2022/08/22
description: Detects when 'DllRegisterServer' is called in the commandline and the
  image is not rundll32. This could mean that the 'rundll32' utility has been renamed
  in order to avoid detection
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.Image|endswith: \rundll32.exe
  selection:
    winlog.event_data.CommandLine|contains: DllRegisterServer
falsepositives:
- Unlikely
id: 2569ed8c-1147-498a-9b8c-2ad3656b10ed
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://twitter.com/swisscom_csirt/status/1331634525722521602?s=20
- https://app.any.run/tasks/f74c5157-8508-4ac6-9805-d63fe7b0d399/
status: stable
tags:
- attack.execution
title: DllRegisterServer Call From Non Rundll32
