author: Nasreddine Bencherchali
category: process_creation
date: 2022/07/12
description: Detects encoded base64 MZ header in the commandline
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains:
    - TVqQAAMAAAAEAAAA
    - TVpQAAIAAAAEAA8A
    - TVqAAAEAAAAEABAA
    - TVoAAAAAAAAAAAAA
    - TVpTAQEAAAAEAAAA
falsepositives:
- Unlikely
id: 22e58743-4ac8-4a9f-bf19-00a0428d8c5f
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://thedfirreport.com/2022/07/11/select-xmrig-from-sqlserver/
status: experimental
tags:
- attack.execution
title: Base64 MZ Header In CommandLine
