author: '@gott_cyber'
category: process_creation
date: 2022/09/02
description: 'Detects the use of Ldifde.exe with specific command line arguments to
  potentially load an LDIF file containing HTTP-based arguments.

  Ldifde.exe is present, by default, on domain controllers and only requires user-level
  authentication to execute.

  '
detection:
  condition: all of selection_*
  selection_cmd:
    winlog.event_data.CommandLine|contains|all:
    - -i
    - -f
  selection_ldif:
  - winlog.event_data.Image|endswith: \ldifde.exe
  - winlog.event_data.OriginalFileName: ldifde.exe.mui
falsepositives:
- Unknown
id: 6f535e01-ca1f-40be-ab8d-45b19c0c8b7f
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://twitter.com/0gtweet/status/1564968845726580736
- https://strontic.github.io/xcyclopedia/library/ldifde.exe-979DE101F5059CEC1D2C56967CA2BAC0.html
- https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/cc731033(v=ws.11)
status: experimental
tags:
- attack.command_and_control
- attack.t1105
- attack.defense_evasion
- attack.t1218
title: Suspicious Ldifde Command Usage
