author: Florian Roth
category: process_creation
date: 2022/02/21
description: Detects Schtask creations that point to a suspicious folder or an environment
  variable often used by malware
detection:
  condition: ( all of selection1* or all of selection2* ) and not 1 of filter*
  filter_mixed:
  - winlog.event_data.CommandLine|contains: update_task.xml
  - winlog.event_data.ParentCommandLine|contains: unattended.ini
  selection1_all_folders:
    winlog.event_data.CommandLine|contains:
    - '%AppData%'
    - \AppData\Local\
    - \AppData\Roaming\
    - '%Public%'
    - \Users\Public
    - C:\Windows\Temp
    - C:\Perflogs
  selection1_create:
    winlog.event_data.CommandLine|contains: ' /create '
    winlog.event_data.Image|endswith: \schtasks.exe
  selection2_parent:
    winlog.event_data.ParentCommandLine|endswith: \svchost.exe -k netsvcs -p -s Schedule
  selection2_some_folders:
    winlog.event_data.CommandLine|contains:
    - '%Public%'
    - \Users\Public
    - C:\Windows\Temp
    - C:\Perflogs
falsepositives:
- Benign scheduled tasks creations or executions that happen often during software
  installations
- Software that uses the AppData folder and scheduled tasks to update the software
  in the AppData folders
id: 81325ce1-be01-4250-944f-b4789644556f
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/07/28
product: windows
references:
- https://www.welivesecurity.com/2022/01/18/donot-go-do-not-respawn/
- https://www.joesandbox.com/analysis/514608/0/html#324415FF7D8324231381BAD48A052F85DF04
status: experimental
tags:
- attack.execution
- attack.t1053.005
title: Suspicious Schtasks From Env Var Folder
