author: frack113
category: process_creation
date: 2021/07/12
description: Executes arbitrary PowerShell code using SyncAppvPublishingServer.exe.
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains: '"n; '
    winlog.event_data.Image|endswith: \SyncAppvPublishingServer.exe
falsepositives:
- App-V clients
fields:
- winlog.ComputerName
- winlog.event_data.User
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: fbd7c32d-db2a-4418-b92c-566eb8911133
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2021/09/12
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1218/T1218.md
- https://lolbas-project.github.io/lolbas/Binaries/Syncappvpublishingserver/
related:
- id: fde7929d-8beb-4a4c-b922-be9974671667
  type: obsoletes
status: experimental
tags:
- attack.defense_evasion
- attack.t1218
title: SyncAppvPublishingServer Execute Arbitrary PowerShell Code
