author: FPT.EagleEye Team
category: process_creation
date: 2020/10/17
description: Detects code execution via the Windows Update client (wuauclt)
detection:
  condition: all of selection* and not filter
  filter:
    winlog.event_data.CommandLine|contains:
    - ' /ClassId '
    - ' wuaueng.dll '
  selection_cli:
    winlog.event_data.CommandLine|contains|all:
    - /UpdateDeploymentProvider
    - /RunHandlerComServer
    - .dll
  selection_img:
  - winlog.event_data.Image|endswith: \wuauclt.exe
  - winlog.event_data.OriginalFileName: wuauclt.exe
falsepositives:
- Unknown
id: d7825193-b70a-48a4-b992-8b5b3015cc11
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/05/13
product: windows
references:
- https://dtm.uk/wuauclt/
status: experimental
tags:
- attack.command_and_control
- attack.execution
- attack.t1105
- attack.t1218
title: Windows Update Client LOLBIN
