author: Christopher Peacock @SecurePeacock, SCYTHE @scythe_io
category: process_creation
date: 2022/06/02
description: Remote.exe is part of WinDbg in the Windows SDK and can be used for AWL
  bypass and running remote files.
detection:
  condition: selection
  selection:
  - winlog.event_data.Image|endswith: \remote.exe
  - winlog.event_data.OriginalFileName: remote.exe
falsepositives:
- Approved installs of Windows SDK with Debugging Tools for Windows (WinDbg).
id: 4eddc365-79b4-43ff-a9d7-99422dc34b93
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://blog.thecybersecuritytutor.com/Exeuction-AWL-Bypass-Remote-exe-LOLBin/
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Remote/
status: experimental
tags:
- attack.defense_evasion
- attack.t1127
title: Use of Remote.exe
