author: Nasreddine Bencherchali
category: process_creation
date: 2022/09/05
description: Detects usage of the Quarks PwDump tool via commandline arguments
detection:
  condition: 1 of selection_*
  selection_cli:
    winlog.event_data.CommandLine:
    - ' -dhl'
    - ' --dump-hash-local'
    - ' -dhdc'
    - ' --dump-hash-domain-cached'
    - ' --dump-bitlocker'
    - ' -dhd '
    - ' --dump-hash-domain '
    - --ntds-file
  selection_img:
    winlog.event_data.Image|endswith: \QuarksPwDump.exe
falsepositives:
- Unlikely
id: 0685b176-c816-4837-8e7b-1216f346636b
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://github.com/quarkslab/quarkspwdump
- https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/seedworm-apt-iran-middle-east
status: experimental
tags:
- attack.credential_access
- attack.t1003.002
title: Quarks PwDump Usage
