author: Teymur Kheirkhabarov, Ecco, Florian Roth
category: process_creation
date: 2019/10/26
description: Detects the use of getsystem Meterpreter/Cobalt Strike command by detecting
  a specific service starting
detection:
  condition: selection_1 and selection_2 and not filter1
  filter1:
    winlog.event_data.CommandLine|contains: MpCmdRun
  selection_1:
    winlog.event_data.ParentImage|endswith: \services.exe
  selection_2:
  - winlog.event_data.CommandLine|contains|all:
    - cmd
    - /c
    - echo
    - \pipe\
  - winlog.event_data.CommandLine|contains|all:
    - '%COMSPEC%'
    - /c
    - echo
    - \pipe\
  - winlog.event_data.CommandLine|contains|all:
    - cmd.exe
    - /c
    - echo
    - \pipe\
  - winlog.event_data.CommandLine|contains|all:
    - rundll32
    - .dll,a
    - '/p:'
falsepositives:
- Commandlines containing components like cmd accidentally
- Jobs and services started with cmd
fields:
- winlog.ComputerName
- winlog.event_data.User
- winlog.event_data.CommandLine
id: 15619216-e993-4721-b590-4c520615a67d
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/05/20
product: windows
references:
- https://speakerdeck.com/heirhabarov/hunting-for-privilege-escalation-in-windows-environment
- https://blog.cobaltstrike.com/2014/04/02/what-happens-when-i-type-getsystem/
status: experimental
tags:
- attack.privilege_escalation
- attack.t1134.001
- attack.t1134.002
title: Meterpreter or Cobalt Strike Getsystem Service Start
