author: Christopher Peacock '@securepeacock', SCYTHE '@scythe_io'
category: process_creation
date: 2022/03/29
description: Attackers may leverage fsutil to enumerated connected drives.
detection:
  condition: all of selection_*
  selection_cli:
    winlog.event_data.CommandLine|contains: drives
  selection_img:
  - winlog.event_data.Image|endswith: \fsutil.exe
  - winlog.event_data.OriginalFileName: fsutil.exe
falsepositives:
- Certain software or administrative tasks may trigger false positives.
id: 63de06b9-a385-40b5-8b32-73f2b9ef84b6
level: low
logsource:
  category: process_creation
  product: windows
modified: 2022/07/14
product: windows
references:
- Turla has used fsutil fsinfo drives to list connected drives. https://attack.mitre.org/techniques/T1120/
- https://github.com/elastic/detection-rules/blob/414d32027632a49fb239abb8fbbb55d3fa8dd861/rules/windows/discovery_peripheral_device.toml
status: experimental
tags:
- attack.peripheral_device_discovery
- attack.t1120
title: Fsutil Drive Enumeration
