author: oscd.community, @redcanary, Zach Stanford @svch0st
category: process_creation
date: 2020/10/10
description: Adversaries may install a root certificate on a compromised system to
  avoid warnings when connecting to adversary controlled web servers.
detection:
  condition: selection1 or selection2
  selection1:
    winlog.event_data.CommandLine|contains|all:
    - -addstore
    - root
    winlog.event_data.Image|endswith: \certutil.exe
  selection2:
    winlog.event_data.CommandLine|contains|all:
    - /add
    - root
    winlog.event_data.Image|endswith: \CertMgr.exe
falsepositives:
- Help Desk or IT may need to manually add a corporate Root CA on occasion. Need to
  test if GPO push doesn't trigger FP
id: 46591fae-7a4c-46ea-aec3-dff5e6d785dc
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2021/09/21
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1553.004/T1553.004.md
related:
- id: 42821614-9264-4761-acfc-5772c3286f76
  type: derived
status: experimental
tags:
- attack.defense_evasion
- attack.t1553.004
title: Root Certificate Installed
