author: Florian Roth
category: process_creation
date: 2022/01/16
description: Detects a suspicious output redirection to the local admins share as
  often found in malicious scripts or hacktool stagers
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains:
    - '> \\\\127.0.0.1\\admin$'
    - '> \\\\localhost\\admin$'
falsepositives:
- Unknown
id: ab9e3b40-0c85-4ba1-aede-455d226fd124
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/02/01
product: windows
references:
- https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/
status: experimental
title: Suspicious Redirection to Local Admin Share
