author: Florian Roth
category: process_creation
date: 2022/02/07
description: Detects a set of suspicious network related commands often used in recon
  stages
detection:
  condition: 1 of selection*
  selection_nslookup:
    winlog.event_data.CommandLine|contains|all:
    - nslookup
    - _ldap._tcp.dc._msdcs.
falsepositives:
- False positives depend on scripts and administrative tools used in the monitored
  environment
id: e6313acd-208c-44fc-a0ff-db85d572e90e
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://thedfirreport.com/2022/02/07/qbot-likes-to-move-it-move-it/
status: experimental
tags:
- attack.discovery
- attack.t1087
- attack.t1082
- car.2016-03-001
title: Network Reconnaissance Activity
