author: Florian Roth
category: process_creation
date: 2021/02/01
description: Detects actions that clear the local ShimCache and remove forensic evidence
detection:
  condition: ( selection1a and selection1b ) or ( selection2a and selection2b )
  selection1a:
    winlog.event_data.CommandLine|contains|all:
    - rundll32
    - apphelp.dll
  selection1b:
    winlog.event_data.CommandLine|contains:
    - ShimFlushCache
    - '#250'
  selection2a:
    winlog.event_data.CommandLine|contains|all:
    - rundll32
    - kernel32.dll
  selection2b:
    winlog.event_data.CommandLine|contains:
    - BaseFlushAppcompatCache
    - '#46'
falsepositives:
- Unknown
fields:
- winlog.event_data.Image
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: b0524451-19af-4efa-a46f-562a977f792e
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://medium.com/@blueteamops/shimcache-flush-89daff28d15e
status: stable
tags:
- attack.defense_evasion
- attack.t1112
title: ShimCache Flush
