author: frack113
category: process_creation
date: 2022/01/16
description: 'Adversaries may abuse msiexec.exe to proxy execution of malicious payloads.

  Msiexec.exe is the command-line utility for the Windows Installer and is thus commonly
  associated with executing installation packages (.msi)

  '
detection:
  condition: selection and not 1 of filter_*
  filter_apple:
    winlog.event_data.CommandLine|contains:
    - \MsiExec.exe" /Y "C:\Program Files\Bonjour\mdnsNSP.dll
    - \MsiExec.exe" /Y "C:\Program Files (x86)\Bonjour\mdnsNSP.dll
    - \MsiExec.exe" /Y "C:\Program Files (x86)\Apple Software Update\ScriptingObjectModel.dll
    - \MsiExec.exe" /Y "C:\Program Files (x86)\Apple Software Update\SoftwareUpdateAdmin.dll
    - \MsiExec.exe" /Y "C:\Windows\CCM\
    - \MsiExec.exe" /Y C:\Windows\CCM\
  selection:
    winlog.event_data.CommandLine|contains: ' /y'
    winlog.event_data.Image|endswith: \msiexec.exe
falsepositives:
- Legitimate script
id: 6f4191bb-912b-48a8-9ce7-682769541e6d
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/03/28
product: windows
references:
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/msiexec
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218.007/T1218.007.md
status: experimental
tags:
- attack.defense_evasion
- attack.t1218.007
title: Suspicious Msiexec Execute Arbitrary DLL
