author: pH-T
category: process_creation
date: 2022/07/15
description: Detects scheduled task creation events that include suspicious actions,
  and is run once at 00:00
detection:
  bad_name:
    winlog.event_data.CommandLine|contains: Joke
  condition: image and selection_base and (selection_time or bad_name)
  image:
    winlog.event_data.Image|contains: \schtasks.exe
  selection_base:
    winlog.event_data.CommandLine|contains:
    - wscript
    - vbscript
    - cscript
    - 'wmic '
    - wmic.exe
    - regsvr32.exe
    - powershell
    - \AppData\
  selection_time:
    winlog.event_data.CommandLine|contains|all:
    - once
    - 00:00
falsepositives:
- Software installation
id: 970823b7-273b-460a-8afc-3a6811998529
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://www.trendmicro.com/vinfo/us/security/news/ransomware-spotlight/ransomware-spotlight-blackbyte
status: experimental
title: Uncommon Scheduled Task Once 00:00
