author: Beyu Denis, oscd.community
category: process_creation
date: 2020/10/18
description: dotnet.exe will execute any DLL and execute unsigned code
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|endswith:
    - .dll
    - .csproj
    winlog.event_data.Image|endswith: \dotnet.exe
falsepositives:
- System administrator Usage
fields:
- winlog.ComputerName
- winlog.event_data.User
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: d80d5c81-04ba-45b4-84e4-92eba40e0ad3
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
product: windows
references:
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Dotnet/
- https://twitter.com/_felamos/status/1204705548668555264
- https://bohops.com/2019/08/19/dotnet-core-a-vector-for-awl-bypass-defense-evasion/
status: test
tags:
- attack.execution
- attack.t1218
title: Dotnet.exe Exec Dll and Execute Unsigned Code LOLBIN
