author: Florian Roth
category: process_creation
date: 2022/06/28
description: Detects usage of bitsadmin downloading a file from a suspicious domain
detection:
  condition: all of selection*
  selection:
    winlog.event_data.CommandLine|contains:
    - ' /transfer '
    - ' /create '
    - ' /addfile '
    winlog.event_data.Image|endswith: \bitsadmin.exe
  selection_domain:
    winlog.event_data.CommandLine|contains:
    - raw.githubusercontent.com
    - gist.githubusercontent.com
    - pastebin.com
    - cdn.discordapp.com/attachments/
    - mediafire.com
    - mega.nz
    - ddns.net
    - .paste.ee
    - .hastebin.com
    - .ghostbin.co/
    - ufile.io
    - storage.googleapis.com
    - anonfiles.com
    - send.exploit.in
    - transfer.sh
falsepositives:
- Some legitimate apps use this, but limited.
fields:
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: 8518ed3d-f7c9-4601-a26c-f361a4256a0c
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/08/09
product: windows
references:
- https://blog.netspi.com/15-ways-to-download-a-file/#bitsadmin
- https://isc.sans.edu/diary/22264
- https://lolbas-project.github.io/lolbas/Binaries/Bitsadmin/
- https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/ransomware-hive-conti-avoslocker
status: experimental
tags:
- attack.defense_evasion
- attack.persistence
- attack.t1197
- attack.s0190
- attack.t1036.003
title: Bitsadmin Download from Suspicious Domain
