author: frack113
category: process_creation
date: 2021/07/30
description: Once established within a system or network, an adversary may use automated
  techniques for collecting internal data.
detection:
  condition: all of selection*
  selection_image:
  - winlog.event_data.Image|endswith:
    - \tree.com
    - \WMIC.exe
    - \doskey.exe
    - \sc.exe
  - winlog.event_data.OriginalFileName:
    - wmic.exe
    - DOSKEY.EXE
    - sc.exe
  selection_redirect:
    winlog.event_data.ParentCommandLine|contains: ' > %TEMP%\'
falsepositives:
- Unknown
id: aa2efee7-34dd-446e-8a37-40790a66efd7
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1119/T1119.md
status: experimental
tags:
- attack.collection
- attack.t1119
title: Recon Information for Export with Command Prompt
