author: Florian Roth
category: process_creation
date: 2022/02/25
description: This rule detects process execution patterns found in intrusions related
  to the Hermetic Wiper malware attacks against Ukraine in February 2022
detection:
  condition: 1 of selection*
  selection1:
    winlog.event_data.Image|endswith: \policydefinitions\postgresql.exe
  selection2:
  - winlog.event_data.CommandLine|contains:
    - CSIDL_SYSTEM_DRIVE\temp\sys.tmp
    - ' 1> \\\\127.0.0.1\ADMIN$\__16'
  - winlog.event_data.CommandLine|contains|all:
    - 'powershell -c '
    - '\comsvcs.dll MiniDump '
    - \winupd.log full
falsepositives:
- Unknown
id: 2f974656-6d83-4059-bbdf-68ac5403422f
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/08/13
product: windows
references:
- https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/ukraine-wiper-malware-russia
status: experimental
title: Hermetic Wiper TG Process Patterns
