author: Florian Roth
category: process_creation
date: 2019/08/23
description: Detects a base64 encoded IEX command string in a process command line
detection:
  condition: selection
  selection:
  - winlog.event_data.CommandLine|base64offset|contains:
    - IEX ([
    - iex ([
    - iex (New
    - IEX (New
  - winlog.event_data.CommandLine|contains:
    - SQBFAFgAIAAoAFsA
    - kARQBYACAAKABbA
    - JAEUAWAAgACgAWw
    - aQBlAHgAIAAoAFsA
    - kAZQB4ACAAKABbA
    - pAGUAeAAgACgAWw
    - aQBlAHgAIAAoAE4AZQB3A
    - kAZQB4ACAAKABOAGUAdw
    - pAGUAeAAgACgATgBlAHcA
    - SQBFAFgAIAAoAE4AZQB3A
    - kARQBYACAAKABOAGUAdw
    - JAEUAWAAgACgATgBlAHcA
falsepositives:
- Unknown
fields:
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: 88f680b8-070e-402c-ae11-d2914f2257f1
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/03/07
product: windows
status: test
tags:
- attack.execution
- attack.t1059.001
title: Encoded IEX
