author: Victor Sergeev, oscd.community
category: process_creation
date: 2020/10/09
description: Detects when GfxDownloadWrapper.exe downloads file from non standard
  URL
detection:
  condition: image_path and not filter
  filter:
    winlog.event_data.CommandLine|contains: gameplayapi.intel.com
    winlog.event_data.ParentImage|endswith: \GfxDownloadWrapper.exe
  image_path:
    winlog.event_data.Image|endswith: \GfxDownloadWrapper.exe
falsepositives:
- Unknown
fields:
- winlog.event_data.CommandLine
id: eee00933-a761-4cd0-be70-c42fe91731e7
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
product: windows
references:
- https://lolbas-project.github.io/lolbas/Binaries/GfxDownloadWrapper/
status: test
tags:
- attack.command_and_control
- attack.t1105
title: GfxDownloadWrapper.exe Downloads File from Suspicious URL
