author: frack113
category: process_creation
date: 2022/05/16
description: Detects the executiob of TTDInject.exe, which is used by Windows 10 v1809
  and newer to debug time travel (underlying call of tttracer.exe)
detection:
  condition: selection
  selection:
  - winlog.event_data.Image|endswith: ttdinject.exe
  - winlog.event_data.OriginalFileName: TTDInject.EXE
falsepositives:
- Legitimate use
id: b27077d6-23e6-45d2-81a0-e2b356eea5fd
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://lolbas-project.github.io/lolbas/Binaries/Ttdinject/
status: experimental
tags:
- attack.defense_evasion
- attack.t1127
title: Use of TTDInject.exe
