author: Florian Roth
category: process_creation
date: 2017/05/08
description: Detects the installation of a plugin DLL via ServerLevelPluginDll parameter
  in Registry, which can be used to execute code in context of the DNS server (restart
  required)
detection:
  condition: dnsadmin
  dnsadmin:
    winlog.event_data.CommandLine|contains|all:
    - /config
    - /serverlevelplugindll
    winlog.event_data.Image|endswith: \dnscmd.exe
falsepositives:
- unknown
fields:
- winlog.event_id
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
- winlog.event_data.Image
- winlog.event_data.User
- winlog.event_data.TargetObject
id: f63b56ee-3f79-4b8a-97fb-5c48007e8573
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/09/12
product: windows
references:
- https://medium.com/@esnesenon/feature-not-bug-dnsadmin-to-dc-compromise-in-one-line-a0f779b8dc83
related:
- id: e61e8a88-59a9-451c-874e-70fcc9740d67
  type: derived
status: experimental
tags:
- attack.defense_evasion
- attack.t1574.002
- attack.t1112
title: DNS ServerLevelPluginDll Install
