author: Sreeman
category: process_creation
date: 2021/06/11
description: Looks for changes to registry to disable any write-protect property for
  storage devices. This could be a precursor to a ransomware attack and has been an
  observed technique used by cypherpunk group.
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains:
    - storage
    - storagedevicepolicies
    winlog.event_data.CommandLine|contains|all:
    - reg add
    - \system\currentcontrolset\control
    - write protection
    - '0'
falsepositives:
- Unknown
id: 75f7a0e2-7154-4c4d-9eae-5cdb4e0a5c13
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/08/05
product: windows
status: experimental
tags:
- attack.defense_evasion
- attack.t1562
title: Write Protect For Storage Disabled
