author: Nasreddine Bencherchali
category: process_creation
date: 2022/07/14
description: Detects creation of a new service via "sc" command or the powershell
  "new-service" cmdlet with suspicious binary paths
detection:
  condition: 1 of selection* and susp_binpath
  selection_posh:
    winlog.event_data.CommandLine|contains|all:
    - New-Service
    - -BinaryPathName
  selection_sc:
    winlog.event_data.CommandLine|contains|all:
    - create
    - binPath=
    winlog.event_data.Image|endswith: \sc.exe
  susp_binpath:
    winlog.event_data.CommandLine|contains:
    - powershell
    - mshta
    - wscript
    - cscript
    - svchost
    - dllhost
    - 'cmd '
    - cmd.exe /c
    - rundll32
    - C:\Users\Public
    - \Downloads\
    - \Desktop\
    - \Microsoft\Windows\Start Menu\Programs\Startup\
    - C:\Windows\TEMP\
    - \AppData\Local\Temp
falsepositives:
- Unlikely
id: 17a1be64-8d88-40bf-b5ff-a4f7a50ebcc8
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/08/04
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1543.003/T1543.003.md
- https://web.archive.org/web/20180331144337/https://www.fireeye.com/blog/threat-research/2018/03/sanny-malware-delivery-method-updated-in-recently-observed-attacks.html
related:
- id: 7fe71fc9-de3b-432a-8d57-8c809efc10ab
  type: derived
status: experimental
tags:
- attack.persistence
- attack.privilege_escalation
- attack.t1543.003
title: Suspicious New Service Creation
