author: Nasreddine Bencherchali
category: process_creation
date: 2022/08/01
description: Detects execution of "reg.exe" commands with the "delete" flag on services
  registry key. Often used by attacker to remove AV software services
detection:
  condition: all of selection*
  selection_delete:
    winlog.event_data.CommandLine|contains: ' delete '
  selection_img:
  - winlog.event_data.Image|endswith: reg.exe
  - winlog.event_data.OriginalFileName: reg.exe
  selection_key:
    winlog.event_data.CommandLine|contains: \SYSTEM\CurrentControlSet\services\
falsepositives:
- Unlikely
id: 05b2aa93-1210-42c8-8d9a-2fcc13b284f5
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://www.virustotal.com/gui/file/2bcd5702a7565952c44075ac6fb946c7780526640d1264f692c7664c02c68465
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001
title: Delete Services Via Reg Utility
