author: Bhabesh Raj, Sittikorn S, Aaron Greetham (@beardofbinary) - NCC Group
category: process_creation
date: 2021/05/10
description: Detects execution of RClone utility for exfiltration as used by various
  ransomwares strains like REvil, Conti, FiveHands, etc
detection:
  command_selection:
    winlog.event_data.CommandLine|contains:
    - pass
    - user
    - copy
    - sync
    - config
    - lsd
    - remote
    - ls
    - mega
    - pcloud
    - ftp
    - ignore-existing
    - auto-confirm
    - transfers
    - multi-thread-streams
    - 'no-check-certificate '
  condition: detect_by_option or command_selection and ( description_selection or
    exec_selection )
  description_selection:
    winlog.event_data.Description: Rsync for cloud storage
  detect_by_option:
    winlog.event_data.CommandLine|contains|all:
    - '--config '
    - '--no-check-certificate '
    - ' copy '
  exec_selection:
    winlog.event_data.Image|endswith: \rclone.exe
    winlog.event_data.ParentImage|endswith:
    - \PowerShell.exe
    - \pwsh.exe
    - \cmd.exe
falsepositives:
- Legitimate RClone use
fields:
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
- winlog.event_data.Details
id: e37db05d-d1f9-49c8-b464-cee1a4b11638
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/07/14
product: windows
references:
- https://research.nccgroup.com/2021/05/27/detecting-rclone-an-effective-tool-for-exfiltration/
- https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware
- https://us-cert.cisa.gov/ncas/analysis-reports/ar21-126a
- https://labs.sentinelone.com/egregor-raas-continues-the-chaos-with-cobalt-strike-and-rclone
- https://www.splunk.com/en_us/blog/security/darkside-ransomware-splunk-threat-update-and-detections.html
related:
- id: a0d63692-a531-4912-ad39-4393325b2a9c
  type: obsoletes
- id: cb7286ba-f207-44ab-b9e6-760d82b84253
  type: obsoletes
status: experimental
tags:
- attack.exfiltration
- attack.t1567.002
title: Rclone Execution via Command Line or PowerShell
