author: Nasreddine Bencherchali
category: process_creation
date: 2022/06/09
description: The "Squirrel.exe" binary that is part of multiple software (Slack, Teams,
  Discord...etc) can be used as a LOLBIN
detection:
  condition: all of selection*
  selection_cli:
    winlog.event_data.CommandLine|contains:
    - ' --download '
    - ' --update '
    - ' --updateRollback='
  selection_http:
    winlog.event_data.CommandLine|contains: http
  selection_img:
    winlog.event_data.Image|endswith: \squirrel.exe
falsepositives:
- See rule (fa4b21c9-0057-4493-b289-2556416ae4d7) for possible FPs
id: 45239e6a-b035-4aaf-b339-8ad379fcb67e
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Squirrel/
related:
- id: fa4b21c9-0057-4493-b289-2556416ae4d7
  type: derived
status: experimental
tags:
- attack.defense_evasion
- attack.execution
title: Use of Squirrel.exe
