author: frack113
category: process_creation
date: 2022/08/20
description: Detect use of "/R <" to read and execute a file via cmd.exe
detection:
  condition: all of selection_*
  selection_cmd:
  - winlog.event_data.OriginalFileName: Cmd.Exe
  - winlog.event_data.Image|endswith: \cmd.exe
  selection_read:
  - winlog.event_data.ParentCommandLine|contains|all:
    - 'cmd '
    - '/r '
    - <
  - winlog.event_data.CommandLine|contains|all:
    - 'cmd '
    - '/r '
    - <
falsepositives:
- Legitimate use
id: 00a4bacd-6db4-46d5-9258-a7d5ebff4003
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1059.003/T1059.003.md
status: experimental
tags:
- attack.execution
- attack.t1059.003
title: Read and Execute a File Via Cmd.exe
