author: Teymur Kheirkhabarov (idea), Vasiliy Burov (rule), oscd.community, Tim Shelton
category: process_creation
date: 2022/07/06
description: Detects specific combinations of encoding methods in the PowerShell command
  lines
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains|all:
    - ForEach
    - Xor
    winlog.event_data.Image|endswith:
    - \powershell.exe
    - \pwsh.exe
falsepositives:
- Unlikely
id: 5b572dcf-254b-425c-a8c5-d9af6bea35a6
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/07/14
product: windows
references:
- https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=65
related:
- id: cdf05894-89e7-4ead-b2b0-0a5f97a90f2f
  type: similar
status: test
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
title: Suspicious Encoded PowerShell Command Line
