author: Nasreddine Bencherchali, Florian Roth
category: process_creation
date: 2022/08/25
description: Detects process activity patterns as seen being used by Sliver C2 framework
  implants
detection:
  condition: 1 of selection*
  selection_cmdline:
    winlog.event_data.CommandLine|contains: -NoExit -Command [Console]::OutputEncoding=[Text.UTF8Encoding]::UTF8
falsepositives:
- Unlikely
id: 42333b2c-b425-441c-b70e-99404a17170f
level: critical
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://github.com/BishopFox/sliver/blob/79f2d48fcdfc2bee4713b78d431ea4b27f733f30/implant/sliver/shell/shell_windows.go#L36
- https://www.microsoft.com/security/blog/2022/08/24/looking-for-the-sliver-lining-hunting-for-emerging-command-and-control-frameworks/
status: experimental
tags:
- attack.execution
- attack.t1059
title: Sliver C2 Implant Activity Pattern
