author: Nasreddine Bencherchali
category: process_creation
date: 2022/07/12
description: 'Detects execution of the "mofcomp" utility as a child of a suspicious
  shell or script running utility or by having a supsicious path in the commandline.

  The "mofcomp" utility parses a file containing MOF statements and adds the classes
  and class instances defined in the file to the WMI repository.

  Attackers abuse this utility to install malicious MOF scripts

  '
detection:
  condition: all of selection_*
  selection_case:
  - winlog.event_data.ParentImage|endswith:
    - \cmd.exe
    - \powershell.exe
    - \pwsh.exe
    - \wsl.exe
    - \wscript.exe
    - \cscript.exe
  - winlog.event_data.CommandLine|contains:
    - \AppData\Local\Temp
    - \Users\Public\
    - \WINDOWS\Temp\
    - '%temp%'
    - '%appdata%'
  selection_img:
    winlog.event_data.Image|endswith: \mofcomp.exe
falsepositives:
- Unknown
id: 1dd05363-104e-4b4a-b963-196a534b03a1
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/07/14
product: windows
references:
- https://thedfirreport.com/2022/07/11/select-xmrig-from-sqlserver/
- https://github.com/The-DFIR-Report/Sigma-Rules/blob/75260568a7ffe61b2458ca05f6f25914efb44337/win_mofcomp_execution.yml
- https://docs.microsoft.com/en-us/windows/win32/wmisdk/mofcomp
status: experimental
tags:
- attack.execution
- attack.t1218
title: Suspicious Mofcomp Execution
