author: '@gott_cyber'
category: process_creation
date: 2022/08/29
description: "Detects the use of the PhoneDeepLink parameter to potentially sideload\
  \ a DLL file that doesnt exist. This non-existent DLL file is named \"ShellChromeAPI.dll\"\
  . \nAdversaries can drop their own renamed DLL and execute it via DeviceEnroller.exe\
  \ using this parameter\n"
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains: /PhoneDeepLink
    winlog.event_data.Image|endswith: \deviceenroller.exe
falsepositives:
- Unknown
id: e173ad47-4388-4012-ae62-bd13f71c18a8
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://mobile.twitter.com/0gtweet/status/1564131230941122561
- https://strontic.github.io/xcyclopedia/library/DeviceEnroller.exe-24BEF0D6B0ECED36BB41831759FDE18D.html
status: experimental
tags:
- attack.defense_evasion
- attack.t1574.002
title: DLL Sideloading via DeviceEnroller.exe
