author: Christian Burkard
category: process_creation
date: 2022/03/01
description: Detects base64 encoded listing Win32_Shadowcopy
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains:
    - VwBpAG4AMwAyAF8AUwBoAGEAZABvAHcAYwBvAHAAeQAgAHwAIABGAG8AcgBFAGEAYwBoAC0ATwBiAGoAZQBjAHQA
    - cAaQBuADMAMgBfAFMAaABhAGQAbwB3AGMAbwBwAHkAIAB8ACAARgBvAHIARQBhAGMAaAAtAE8AYgBqAGUAYwB0A
    - XAGkAbgAzADIAXwBTAGgAYQBkAG8AdwBjAG8AcAB5ACAAfAAgAEYAbwByAEUAYQBjAGgALQBPAGIAagBlAGMAdA
falsepositives:
- Unlikely
fields:
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: 47688f1b-9f51-4656-b013-3cc49a166a36
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/03/07
product: windows
references:
- https://github.com/Neo23x0/Raccine/blob/20a569fa21625086433dcce8bb2765d0ea08dcb6/yara/mal_revil.yar
status: test
tags:
- attack.execution
- attack.t1059.001
- attack.defense_evasion
- attack.t1027
title: Base64 Encoded Listing of Shadowcopy
