author: Austin Songer @austinsonger, Florian Roth
category: process_creation
date: 2021/11/26
description: Detects when a user bypasses Defender by renaming a tool to dump64.exe
  and placing it in a Visual Studio folder
detection:
  condition: ( selection and not filter ) or ( selection and procdump_flags )
  filter:
    winlog.event_data.Image|contains: \Installer\Feedback\dump64.exe
  procdump_flags:
    winlog.event_data.CommandLine|contains:
    - ' -ma '
    - accpeteula
  selection:
    winlog.event_data.Image|endswith: \dump64.exe
falsepositives:
- Dump64.exe in other folders than the excluded one
id: 129966c9-de17-4334-a123-8b58172e664d
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://twitter.com/mrd0x/status/1460597833917251595
status: experimental
tags:
- attack.credential_access
- attack.t1003.001
title: Suspicious Dump64.exe Execution
