author: Moriarty Meng (idea), Anton Kutepov (rule), oscd.community
category: process_creation
date: 2020/10/17
description: Detects PowerShell script execution via input stream redirect
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|re: \s-\s*<
    winlog.event_data.Image|endswith:
    - \powershell.exe
    - \pwsh.exe
falsepositives:
- Unknown
id: c83bf4b5-cdf0-437c-90fa-43d734f7c476
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
product: windows
references:
- https://github.com/LOLBAS-Project/LOLBAS/blob/4db780e0f0b2e2bb8cb1fa13e09196da9b9f1834/yml/LOLUtilz/OSBinaries/Powershell.yml
- https://twitter.com/Moriarty_Meng/status/984380793383370752
status: test
tags:
- attack.defense_evasion
- attack.execution
- attack.t1059
title: Run PowerShell Script from Redirected Input Stream
