author: Florian Roth
category: process_creation
date: 2022/02/26
description: Detects suspicious Windows Update Agent activity in which a wuauclt.exe
  process command line doesn't contain any command line flags
detection:
  condition: all of selection*
  selection_cli:
    winlog.event_data.CommandLine|endswith: \Wuauclt.exe
  selection_img:
  - winlog.event_data.Image|endswith: \Wuauclt.exe
  - winlog.event_data.OriginalFileName: Wuauclt.exe
falsepositives:
- Unknown
id: 52d097e2-063e-4c9c-8fbb-855c8948d135
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/05/13
product: windows
references:
- https://redcanary.com/blog/blackbyte-ransomware/
status: experimental
title: Suspicious Windows Update Agent Empty Cmdline
