author: frack113
category: process_creation
date: 2022/01/09
description: Disables HTTP logging on a Windows IIS web server as seen by Threat Group
  3390 (Bronze Union)
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains|all:
    - set
    - config
    - /section:httplogging
    - /dontLog:true
    winlog.event_data.Image|endswith: \appcmd.exe
falsepositives:
- Unknown
id: e4ed6030-ffe5-4e6a-8a8a-ab3c1ab9d94e
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.002/T1562.002.md#atomic-test-1---disable-windows-iis-http-logging
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.002
title: Disable Windows IIS HTTP Logging
