author: '@gott_cyber'
category: process_creation
date: 2022/07/31
description: 'Detects an attempt to add a potentially crafted DLL as a plug in of
  the DNS Service.

  Detects an attempt to leverage dnscmd.exe to enumerate the DNS zones of a domain.

  DNS zones used to host the DNS records for a particular domain

  '
detection:
  condition: dnscmd and 1 of selection_*
  dnscmd:
    winlog.event_data.Image|endswith: \dnscmd.exe
  selection_1:
    winlog.event_data.CommandLine|contains:
    - /enumrecords
    - /enumzones
    - /info
  selection_2:
    winlog.event_data.CommandLine|contains|all:
    - /config
    - /serverlevelplugindll
falsepositives:
- Legitimate administration use
id: b6457d63-d2a2-4e29-859d-4e7affc153d1
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/dnscmd
- https://docs.microsoft.com/en-us/azure/dns/dns-zones-records
- https://lolbas-project.github.io/lolbas/Binaries/Dnscmd/
status: experimental
tags:
- attack.discovery
- attack.execution
- attack.t1543.003
title: Discovery/Execution via dnscmd.exe
