author: frack113
category: process_creation
date: 2021/12/10
description: Adversaries may attempt to get a listing of services running on remote
  hosts, including those that may be vulnerable to remote software exploitation
detection:
  condition: selection
  selection:
    winlog.event_data.OriginalFileName: nmap.exe
falsepositives:
- Network administrator computer
id: f6ecd1cf-19b8-4488-97f6-00f0924991a3
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://nmap.org/
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1046/T1046.md#atomic-test-3---port-scan-nmap-for-windows
status: experimental
tags:
- attack.discovery
- attack.t1046
title: Suspicious Nmap Execution
