author: Sreeman
category: process_creation
date: 2020/09/29
description: Detects modification of an existing service on a compromised host in
  order to execute an arbitrary payload when the service is started or killed as a
  method of persistence.
detection:
  condition: 1 of selection_cmdline_*
  selection_cmdline_1:
    winlog.event_data.CommandLine|contains|all:
    - 'sc '
    - 'config '
    - binpath=
  selection_cmdline_2:
    winlog.event_data.CommandLine|contains|all:
    - 'sc '
    - failure
    - command=
  selection_cmdline_3:
    winlog.event_data.CommandLine|contains:
    - .sh
    - .exe
    - .dll
    - .bin$
    - .bat
    - .cmd
    - .js
    - .msh$
    - .reg$
    - .scr
    - .ps
    - .vb
    - .jar
    - .pl
    winlog.event_data.CommandLine|contains|all:
    - 'reg '
    - 'add '
    - FailureCommand
  selection_cmdline_4:
    winlog.event_data.CommandLine|contains:
    - .sh
    - .exe
    - .dll
    - .bin$
    - .bat
    - .cmd
    - .js
    - .msh$
    - .reg$
    - .scr
    - .ps
    - .vb
    - .jar
    - .pl
    winlog.event_data.CommandLine|contains|all:
    - 'reg '
    - 'add '
    - winlog.event_data.ImagePath
falsepositives:
- Unknown
id: 38879043-7e1e-47a9-8d46-6bec88e201df
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/03/06
product: windows
references:
- https://pentestlab.blog/2020/01/22/persistence-modify-existing-service/
status: experimental
tags:
- attack.persistence
- attack.t1543.003
- attack.t1574.011
title: Modification Of Existing Services For Persistence
