author: Florian Roth
category: process_creation
date: 2022/04/06
description: Detects suspicious ways to use of a Visual Studio bundled tool named
  DumpMinitool.exe
detection:
  cmd_has_flags:
    winlog.event_data.CommandLine|contains: ' Full'
  condition: selection and ( ( not filter_folder ) or susp_flags or ( cmd_has_flags
    and not filter_cmd_misses_flags ) )
  filter_cmd_misses_flags:
    winlog.event_data.CommandLine|contains: --dumpType
  filter_folder:
    winlog.event_data.Image|contains:
    - \Microsoft Visual Studio\
    - \Extensions\
  selection:
  - winlog.event_data.Image|endswith: \DumpMinitool.exe
  - OriginalName: DumpMinitool.exe
  susp_flags:
    winlog.event_data.CommandLine|contains: .txt
falsepositives:
- Unknown
id: eb1c4225-1c23-4241-8dd4-051389fde4ce
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://twitter.com/mrd0x/status/1511415432888131586
- https://twitter.com/mrd0x/status/1511489821247684615
status: experimental
tags:
- attack.defense_evasion
- attack.t1036
- attack.t1003.001
title: Suspicious DumpMinitool Usage
