author: Florian Roth
category: process_creation
date: 2022/06/08
description: Detects the execution of rundll32.exe that has been renamed to a different
  name to avoid detection
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.Image|endswith: \rundll32.exe
  selection:
    winlog.event_data.OriginalFileName: RUNDLL32.EXE
falsepositives:
- Unknown
id: d4d2574f-ac17-4d9e-b986-aeeae0dc8fe2
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://threatresearch.ext.hp.com/svcready-a-new-loader-reveals-itself/
status: experimental
title: Renamed Rundll32.exe Execution
