author: oscd.community, Natalia Shornikova
category: process_creation
date: 2020/10/13
description: Detects a usage of the manage-bde.wsf script that may indicate an attempt
  of proxy execution from script
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains|all:
    - cscript
    - manage-bde.wsf
falsepositives:
- Unknown
id: c363385c-f75d-4753-a108-c1a8e28bdbda
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2021/05/21
product: windows
references:
- https://lolbas-project.github.io/lolbas/Scripts/Manage-bde/
- https://gist.github.com/bohops/735edb7494fe1bd1010d67823842b712
- https://twitter.com/bohops/status/980659399495741441
- https://twitter.com/JohnLaTwC/status/1223292479270600706
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1216/T1216.md
status: experimental
tags:
- attack.defense_evasion
- attack.t1216
title: Suspicious Usage of the Manage-bde.wsf Script
