author: frack113
category: process_creation
date: 2021/07/27
description: An adversary may compress or encrypt data that is collected prior to
  exfiltration using 3rd party utilities
detection:
  condition: all of selection*
  selection_7z:
    winlog.event_data.CommandLine|contains:
    - 7z.exe
    - 7za.exe
  selection_action:
    winlog.event_data.CommandLine|contains:
    - ' a '
    - ' u '
  selection_password:
    winlog.event_data.CommandLine|contains: ' -p'
falsepositives:
- Command line parameter combinations that contain all included strings
fields:
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
- winlog.event_data.CurrentDirectory
id: 9fbf5927-5261-4284-a71d-f681029ea574
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2021/12/02
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1560.001/T1560.001.md
status: experimental
tags:
- attack.collection
- attack.t1560.001
title: Compress Data and Lock With Password for Exfiltration With 7-ZIP
