author: Florian Roth
category: process_creation
date: 2022/02/25
description: This rule detect common flag combinations used by CrackMapExec in order
  to detect its use even if the binary has been replaced.
detection:
  condition: 1 of selection* or all of part_localauth*
  part_localauth_1:
    winlog.event_data.CommandLine|contains|all:
    - ' --local-auth'
    - ' -u '
    - ' -p '
  part_localauth_2:
    winlog.event_data.CommandLine|contains|all:
    - ' 10.'
    - ' 192.168.'
    - '/24 '
  selection_execute:
    winlog.event_data.CommandLine|contains|all:
    - ' --local-auth'
    - ' -u '
    - ' -x '
  selection_hash:
    winlog.event_data.CommandLine|contains|all:
    - ' --local-auth'
    - ' -u '
    - ' -p '
    - ' -H ''NTHASH'''
  selection_module_mssql:
    winlog.event_data.CommandLine|contains|all:
    - ' mssql '
    - ' -u '
    - ' -p '
    - ' -M '
    - ' -d '
  selection_module_smb1:
    winlog.event_data.CommandLine|contains|all:
    - ' smb '
    - ' -u '
    - ' -H '
    - ' -M '
    - ' -o '
  selection_module_smb2:
    winlog.event_data.CommandLine|contains|all:
    - ' smb '
    - ' -u '
    - ' -p '
    - ' --local-auth'
  selection_special:
    winlog.event_data.CommandLine|contains: ' -M pe_inject '
falsepositives:
- Unknown
fields:
- winlog.ComputerName
- winlog.event_data.User
- winlog.event_data.CommandLine
id: 42a993dd-bb3e-48c8-b372-4d6684c4106c
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://mpgn.gitbook.io/crackmapexec/smb-protocol/authentication/checking-credentials-local
- https://www.mandiant.com/resources/telegram-malware-iranian-espionage
- https://www.infosecmatter.com/crackmapexec-module-library/?cmem=mssql-mimikatz
- https://www.infosecmatter.com/crackmapexec-module-library/?cmem=smb-pe_inject
status: experimental
title: CrackMapExec Command Line Flags
