author: Nasreddine Bencherchali
category: process_creation
date: 2022/09/01
description: Detects suspicious manipulations of default accounts such as 'administrator'
  and 'guest'. For example 'enable' or 'disable' accounts or change the password...etc
detection:
  condition: all of selection_* and not filter
  filter:
    winlog.event_data.CommandLine|contains|all:
    - guest
    - /active no
  selection_img:
    winlog.event_data.Image|endswith:
    - \net.exe
    - \net1.exe
  selection_user_option:
    winlog.event_data.CommandLine|contains: ' user '
  selection_username:
    winlog.event_data.CommandLine|contains:
    - " J\xE4rjestelm\xE4nvalvoja "
    - ' Rendszergazda '
    - " \u0410\u0434\u043C\u0438\u043D\u0438\u0441\u0442\u0440\u0430\u0442\u043E\u0440\
      \ "
    - ' Administrateur '
    - ' Administrador '
    - " Administrat\xF6r "
    - ' Administrator '
    - ' guest '
    - " \"J\xE4rjestelm\xE4nvalvoja\" "
    - ' "Rendszergazda" '
    - " \"\u0410\u0434\u043C\u0438\u043D\u0438\u0441\u0442\u0440\u0430\u0442\u043E\
      \u0440\" "
    - ' "Administrateur" '
    - ' "Administrador" '
    - " \"Administrat\xF6r\" "
    - ' "Administrator" '
    - ' "guest" '
    - " 'J\xE4rjestelm\xE4nvalvoja' "
    - ' ''Rendszergazda'' '
    - " '\u0410\u0434\u043C\u0438\u043D\u0438\u0441\u0442\u0440\u0430\u0442\u043E\u0440\
      ' "
    - ' ''Administrateur'' '
    - ' ''Administrador'' '
    - " 'Administrat\xF6r' "
    - ' ''Administrator'' '
    - ' ''guest'' '
falsepositives:
- Some fasle positives could occure with the admin or guest account. It depends on
  the scripts being used by the admins in your env. If you experience a lot of FP
  you could reduce the level to medium
id: 5b768e71-86f2-4879-b448-81061cbae951
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://www.trellix.com/en-sg/about/newsroom/stories/threat-labs/lockergoga-ransomware-family-used-in-targeted-attacks.html
- https://redacted.com/blog/bianlian-ransomware-gang-gives-it-a-go/
status: experimental
tags:
- attack.collection
- attack.t1560.001
title: Suspicious Manipulation Of Default Accounts
