author: Fatih Sirin
category: process_creation
date: 2019/11/01
description: Detects netsh commands that turns off the Windows firewall
detection:
  condition: 1 of selection_*
  selection_1:
    winlog.event_data.CommandLine|contains|all:
    - netsh
    - firewall
    - set
    - opmode
    - mode=disable
  selection_2:
    winlog.event_data.CommandLine|contains|all:
    - netsh
    - advfirewall
    - set
    - state
    - 'off'
falsepositives:
- Legitimate administration
id: 57c4bf16-227f-4394-8ec7-1b745ee061c3
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/01/09
product: windows
references:
- https://www.winhelponline.com/blog/enable-and-disable-windows-firewall-quickly-using-command-line/
- https://app.any.run/tasks/210244b9-0b6b-4a2c-83a3-04bd3175d017/
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.004/T1562.004.md#atomic-test-1---disable-microsoft-defender-firewall
status: test
tags:
- attack.defense_evasion
- attack.t1562.004
- attack.s0108
title: Firewall Disabled via Netsh
