author: Florian Roth
category: process_creation
date: 2021/02/11
description: Detects ScreenConnect program starts that establish a remote access to
  that system (not meeting, not remote support)
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains|all:
    - e=Access&
    - y=Guest&
    - '&p='
    - '&c='
    - '&k='
falsepositives:
- Legitimate use by administrative staff
id: 75bfe6e6-cd8e-429e-91d3-03921e1d7962
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://www.anomali.com/blog/probable-iranian-cyber-actors-static-kitten-conducting-cyberespionage-campaign-targeting-uae-and-kuwait-government-agencies
status: experimental
tags:
- attack.initial_access
- attack.t1133
title: ScreenConnect Remote Access
