author: frack113
category: process_creation
date: 2022/01/01
description: Use of hostname to get information
detection:
  condition: selection
  selection:
    winlog.event_data.Image|endswith: \HOSTNAME.EXE
falsepositives:
- Unknown
id: 7be5fb68-f9ef-476d-8b51-0256ebece19e
level: low
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1082/T1082.md#atomic-test-6---hostname-discovery-windows
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/hostname
status: experimental
tags:
- attack.discovery
- attack.t1082
title: Suspicious Execution of Hostname
