author: Florian Roth
category: process_creation
date: 2019/02/09
description: Detects suspicious use of 'calc.exe' with command line parameters or
  in a suspicious directory, which is likely caused by some PoC or detection evasion
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.Image|startswith:
    - C:\Windows\System32\
    - C:\Windows\SysWOW64\
    - C:\Windows\WinSxS\
  selection:
  - winlog.event_data.CommandLine|contains: '\calc.exe '
  - winlog.event_data.Image|endswith: \calc.exe
falsepositives:
- Unknown
id: 737e618a-a410-49b5-bec3-9e55ff7fbc15
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/08/04
product: windows
references:
- https://twitter.com/ItsReallyNick/status/1094080242686312448
status: test
tags:
- attack.defense_evasion
- attack.t1036
title: Suspicious Calculator Usage
