author: E.M. Anhaus (originally from Atomic Blue Detections, Endgame), oscd.community
category: process_creation
date: 2019/10/24
description: Detect commandline usage of Microsoft Connection Manager Profile Installer
  (cmstp.exe) to install specially formatted local .INF files
detection:
  condition: all of selection*
  selection_cli:
    winlog.event_data.CommandLine|contains:
    - /s
    - -s
    - /au
    - -au
    - /ni
    - -ni
  selection_img:
  - winlog.event_data.Image|endswith: \cmstp.exe
  - winlog.event_data.OriginalFileName: CMSTP.EXE
falsepositives:
- Legitimate use of cmstp.exe utility by legitimate user
fields:
- winlog.ComputerName
- winlog.event_data.User
- winlog.event_data.CommandLine
id: e66779cc-383e-4224-a3a4-267eeb585c40
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/08/30
product: windows
references:
- https://eqllib.readthedocs.io/en/latest/analytics/e584f1a1-c303-4885-8a66-21360c90995b.html
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218.003/T1218.003.md
- https://lolbas-project.github.io/lolbas/Binaries/Cmstp/
status: test
tags:
- attack.privilege_escalation
- attack.defense_evasion
- attack.t1548.002
- attack.t1218.003
title: Bypass UAC via CMSTP
