author: Florian Roth
category: process_creation
date: 2022/01/11
description: Detects uses of the SysInternals Procdump utility in which procdump or
  its output get renamed or a dump file is moved ot copied to a different name
detection:
  condition: 1 of selection*
  selection1:
    winlog.event_data.CommandLine|contains:
    - copy procdump
    - move procdump
  selection2:
    winlog.event_data.CommandLine|contains:
    - 2.dmp
    - lsass
    - out.dmp
    winlog.event_data.CommandLine|contains|all:
    - 'copy '
    - '.dmp '
  selection3:
    winlog.event_data.CommandLine|contains:
    - copy lsass.exe_
    - move lsass.exe_
falsepositives:
- Cases in which procdump just gets copied to a different directory without any renaming
id: 79b06761-465f-4f88-9ef2-150e24d3d737
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://twitter.com/mrd0x/status/1480785527901204481
status: experimental
tags:
- attack.defense_evasion
- attack.t1036
- attack.t1003.001
title: Procdump Evasion
