author: Oddvar Moe, Sander Wiebing, oscd.community
category: process_creation
date: 2020/10/12
description: Detects the export of a crital Registry key to a file.
detection:
  condition: all of selection*
  selection:
    winlog.event_data.CommandLine|contains:
    - ' /E '
    - ' -E '
    winlog.event_data.Image|endswith: \regedit.exe
  selection_2:
    winlog.event_data.CommandLine|contains:
    - hklm
    - hkey_local_machine
  selection_3:
    winlog.event_data.CommandLine|endswith:
    - \system
    - \sam
    - \security
falsepositives:
- Dumping hives for legitimate purpouse i.e. backup or forensic investigation
fields:
- winlog.event_data.ParentImage
- winlog.event_data.CommandLine
id: 82880171-b475-4201-b811-e9c826cd5eaa
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/07/07
product: windows
references:
- https://lolbas-project.github.io/lolbas/Binaries/Regedit/
- https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f
status: test
tags:
- attack.exfiltration
- attack.t1012
title: Exports Critical Registry Keys To a File
