author: Vasiliy Burov, oscd.community
category: process_creation
date: 2020/10/18
description: Detects LockerGoga Ransomware command line.
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains: -i SM-tgytutrc -s
falsepositives:
- Unlikely
id: 74db3488-fd28-480a-95aa-b7af626de068
level: critical
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
product: windows
references:
- https://medium.com/@malwaredancer/lockergoga-input-arguments-ipc-communication-and-others-bd4e5a7ba80a
- https://blog.f-secure.com/analysis-of-lockergoga-ransomware/
- https://www.carbonblack.com/blog/tau-threat-intelligence-notification-lockergoga-ransomware/
status: stable
tags:
- attack.impact
- attack.t1486
title: LockerGoga Ransomware
