author: Florian Roth
category: process_creation
date: 2022/01/11
description: Detects a certain command line flag combination used by devinit.exe lolbin
  to download arbitrary MSI packages on a Windows system
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains|all:
    - ' -t msi-install '
    - ' -i http'
falsepositives:
- Unknown
id: 90d50722-0483-4065-8e35-57efaadd354d
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://twitter.com/mrd0x/status/1460815932402679809
status: experimental
tags:
- attack.execution
- attack.defense_evasion
- attack.t1218
title: DevInit Lolbin Download
