author: Nasreddine Bencherchali
category: process_creation
date: 2022/06/10
description: Detects execution of the Notepad++ updater (gup) to launch other commands
  or executables
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.CommandLine|contains: \Notepad++\notepad++.exe
    winlog.event_data.Image|endswith: \explorer.exe
  selection:
    winlog.event_data.Image|endswith: \explorer.exe
    winlog.event_data.ParentImage|endswith: \gup.exe
falsepositives:
- Other parent binaries using GUP not currently identified
id: d65aee4d-2292-4cea-b832-83accd6cfa43
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://twitter.com/nas_bench/status/1535322445439180803
status: experimental
tags:
- attack.execution
title: Execute Arbitrary Binaries Using GUP Utility
