author: Nextron Systems
category: process_creation
date: 2022/06/03
description: Detects python spawning a pretty tty
detection:
  condition: selection_image and 1 of selection_cli*
  selection_cli1:
    winlog.event_data.CommandLine|contains|all:
    - import pty
    - .spawn(
  selection_cli2:
    winlog.event_data.CommandLine|contains: from pty import spawn
  selection_image:
    winlog.event_data.Image|endswith:
    - python.exe
    - python3.exe
    - python2.exe
falsepositives:
- Unknown
id: 480e7e51-e797-47e3-8d72-ebfce65b6d8d
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://www.volexity.com/blog/2022/06/02/zero-day-exploitation-of-atlassian-confluence/
status: experimental
tags:
- attack.execution
- attack.t1059
title: Python Spawning Pretty TTY on Windows
