author: Florian Roth
category: process_creation
date: 2018/03/17
description: Detects a suspicious RDP session redirect using tscon.exe
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains: ' /dest:rdp-tcp:'
falsepositives:
- Unknown
id: f72aa3e8-49f9-4c7d-bd74-f8ab84ff9bbb
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
product: windows
references:
- http://www.korznikov.com/2017/03/0-day-or-feature-privilege-escalation.html
- https://medium.com/@networksecurity/rdp-hijacking-how-to-hijack-rds-and-remoteapp-sessions-transparently-to-move-through-an-da2a1e73a5f6
status: test
tags:
- attack.lateral_movement
- attack.t1563.002
- attack.t1021.001
- car.2013-07-002
title: Suspicious RDP Redirect Using TSCON
