author: Florian Roth, Tim Shelton
category: process_creation
date: 2019/10/02
description: Detects a suspicious DLL loading from AppData Local path as described
  in BlueMashroom report
detection:
  condition: selection and not 1 of filter*
  filter_teams:
  - winlog.event_data.CommandLine|contains: AppData\Local\Microsoft\TeamsMeetingAddin\
  - winlog.event_data.CommandLine|endswith:
    - \x86\Microsoft.Teams.AddinLoader.dll
    - \x86\Microsoft.Teams.AddinLoader.dll"
    - \x64\Microsoft.Teams.AddinLoader.dll
    - \x64\Microsoft.Teams.AddinLoader.dll"
  filter_webex:
    winlog.event_data.CommandLine|endswith: \AppData\Local\WebEx\WebEx64\Meetings\atucfobj.dll
  selection:
  - winlog.event_data.CommandLine|contains|all:
    - \regsvr32
    - \AppData\Local\
  - winlog.event_data.CommandLine|contains|all:
    - \AppData\Local\
    - ',DllEntry'
falsepositives:
- Unlikely
id: bd70d3f8-e60e-4d25-89f0-0b5a9cff20e0
level: critical
logsource:
  category: process_creation
  product: windows
modified: 2022/07/05
product: windows
references:
- https://www.virusbulletin.com/conference/vb2019/abstracts/apt-cases-exploiting-vulnerabilities-region-specific-software
status: test
tags:
- attack.defense_evasion
- attack.t1218.010
title: BlueMashroom DLL Load
