author: Nasreddine Bencherchali
category: process_creation
date: 2022/08/22
description: Detects the execution utitilies often found in Visual Studio tools that
  hardcode the call to the binary "link.exe". They can be abused to sideload any binary
  with the same name
detection:
  condition: selection and not 1 of filter_*
  filter_visual_studio:
    winlog.event_data.ParentImage|contains: \VC\Tools\MSVC\
    winlog.event_data.ParentImage|startswith:
    - C:\Program Files\Microsoft Visual Studio\
    - C:\Program Files (x86)\Microsoft Visual Studio\
  selection:
    winlog.event_data.CommandLine|contains: LINK /
    winlog.event_data.Image|endswith: \link.exe
falsepositives:
- Unknown
id: 6e968eb1-5f05-4dac-94e9-fd0c5cb49fd6
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://twitter.com/0gtweet/status/1560732860935729152
status: experimental
tags:
- attack.defense_evasion
- attack.t1218
title: Sideloading Link.EXE
