author: Sittikorn S
category: process_creation
date: 2021/06/21
description: Detects a suspicious child process of Script Event Consumer (scrcons.exe).
detection:
  condition: selection
  selection:
    winlog.event_data.Image|endswith:
    - \svchost.exe
    - \dllhost.exe
    - \powershell.exe
    - \pwsh.exe
    - \wscript.exe
    - \cscript.exe
    - \schtasks.exe
    - \regsvr32.exe
    - \mshta.exe
    - \rundll32.exe
    - \msiexec.exe
    - \msbuild.exe
    winlog.event_data.ParentImage|endswith: \scrcons.exe
falsepositives:
- Unknown
fields:
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: f6d1dd2f-b8ce-40ca-bc23-062efb686b34
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/07/14
product: windows
references:
- https://redcanary.com/blog/child-processes/
- https://docs.paloaltonetworks.com/cortex/cortex-xdr/cortex-xdr-analytics-alert-reference/cortex-xdr-analytics-alert-reference/scrcons-exe-rare-child-process.html
status: experimental
tags:
- attack.execution
- attack.t1047
title: Script Event Consumer Spawning Process
