author: Florian Roth
category: process_creation
date: 2020/02/04
description: Detects the use of Dumpert process dumper, which dumps the lsass.exe
  process memory
detection:
  condition: selection
  selection:
    winlog.event_data.Hashes|contains: 09D278F9DE118EF09163C6140255C690
falsepositives:
- Very unlikely
id: 2704ab9e-afe2-4854-a3b1-0c0706d03578
level: critical
logsource:
  category: process_creation
  product: windows
modified: 2021/12/08
product: windows
references:
- https://github.com/outflanknl/Dumpert
- https://unit42.paloaltonetworks.com/actors-still-exploiting-sharepoint-vulnerability/
status: experimental
tags:
- attack.credential_access
- attack.t1003.001
title: Dumpert Process Dumper
