author: Nasreddine Bencherchali
category: process_creation
date: 2022/08/03
description: Detects usage of an encoded/obfuscated version of an IP address (hex,
  octal...) via commandline
detection:
  condition: all of selection*
  selection_img:
    winlog.event_data.Image|endswith:
    - \ping.exe
    - \arp.exe
  selection_ip:
  - winlog.event_data.CommandLine|contains: ' 0x'
  - winlog.event_data.CommandLine|re: ' [0-9]{7,13}'
falsepositives:
- Unknown
id: 56d19cb4-6414-4769-9644-1ed35ffbb148
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://h.43z.one/ipconverter/
- https://twitter.com/Yasser_Elsnbary/status/1553804135354564608
status: experimental
tags:
- attack.discovery
title: Obfuscated IP Via CLI
