author: Nasreddine Bencherchali
category: process_creation
date: 2022/09/01
description: Detects suspicious usage of the ShellExec_rundll function to launch other
  commands as seen in the the raspberry-robin attack
detection:
  condition: all of selection_*
  selection_openasrundll:
    winlog.event_data.CommandLine|contains: ',ShellExec_rundll'
  selection_suspcli:
    winlog.event_data.CommandLine|contains:
    - regsvr32
    - C:\Users\Public\
    - odbcconf
    - \Desktop\
falsepositives:
- Unknown
id: d87bd452-6da1-456e-8155-7dc988157b7d
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://redcanary.com/blog/raspberry-robin/
status: experimental
tags:
- attack.defense_evasion
title: Suspicious Usage Of ShellExec_rundll
