author: frack113
category: process_creation
date: 2022/05/21
description: Detects the use of a Microsoft signed script to execute commands and
  bypassing AppLocker.
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains:
    - \CL_LoadAssembly.ps1
    - 'LoadAssemblyFromPath '
falsepositives:
- Unknown
id: c57872c7-614f-4d7f-a40d-b78c8df2d30d
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://bohops.com/2018/01/07/executing-commands-and-bypassing-applocker-with-powershell-diagnostic-scripts/
- https://lolbas-project.github.io/lolbas/Scripts/CL_LoadAssembly/
status: experimental
tags:
- attack.defense_evasion
- attack.t1216
title: CL_LoadAssembly.ps1 Proxy Execution
