author: Nasreddine Bencherchali
category: process_creation
date: 2022/08/05
description: Detects usage of the "wusa.exe" (Windows Update Standalone Installer)
  utility to extract cab using the "/extract" argument from suspicious paths
detection:
  condition: all of selection_*
  selection_paths:
    winlog.event_data.CommandLine|contains:
    - C:\Users\Public\
    - \Desktop\
    - \Downloads\
    - \Appdata\Local\Temp\
    - \Windows\Temp\
    - \PerfLogs\
  selection_root:
    winlog.event_data.CommandLine|contains: '/extract:'
    winlog.event_data.Image|endswith: \wusa.exe
falsepositives:
- Unknown
id: c74c0390-3e20-41fd-a69a-128f0275a5ea
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://web.archive.org/web/20180331144337/https://www.fireeye.com/blog/threat-research/2018/03/sanny-malware-delivery-method-updated-in-recently-observed-attacks.html
- https://www.echotrail.io/insights/search/wusa.exe/
status: experimental
tags:
- attack.execution
title: Wusa Extracting Cab Files From Suspicious Paths
