author: Nasreddine Bencherchali
category: process_creation
date: 2022/08/04
description: Detects usage of the "wusa.exe" (Windows Update Standalone Installer)
  utility to extract cab using the "/extract" argument which is not longer supported.
  This could indicate an attacker using an old technique
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains: '/extract:'
    winlog.event_data.Image|endswith: \wusa.exe
falsepositives:
- The "extract" flag still works on older 'wusa.exe' versions, which could be a legitimate
  use (monitor the path of the cab being extracted)
id: 59b39960-5f9d-4a49-9cef-1e4d2c1d0cb9
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://web.archive.org/web/20180331144337/https://www.fireeye.com/blog/threat-research/2018/03/sanny-malware-delivery-method-updated-in-recently-observed-attacks.html
status: experimental
tags:
- attack.execution
title: Wusa Extracting Cab Files
