author: Florian Roth, Jonhnathan Ribeiro, oscd.community
category: process_creation
date: 2019/02/24
description: Detects suspicious a certutil command that used to encode files, which
  is sometimes used for data exfiltration
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains|all:
    - -f
    - -encode
    winlog.event_data.Image|endswith: \certutil.exe
falsepositives:
- Unknown
id: e62a9f0c-ca1e-46b2-85d5-a6da77f86d1a
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/01/07
product: windows
references:
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/certutil
- https://unit42.paloaltonetworks.com/new-babyshark-malware-targets-u-s-national-security-think-tanks/
status: test
tags:
- attack.defense_evasion
- attack.t1027
title: Certutil Encode
