author: Florian Roth
category: process_creation
date: 2020/12/23
description: Detects different process creation events as described in various threat
  reports on Lazarus group activity
detection:
  condition: 1 of selection*
  selection1:
    winlog.event_data.CommandLine|contains:
    - reg.exe save hklm\sam %temp%\~reg_sam.save
    - 1q2w3e4r@#$@#$@#$
    - ' -hp1q2w3e4 '
    - '.dat data03 10000 -p '
  selection2:
    winlog.event_data.CommandLine|contains|all:
    - process call create
    - ' > %temp%\~'
  selection3:
    winlog.event_data.CommandLine|contains|all:
    - 'netstat -aon | find '
    - ' > %temp%\~'
  selection4:
    winlog.event_data.CommandLine|contains: .255 10 C:\ProgramData\
falsepositives:
- Overlap with legitimate process activity in some cases (especially selection 3 and
  4)
id: 24c4d154-05a4-4b99-b57d-9b977472443a
level: critical
logsource:
  category: process_creation
  product: windows
modified: 2021/06/27
product: windows
references:
- https://securelist.com/lazarus-covets-covid-19-related-intelligence/99906/
- https://www.hvs-consulting.de/lazarus-report/
status: experimental
tags:
- attack.g0032
- attack.execution
- attack.t1059
title: Lazarus Activity
