author: Austin Songer @austinsonger
category: process_creation
date: 2021/10/23
description: Detects when a user installs certificates by using CertOC.exe to loads
  the target DLL file.
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains|all:
    - -LoadDLL
    - .dll
    winlog.event_data.Image|endswith: \certoc.exe
falsepositives:
- None
fields:
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: 242301bc-f92f-4476-8718-78004a6efd9f
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://twitter.com/sblmsrsn/status/1445758411803480072?s=20
status: experimental
tags:
- attack.defense_evasion
- attack.t1218
title: Suspicious Load DLL via CertOC.exe
