author: frack113
category: process_creation
date: 2022/01/05
description: Adversaries may attempt to extract credential material from the Security
  Account Manager (SAM) database either through Windows Registry where the SAM database
  is stored
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains|all:
    - live
    - registry
    winlog.event_data.Image|endswith:
    - \pypykatz.exe
    - \python.exe
falsepositives:
- Unknown
id: a29808fd-ef50-49ff-9c7a-59a9b040b404
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://github.com/skelsec/pypykatz
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1003.002/T1003.002.md#atomic-test-2---registry-parse-with-pypykatz
status: experimental
tags:
- attack.credential_access
- attack.t1003.002
title: Registry Parse with Pypykatz
