author: Florian Roth, Nasreddine Bencherchali
category: process_creation
date: 2022/01/24
description: Detects the use of NirCmd tool for command execution, which could be
  the result of legitimate administrative activity
detection:
  combo_exec:
    winlog.event_data.CommandLine|contains:
    - ' exec '
    - ' exec2 '
  combo_exec_params:
    winlog.event_data.CommandLine|contains:
    - ' show '
    - ' hide '
  condition: 1 of selection* or all of combo_*
  selection_cmd:
    winlog.event_data.CommandLine|contains:
    - ' execmd '
    - '.exe script '
    - '.exe shexec '
    - ' runinteractive '
  selection_org:
    winlog.event_data.OriginalFileName: NirCmd.exe
falsepositives:
- Legitimate use by administrators
fields:
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: 4e2ed651-1906-4a59-a78a-18220fca1b22
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/08/08
product: windows
references:
- https://www.nirsoft.net/utils/nircmd.html
- https://www.winhelponline.com/blog/run-program-as-system-localsystem-account-windows/
- https://www.nirsoft.net/utils/nircmd2.html#using
status: experimental
tags:
- attack.execution
- attack.t1569.002
- attack.s0029
title: NirCmd Tool Execution
