author: frack113
category: process_creation
date: 2022/04/04
description: ForceV1 asks for information directly from the kernel space. Conhost
  connects to the console application
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains|all:
    - conhost.exe
    - '0xffffffff'
    - -ForceV1
falsepositives:
- Unknown
id: 3037d961-21e9-4732-b27a-637bcc7bf539
level: informational
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://cybercryptosec.medium.com/covid-19-cyber-infection-c615ead7c29
- https://thedfirreport.com/2022/04/04/stolen-images-campaign-ends-in-conti-ransomware/
status: experimental
tags:
- attack.defense_evasion
- attack.t1202
title: Suspicious Conhost Legacy Option
