author: frack113, Christopher Peacock '@securepeacock', SCYTHE '@scythe_io'
category: process_creation
date: 2021/12/07
description: Adversaries may look for details about the network configuration and
  settings of systems they access or through information discovery of remote systems
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains:
    - 'config '
    - 'state '
    - 'rule '
    - name=all
    winlog.event_data.CommandLine|contains|all:
    - 'netsh '
    - 'show '
    - 'firewall '
falsepositives:
- Administrative activity
id: 0e4164da-94bc-450d-a7be-a4b176179f1f
level: low
logsource:
  category: process_creation
  product: windows
modified: 2022/04/11
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1016/T1016.md#atomic-test-2---list-windows-firewall-rules
status: experimental
tags:
- attack.discovery
- attack.t1016
title: Suspicious Netsh Discovery Command
