author: frack113
category: process_creation
date: 2022/01/15
description: Adversaries may attempt to make an executable or file difficult to discover
  or analyze by encrypting, encoding, or otherwise obfuscating its contents on the
  system or in transit.
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains:
    - "\xE2"
    - "\u20AC"
    - "\xA3"
    - "\xAF"
    - "\xAE"
    - "\xB5"
    - "\xB6"
falsepositives:
- Unknown
id: e0552b19-5a83-4222-b141-b36184bb8d79
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://www.wietzebeukema.nl/blog/windows-command-line-obfuscation
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1027/T1027.md#atomic-test-6---dlp-evasion-via-sensitive-data-in-vba-macro-over-http
status: experimental
tags:
- attack.defense_evasion
- attack.t1027
title: Obfuscated Command Line Using Special Unicode Characters
