author: Florian Roth
category: process_creation
date: 2019/12/31
description: Detects the use of Windows Credential Editor (WCE)
detection:
  condition: ( selection1 or selection2 ) and not filter
  filter:
    winlog.event_data.Image|endswith: \clussvc.exe
  selection1:
  - winlog.event_data.Imphash:
    - a53a02b997935fd8eedcb5f7abab9b9f
    - e96a73c7bf33a464c510ede582318bf2
  - winlog.event_data.Hashes|contains:
    - IMPHASH=a53a02b997935fd8eedcb5f7abab9b9f
    - IMPHASH=e96a73c7bf33a464c510ede582318bf2
  selection2:
    winlog.event_data.CommandLine|endswith: .exe -S
    winlog.event_data.ParentImage|endswith: \services.exe
falsepositives:
- Another service that uses a single -s command line switch
id: 7aa7009a-28b9-4344-8c1f-159489a390df
level: critical
logsource:
  category: process_creation
  product: windows
modified: 2022/03/04
product: windows
references:
- https://www.ampliasecurity.com/research/windows-credentials-editor/
status: experimental
tags:
- attack.credential_access
- attack.t1003.001
- attack.s0005
title: Windows Credential Editor
