author: Tobias Michalski
category: process_creation
date: 2021/06/08
description: Detects the Installation of a Exchange Transport Agent
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains: Install-TransportAgent
falsepositives:
- Legitimate installations of exchange TransportAgents. AssemblyPath is a good indicator
  for this.
fields:
- AssemblyPath
id: 83809e84-4475-4b69-bc3e-4aad8568612f
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2021/09/19
product: windows
references:
- https://twitter.com/blueteamsec1/status/1401290874202382336?s=20
status: experimental
tags:
- attack.persistence
- attack.t1505.002
title: MSExchange Transport Agent Installation
