author: Florian Roth
category: process_creation
date: 2022/02/28
description: Detects suspicious PowerShell download patterns that are often used in
  malicious scripts, stagers or downloaders (make sure that your backend applies the
  strings case-insensitive)
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains:
    - IEX ((New-Object Net.WebClient).DownloadString
    - IEX (New-Object Net.WebClient).DownloadString
    - IEX((New-Object Net.WebClient).DownloadString
    - IEX(New-Object Net.WebClient).DownloadString
    - ' -command (New-Object System.Net.WebClient).DownloadFile('
    - ' -c (New-Object System.Net.WebClient).DownloadFile('
falsepositives:
- Software installers that pull packages from remote systems and execute them
id: e6c54d94-498c-4562-a37c-b469d8e9a275
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/03/01
product: windows
references:
- https://gist.github.com/jivoi/c354eaaf3019352ce32522f916c03d70
status: experimental
tags:
- attack.execution
- attack.t1059.001
title: Suspicious PowerShell Download and Execute Pattern
