author: Michael Haag, Florian Roth, Markus Neis, Elastic, FPT.EagleEye Team
category: process_creation
date: 2022/02/28
description: Detects a Windows command and scripting interpreter executable started
  from Microsoft Outlook
detection:
  condition: selection
  selection:
    winlog.event_data.Image|endswith:
    - \cmd.exe
    - \powershell.exe
    - \pwsh.exe
    - \wscript.exe
    - \cscript.exe
    - \sh.exe
    - \bash.exe
    - \scrcons.exe
    - \schtasks.exe
    - \regsvr32.exe
    - \hh.exe
    - \wmic.exe
    - \mshta.exe
    - \msiexec.exe
    - \forfiles.exe
    - \scriptrunner.exe
    - \mftrace.exe
    - \AppVLP.exe
    - \svchost.exe
    - \msbuild.exe
    - \msdt.exe
    winlog.event_data.ParentImage|endswith: \OUTLOOK.EXE
falsepositives:
- Unknown
fields:
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: 208748f7-881d-47ac-a29c-07ea84bf691d
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/05/31
product: windows
references:
- https://www.hybrid-analysis.com/sample/465aabe132ccb949e75b8ab9c5bda36d80cf2fd503d52b8bad54e295f28bbc21?environmentId=100
- https://mgreen27.github.io/posts/2018/04/02/DownloadCradle.html
related:
- id: 438025f9-5856-4663-83f7-52f878a70a50
  type: derived
status: test
tags:
- attack.execution
- attack.t1204.002
title: Microsoft Outlook Product Spawning Windows Shell
