author: Tim Shelton (HAWK.IO)
category: process_creation
date: 2021/12/09
description: Detects a when net.exe is called with a password in the command line
detection:
  condition: all of selection* and not 1 of filter*
  filter:
    winlog.event_data.CommandLine|endswith: ' '
  selection1:
    winlog.event_data.Image: C:\Windows\System32\net.exe
  selection2:
    winlog.event_data.CommandLine|contains|all:
    - net
    - ' use '
    - :*\\
    - /USER:* *
falsepositives:
- Unknown
id: d4498716-1d52-438f-8084-4a603157d131
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- Internal Research
status: experimental
title: Password Provided In Command Line Of Net.exe
