author: Florian Roth
category: process_creation
date: 2022/08/26
description: Detects suspicious command line patterns as seen being used by MERCURY
  threat actor
detection:
  condition: all of selection*
  selection_base:
    winlog.event_data.CommandLine|contains|all:
    - -exec bypass -w 1 -enc
    - UwB0AGEAcgB0AC0ASgBvAGIAIAAtAFMAYwByAGkAcAB0AEIAbABvAGMAaw
falsepositives:
- Unknown
id: a62298a3-1fe0-422f-9a68-ffbcbc5a123d
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://www.microsoft.com/security/blog/2022/08/25/mercury-leveraging-log4j-2-vulnerabilities-in-unpatched-systems-to-target-israeli-organizations/
status: experimental
tags:
- attack.t1059.001
- attack.g0069
title: MERCURY Command Line Patterns
