author: frack113
category: process_creation
date: 2022/05/02
description: Detects the execution of the LOLBIN PrintBrm.exe, which can be used to
  create or extract ZIP files. PrintBrm.exe should not be run on a normal workstation.
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains|all:
    - ' -f'
    - .zip
    winlog.event_data.Image|endswith: \PrintBrm.exe
falsepositives:
- Unknown
id: cafeeba3-01da-4ab4-b6c4-a31b1d9730c7
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://lolbas-project.github.io/lolbas/Binaries/PrintBrm/
status: experimental
tags:
- attack.command_and_control
- attack.t1105
- attack.defense_evasion
- attack.t1564.004
title: PrintBrm ZIP Creation of Extraction
