author: Florian Roth
category: process_creation
date: 2017/04/07
description: Detects suspicious file execution by wscript and cscript
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains|all:
    - .vbs
    - /shell
    winlog.event_data.Image|endswith: \cscript.exe
falsepositives:
- Unlikely
fields:
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: 966e4016-627f-44f7-8341-f394905c361f
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
product: windows
references:
- https://www.pwc.co.uk/cyber-security/pdf/cloud-hopper-annex-b-final.pdf
status: test
tags:
- attack.execution
- attack.g0045
- attack.t1059.005
title: WMIExec VBS Script
