author: pH-T, Nasreddine Bencherchali
category: process_creation
date: 2022/03/15
description: Detects the creation of a schtask that executes a file from C:\Users\<USER>\AppData\Local
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.CommandLine|contains: /TN TVInstallRestore
    winlog.event_data.Image|endswith: \schtasks.exe
    winlog.event_data.ParentImage|contains|all:
    - \AppData\Local\Temp\
    - TeamViewer_.exe
  selection:
    winlog.event_data.CommandLine|contains:
    - NT AUT
    - ' SYSTEM '
    winlog.event_data.CommandLine|contains|all:
    - /Create
    - /RU
    - /TR
    - C:\Users\
    - \AppData\Local\
    winlog.event_data.Image|endswith: \schtasks.exe
falsepositives:
- Unknown
id: c5c00f49-b3f9-45a6-997e-cfdecc6e1967
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/07/28
product: windows
references:
- https://thedfirreport.com/2022/02/21/qbot-and-zerologon-lead-to-full-domain-compromise/
status: experimental
tags:
- attack.execution
- attack.persistence
- attack.t1053.005
- attack.t1059.001
title: Suspicious Schtasks Execution AppData Folder
