author: Florian Roth
category: process_creation
date: 2022/04/27
description: Detects the use of KrbRelay, a Kerberos relaying tool
detection:
  condition: 1 of selection*
  selection_flags1:
    winlog.event_data.CommandLine|contains|all:
    - ' -spn '
    - ' -clsid '
    - ' -rbcd '
  selection_flags2:
    winlog.event_data.CommandLine|contains|all:
    - shadowcred
    - clsid
    - spn
  selection_flags3:
    winlog.event_data.CommandLine|contains|all:
    - 'spn '
    - 'session '
    - 'clsid '
  selection_name:
    winlog.event_data.Image|endswith: \KrbRelay.exe
  selection_original_name:
    winlog.event_data.OriginalFileName: KrbRelay.exe
falsepositives:
- Unlikely
id: e96253b8-6b3b-4f90-9e59-3b24b99cf9b4
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://github.com/cube0x0/KrbRelay
status: experimental
tags:
- attack.credential_access
- attack.t1558.003
title: KrbRelay Hack Tool
