author: frack113
category: process_creation
date: 2021/11/07
description: ZipExec is a Proof-of-Concept (POC) tool to wrap binary-based tools into
  a password-protected zip file.
detection:
  condition: run or delete
  delete:
    winlog.event_data.CommandLine|contains|all:
    - /delete
    - Microsoft_Windows_Shell_ZipFolder:filename=
    - .zip
  run:
    winlog.event_data.CommandLine|contains|all:
    - /generic:Microsoft_Windows_Shell_ZipFolder:filename=
    - .zip
    - '/pass:'
    - '/user:'
falsepositives:
- Unknown
id: 90dcf730-1b71-4ae7-9ffc-6fcf62bd0132
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://twitter.com/SBousseaden/status/1451237393017839616
- https://github.com/Tylous/ZipExec
status: experimental
tags:
- attack.execution
- attack.defense_evasion
- attack.t1218
- attack.t1202
title: Suspicious ZipExec Execution
