author: frack113
category: process_creation
date: 2022/03/12
description: Adversaries may attempt to get a listing of other systems by IP address,
  hostname, or other logical identifier on a network that may be used for Lateral
  Movement from the current system
detection:
  condition: all of selection_*
  selection_loop:
    winlog.event_data.CommandLine|contains:
    - 'for '
    - 'foreach '
  selection_tools:
    winlog.event_data.CommandLine|contains:
    - nslookup
    - ping
falsepositives:
- Legitimate script
id: f8ad2e2c-40b6-4117-84d7-20b89896ab23
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1018/T1018.md
- https://ss64.com/nt/for.html
- https://ss64.com/ps/foreach-object.htmll
status: experimental
tags:
- attack.execution
- attack.t1059
- attack.discovery
- attack.t1018
title: Suspicious Scan Loop Network
