author: Nasreddine Bencherchali
category: process_creation
date: 2022/08/01
description: Detects when attackers use "sc.exe" to delete AV services from the system
  in order to avoid detection
detection:
  condition: all of selection*
  selection_av_process:
    winlog.event_data.CommandLine|contains:
    - AvgAdminServer
    - AVG Antivirus
    - MBEndpointAgent
    - MBAMService
    - MBCloudEA
    - avgAdminClient
    - SAVService
    - SAVAdminService
    - Sophos AutoUpdate Service
    - Sophos Clean Service
    - Sophos Device Control Service
    - Sophos File Scanner Service
    - Sophos Health Service
    - Sophos MCS Agent
    - Sophos MCS Client
    - SntpService
    - swc_service
    - swi_service
    - Sophos UI
    - swi_update
    - Sophos Web Control Service
    - Sophos System Protection Service
    - Sophos Safestore Service
    - hmpalertsvc
    - RpcEptMapper
    - Sophos Endpoint Defense Service
    - SophosFIM
    - swi_filter
    - FirebirdGuardianDefaultInstance
    - FirebirdServerDefaultInstance
    - WRSVC
    - ekrn
    - ekrnEpsw
    - klim6
    - AVP18.0.0
    - KLIF
    - klpd
    - klflt
    - klbackupdisk
    - klbackupflt
    - klkbdflt
    - klmouflt
    - klhk
    - KSDE1.0.0
    - kltap
    - ScSecSvc
    - Core Mail Protection
    - Core Scanning Server
    - Core Scanning ServerEx
    - Online Protection System
    - RepairService
    - Core Browsing Protection
    - Quick Update Service
    - McAfeeFramework
    - macmnsvc
    - masvc
    - mfemms
    - mfevtp
    - TmFilter
    - TMLWCSService
    - tmusa
    - TmPreFilter
    - TMSmartRelayService
    - TMiCRCScanService
    - VSApiNt
    - TmCCSF
    - tmlisten
    - TmProxy
    - ntrtscan
    - ofcservice
    - TmPfw
    - PccNTUpd
    - PandaAetherAgent
    - PSUAService
    - NanoServiceMain
    - EPIntegrationService
    - EPProtectedService
    - EPRedline
    - EPSecurityService
    - EPUpdateService
  selection_cli:
    winlog.event_data.CommandLine|contains: ' delete '
  selection_img:
  - winlog.event_data.Image|endswith: \sc.exe
  - winlog.event_data.OriginalFileName: sc.exe
falsepositives:
- Legitimate software deleting using the same method of deletion (Add it to a filter
  if you find cases as such)
id: 7fd4bb39-12d0-45ab-bb36-cebabc73dc7b
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://www.virustotal.com/gui/file/38283b775552da8981452941ea74191aa0d203edd3f61fb2dee7b0aea3514955
status: experimental
tags:
- attack.execution
- attack.defense_evasion
- attack.t1562.001
title: Suspicious Execution of Sc to Delete AV Services
