author: Markus Neis, Florian Roth
category: process_creation
date: 2019/01/16
description: Detects WMI SquiblyTwo Attack with possible renamed WMI by looking for
  imphash
detection:
  condition: selection_org or all of selection_renamed_*
  selection_org:
    winlog.event_data.CommandLine|contains|all:
    - wmic
    - format
    - http
    winlog.event_data.Image|endswith: \wmic.exe
  selection_renamed_flags:
    winlog.event_data.CommandLine|contains|all:
    - 'format:'
    - http
  selection_renamed_wmic_imphash:
  - winlog.event_data.Imphash:
    - 1B1A3F43BF37B5BFE60751F2EE2F326E
    - 37777A96245A3C74EB217308F3546F4C
    - 9D87C9D67CE724033C0B40CC4CA1B206
  - winlog.event_data.Hashes|contains:
    - IMPHASH=1B1A3F43BF37B5BFE60751F2EE2F326E
    - IMPHASH=37777A96245A3C74EB217308F3546F4C
    - IMPHASH=9D87C9D67CE724033C0B40CC4CA1B206
falsepositives:
- Unknown
id: 8d63dadf-b91b-4187-87b6-34a1114577ea
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/03/21
product: windows
references:
- https://subt0x11.blogspot.ch/2018/04/wmicexe-whitelisting-bypass-hacking.html
- https://twitter.com/mattifestation/status/986280382042595328
status: test
tags:
- attack.defense_evasion
- attack.t1047
- attack.t1220
- attack.execution
- attack.t1059.005
- attack.t1059.007
title: SquiblyTwo Execution
