author: frack113
category: process_creation
date: 2021/11/03
description: lolbas Cmdl32 is use to download a payload to evade antivirus
detection:
  condition: all of selection*
  selection_cli:
    winlog.event_data.CommandLine|contains|all:
    - '/vpn '
    - '/lan '
  selection_img:
  - winlog.event_data.Image|endswith: \cmdl32.exe
  - winlog.event_data.OriginalFileName: CMDL32.EXE
falsepositives:
- Unknown
id: f37aba28-a9e6-4045-882c-d5004043b337
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/06/12
product: windows
references:
- https://lolbas-project.github.io/lolbas/Binaries/Cmdl32/
- https://twitter.com/SwiftOnSecurity/status/1455897435063074824
status: experimental
tags:
- attack.execution
- attack.defense_evasion
- attack.t1218
- attack.t1202
title: Suspicious Cmdl32 Execution
