author: elhoim
category: process_creation
date: 2022/05/05
description: Detects "regsvr32.exe" spawning "explorer.exe", which is very uncommon.
detection:
  condition: selection
  selection:
    winlog.event_data.Image|endswith: \explorer.exe
    winlog.event_data.ParentImage|endswith: \regsvr32.exe
falsepositives:
- Unknown
id: 6f0947a4-1c5e-4e0d-8ac7-53159b8f23ca
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/07/28
product: windows
references:
- https://redcanary.com/blog/intelligence-insights-april-2022/
- https://www.echotrail.io/insights/search/regsvr32.exe
status: experimental
tags:
- attack.defense_evasion
- attack.t1218.010
title: Regsvr32 Spawning Explorer
