author: frack113
category: process_creation
date: 2022/02/16
description: Detects use of Wlrmdr.exe in which the -u parameter is passed to ShellExecute
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.ParentImage: C:\Windows\System32\winlogon.exe
  selection:
    winlog.event_data.CommandLine|contains|all:
    - '-s '
    - '-f '
    - '-t '
    - '-m '
    - '-a '
    - '-u '
    winlog.event_data.Image|endswith: \wlrmdr.exe
falsepositives:
- Unknown
id: 9cfc00b6-bfb7-49ce-9781-ef78503154bb
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/06/02
product: windows
references:
- https://twitter.com/0gtweet/status/1493963591745220608?s=20&t=xUg9DsZhJy1q9bPTUWgeIQ
status: experimental
tags:
- attack.defense_evasion
title: Wlrmdr Lolbin Use as Launcher
