author: Markus Neis, @Karneades
category: process_creation
date: 2018/03/06
description: Detects the creation of a schtask via PowerSploit or Empire Default Configuration.
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains:
    - ONLOGON
    - DAILY
    - ONIDLE
    - Updater
    winlog.event_data.CommandLine|contains|all:
    - /Create
    - /SC
    - /TN
    - Updater
    - /TR
    - powershell
    winlog.event_data.Image|endswith: \schtasks.exe
    winlog.event_data.ParentImage|endswith:
    - \powershell.exe
    - \pwsh.exe
falsepositives:
- False positives are possible, depends on organisation and processes
id: 56c217c3-2de2-479b-990f-5c109ba8458f
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/07/14
product: windows
references:
- https://github.com/0xdeadbeefJERKY/PowerSploit/blob/8690399ef70d2cad10213575ac67e8fa90ddf7c3/Persistence/Persistence.psm1
- https://github.com/EmpireProject/Empire/blob/08cbd274bef78243d7a8ed6443b8364acd1fc48b/lib/modules/powershell/persistence/userland/schtasks.py
status: test
tags:
- attack.execution
- attack.persistence
- attack.privilege_escalation
- attack.s0111
- attack.g0022
- attack.g0060
- car.2013-08-001
- attack.t1053.005
- attack.t1059.001
title: Default PowerSploit and Empire Schtasks Persistence
