author: frack113, Nasreddine Bencherchali
category: process_creation
date: 2022/08/07
description: Detect use of the Windows 8.3 short name. Which could be used as a method
  to avoid Image detection
detection:
  condition: selection and not filter
  filter:
  - winlog.event_data.ParentImage:
    - C:\Windows\System32\Dism.exe
    - C:\Windows\System32\cleanmgr.exe
  - winlog.event_data.ParentImage|endswith:
    - \WebEx\WebexHost.exe
    - \thor\thor64.exe
  - winlog.event_data.Product: InstallShield (R)
  - winlog.event_data.Description: InstallShield (R) Setup Engine
  - winlog.event_data.Company: InstallShield Software Corporation
  selection:
    winlog.event_data.Image|contains:
    - ~1\
    - ~2\
falsepositives:
- Applications could use this notation occasionally which might generate some false
  positives. In that case Investigate the parent and child process.
id: a96970af-f126-420d-90e1-d37bf25e50e1
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/08/22
product: windows
references:
- https://www.acunetix.com/blog/articles/windows-short-8-3-filenames-web-security-problem/
- https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-2000-server/cc959352(v=technet.10)?redirectedfrom=MSDN
- https://twitter.com/frack113/status/1555830623633375232
related:
- id: 349d891d-fef0-4fe4-bc53-eee623a15969
  type: similar
status: experimental
tags:
- attack.defense_evasion
- attack.t1564.004
title: Use Short Name Path in Image
