author: Markus Neis
category: process_creation
date: 2019/04/02
description: Detects EmpireMonkey APT reported Activity
detection:
  condition: 1 of selection*
  selection_cutil:
    winlog.event_data.CommandLine|endswith: /i:%APPDATA%\logs.txt scrobj.dll
    winlog.event_data.Image|endswith: \cutil.exe
  selection_regsvr32:
    winlog.event_data.CommandLine|endswith: /i:%APPDATA%\logs.txt scrobj.dll
    winlog.event_data.Description: Microsoft(C) Registerserver
falsepositives:
- Very Unlikely
id: 10152a7b-b566-438f-a33c-390b607d1c8d
level: critical
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
product: windows
references:
- https://app.any.run/tasks/a4107649-8cb0-41af-ad75-113152d4d57b
status: test
tags:
- attack.defense_evasion
- attack.t1218.010
title: Empire Monkey
