author: Florian Roth
category: process_creation
date: 2018/12/04
description: This method detects a suspicious PowerShell command line combination
  as used by APT29 in a campaign against U.S. think tanks.
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains|all:
    - -noni
    - -ep
    - bypass
    - $
falsepositives:
- Unknown
id: 033fe7d6-66d1-4240-ac6b-28908009c71f
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
product: windows
references:
- https://www.microsoft.com/security/blog/2018/12/03/analysis-of-cyberattack-on-u-s-think-tanks-non-profits-public-sector-by-unidentified-attackers/
- https://www.fireeye.com/blog/threat-research/2018/11/not-so-cozy-an-uncomfortable-examination-of-a-suspected-apt29-phishing-campaign.html
status: test
tags:
- attack.execution
- attack.g0016
- attack.t1059.001
title: APT29
