author: Florian Roth
category: process_creation
date: 2022/08/18
description: Detects the use of HandleKatz, a tool that demonstrates the usage of
  cloned handles to Lsass in order to create an obfuscated memory dump of the same
detection:
  condition: 1 of selection_loader_* or all of selection_flags*
  selection_flags_1:
    winlog.event_data.CommandLine|contains|all:
    - '--pid:'
    - '--outfile:'
  selection_flags_2:
    winlog.event_data.CommandLine|contains:
    - .dmp
    - lsass
    - .obf
    - dump
  selection_loader:
    winlog.event_data.CommandLine|contains: '--pid:'
    winlog.event_data.Image|endswith: \loader.exe
  selection_loader_imphash:
  - winlog.event_data.Imphash:
    - 38d9e015591bbfd4929e0d0f47fa0055
    - 0e2216679ca6e1094d63322e3412d650
  - winlog.event_data.Hashes:
    - IMPHASH=38D9E015591BBFD4929E0D0F47FA0055
    - IMPHASH=0E2216679CA6E1094D63322E3412D650
falsepositives:
- Unknown
id: ca621ba5-54ab-4035-9942-d378e6fcde3c
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://github.com/codewhitesec/HandleKatz
status: experimental
tags:
- attack.credential_access
- attack.t1003.001
title: HandleKatz LSASS Dumper Usage
