author: Florian Roth, Jonhnathan Ribeiro, oscd.community
category: process_creation
date: 2019/01/09
description: Detects a suspicious command line execution that invokes PowerShell with
  reference to an AppData folder
detection:
  condition: all of selection*
  selection1:
    winlog.event_data.CommandLine|contains:
    - powershell.exe
    - \powershell
    - \pwsh
    - pwsh.exe
  selection2:
    winlog.event_data.CommandLine|contains:
    - Local\
    - Roaming\
    winlog.event_data.CommandLine|contains|all:
    - '/c '
    - \AppData\
falsepositives:
- Administrative scripts
id: ac175779-025a-4f12-98b0-acdaeb77ea85
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/07/14
product: windows
references:
- https://twitter.com/JohnLaTwC/status/1082851155481288706
- https://app.any.run/tasks/f87f1c4e-47e2-4c46-9cf4-31454c06ce03
status: experimental
tags:
- attack.execution
- attack.t1059.001
title: PowerShell Script Run in AppData
