author: Cian Heasley, Florian Roth
category: process_creation
date: 2020/07/22
description: Detects processes spawned from web servers (php, tomcat, iis...etc) that
  perform reconnaissance looking for the existence of popular scripting tools (perl,
  python, wget) on the system via the help commands
detection:
  condition: 1 of selection* and recon
  recon:
    winlog.event_data.CommandLine|contains:
    - perl --help
    - python --help
    - python -h
    - python3 --help
    - python3 -h
    - wget --help
    - perl -h
  selection_webserver_characteristics_tomcat1:
    winlog.event_data.ParentImage|contains:
    - -tomcat-
    - \tomcat
    winlog.event_data.ParentImage|endswith:
    - \java.exe
    - \javaw.exe
  selection_webserver_characteristics_tomcat2:
    winlog.event_data.CommandLine|contains:
    - catalina.jar
    - CATALINA_HOME
    winlog.event_data.ParentImage|endswith:
    - \java.exe
    - \javaw.exe
  selection_webserver_image:
    winlog.event_data.ParentImage|endswith:
    - \w3wp.exe
    - \php-cgi.exe
    - \nginx.exe
    - \httpd.exe
    - \caddy.exe
    - \ws_tomcatservice.exe
falsepositives:
- Unknown
fields:
- winlog.event_data.Image
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: f64e5c19-879c-4bae-b471-6d84c8339677
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/07/27
product: windows
references:
- https://ragged-lab.blogspot.com/2020/07/webshells-automating-reconnaissance.html
status: test
tags:
- attack.persistence
- attack.t1505.003
title: Webshell Recon Detection Via CommandLine & Processes
