author: Bhabesh Raj
category: process_creation
date: 2022/03/04
description: Detects suspicious UltraVNC command line flag combination that indicate
  a auto reconnect upon execution, e.g. startup (as seen being used by Gamaredon threat
  group)
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains|all:
    - '-autoreconnect '
    - '-connect '
    - '-id:'
falsepositives:
- Unknown
id: 871b9555-69ca-4993-99d3-35a59f9f3599
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/03/09
product: windows
references:
- https://www.ria.ee/sites/default/files/content-editors/kuberturve/tale_of_gamaredon_infection.pdf
- https://unit42.paloaltonetworks.com/unit-42-title-gamaredon-group-toolset-evolution
status: experimental
tags:
- attack.lateral_movement
- attack.g0047
- attack.t1021.005
title: Suspicious UltraVNC Execution
