author: Oleg Kolesnikov @securonix invrep_de, oscd.community, Florian Roth, Christian
  Burkard
category: process_creation
date: 2020/10/23
description: Detects attackers using tooling with bad opsec defaults e.g. spawning
  a sacrificial process to inject a capability into the process without taking into
  account how the process is normally run, one trivial example of this is using rundll32.exe
  without arguments as a sacrificial process (default in CS, now highlighted by c2lint),
  running WerFault without arguments (Kraken - credit am0nsec), and other examples.
detection:
  condition: 1 of selection*
  selection1:
    winlog.event_data.CommandLine|endswith: WerFault.exe
    winlog.event_data.Image|endswith: \WerFault.exe
  selection2:
    winlog.event_data.CommandLine|endswith: rundll32.exe
    winlog.event_data.Image|endswith: \rundll32.exe
  selection3:
    winlog.event_data.CommandLine|endswith: regsvcs.exe
    winlog.event_data.Image|endswith: \regsvcs.exe
  selection4:
    winlog.event_data.CommandLine|endswith: regasm.exe
    winlog.event_data.Image|endswith: \regasm.exe
  selection5:
    winlog.event_data.CommandLine|endswith: regsvr32.exe
    winlog.event_data.Image|endswith: \regsvr32.exe
falsepositives:
- Unlikely
fields:
- winlog.event_data.ParentImage
- winlog.event_data.ParentCommandLine
id: a7c3d773-caef-227e-a7e7-c2f13c622329
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/09/07
product: windows
references:
- https://blog.malwarebytes.com/malwarebytes-news/2020/10/kraken-attack-abuses-wer-service/
- https://www.cobaltstrike.com/help-opsec
- https://twitter.com/CyberRaiju/status/1251492025678983169
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/regsvr32
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/rundll32
- https://docs.microsoft.com/en-us/dotnet/framework/tools/regasm-exe-assembly-registration-tool
- https://docs.microsoft.com/en-us/dotnet/framework/tools/regsvcs-exe-net-services-installation-tool#feedback
related:
- id: f5647edc-a7bf-4737-ab50-ef8c60dc3add
  type: obsoletes
status: experimental
tags:
- attack.defense_evasion
- attack.t1218.011
title: Bad Opsec Defaults Sacrificial Processes With Improper Arguments
