author: Florian Roth
category: process_creation
date: 2022/03/24
description: Detects suspicious ways to run Invoke-Execution using IEX acronym
detection:
  condition: all of selection_combined* or selection_standalone
  selection_combined_1:
    winlog.event_data.CommandLine|contains: -' | iex;' -' | iex ' -' | iex}' -' |
      IEX;' -' | IEX ;' -' | IEX -Error' -' | IEX (new' -' | IEX (New' -');IEX '
    winlog.event_data.Image|endswith:
    - \powershell.exe
    - \pwsh.exe
  selection_combined_2:
    winlog.event_data.CommandLine|contains:
    - ::FromBase64String
    - '.GetString([System.Convert]::'
  selection_standalone:
    winlog.event_data.CommandLine|contains: -')|iex;$' -')|IEX;$' -');iex($' -');iex
      $' -' | IEX | '
falsepositives:
- Legitimate scripts that use IEX
id: 09576804-7a05-458e-a817-eb718ca91f54
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/03/28
product: windows
references:
- https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.utility/invoke-expression?view=powershell-7.2
status: experimental
title: Suspicious PowerShell IEX Execution Patterns
