author: Teymur Kheirkhabarov (idea), Mangatas Tondang (rule), oscd.community
category: process_creation
date: 2020/10/13
description: This rule will looks for Windows Installer service (msiexec.exe) spawned
  command line and/or powershell
detection:
  condition: image and parent_image
  image:
    winlog.event_data.Image|endswith:
    - \cmd.exe
    - \powershell.exe
  parent_image:
    winlog.event_data.ParentImage|contains|all:
    - \Windows\Installer\
    - msi
    winlog.event_data.ParentImage|endswith:
    - tmp
falsepositives:
- Penetration test
fields:
- winlog.event_data.Image
- winlog.event_data.ParentImage
id: 1e53dd56-8d83-4eb4-a43e-b790a05510aa
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://image.slidesharecdn.com/kheirkhabarovoffzonefinal-181117201458/95/hunting-for-privilege-escalation-in-windows-environment-50-638.jpg
status: experimental
tags:
- attack.privilege_escalation
- attack.t1548.002
title: Always Install Elevated MSI Spawned Cmd And Powershell
