author: '@caliskanfurkan_'
category: process_creation
date: 2020/06/04
description: Detecting DNS tunnel activity for Muddywater actor
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains:
    - DataExchange.dll
    winlog.event_data.Image|endswith:
    - \powershell.exe
    winlog.event_data.ParentImage|endswith:
    - \excel.exe
falsepositives:
- Unknown
id: 36222790-0d43-4fe8-86e4-674b27809543
level: critical
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://www.virustotal.com/gui/file/5ad401c3a568bd87dd13f8a9ddc4e450ece61cd9ce4d1b23f68ce0b1f3c190b7/
- https://www.vmray.com/analyses/5ad401c3a568/report/overview.html
status: experimental
tags:
- attack.command_and_control
- attack.t1071.004
title: DNS Tunnel Technique from MuddyWater
