author: Teymur Kheirkhabarov (idea), Mangatas Tondang (rule), oscd.community
category: process_creation
date: 2020/10/13
description: Accesschk is an access and privilege audit tool developed by SysInternal
  and often being used by attacker to verify if a privilege escalation process successful
  or not
detection:
  condition: integrity_level and (product or description)
  description:
    winlog.event_data.Description|contains: Reports effective permissions
  integrity_level:
    winlog.event_data.IntegrityLevel: Medium
  product:
    winlog.event_data.Product|endswith: AccessChk
falsepositives:
- System administrator Usage
- Penetration test
fields:
- winlog.event_data.IntegrityLevel
- winlog.event_data.Product
- winlog.event_data.Description
id: c625d754-6a3d-4f65-9c9a-536aea960d37
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://image.slidesharecdn.com/kheirkhabarovoffzonefinal-181117201458/95/hunting-for-privilege-escalation-in-windows-environment-43-638.jpg
status: experimental
tags:
- attack.discovery
- attack.t1069.001
title: Accesschk Usage After Privilege Escalation
