author: Nik Seetharaman
category: process_creation
date: 2018/07/16
description: Detects various indicators of Microsoft Connection Manager Profile Installer
  execution
detection:
  condition: selection
  selection:
    winlog.event_data.ParentImage|endswith: \cmstp.exe
falsepositives:
- Legitimate CMSTP use (unlikely in modern enterprise environments)
fields:
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
- winlog.event_data.Details
id: 7d4cdc5a-0076-40ca-aac8-f7e714570e47
level: high
logsource:
  category: process_creation
  product: windows
modified: 2020/12/23
product: windows
references:
- https://web.archive.org/web/20190720093911/http://www.endurant.io/cmstp/detecting-cmstp-enabled-code-execution-and-uac-bypass-with-sysmon/
status: stable
tags:
- attack.defense_evasion
- attack.execution
- attack.t1218.003
- attack.g0069
- car.2019-04-001
title: CMSTP Execution Process Creation
