author: frack113
category: process_creation
date: 2021/07/07
description: Adversaries may disable security tools to avoid possible detection of
  their tools and activities by stopping antivirus service
detection:
  condition: all of them
  selection_action:
    winlog.event_data.CommandLine|contains:
    - 'Stop-Service '
    - 'Remove-Service '
  selection_product:
    winlog.event_data.CommandLine|contains:
    - ' McAfeeDLPAgentService'
    - ' Trend Micro Deep Security Manager'
    - ' TMBMServer'
falsepositives:
- Unknown
fields:
- winlog.ComputerName
- winlog.event_data.User
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: 6783aa9e-0dc3-49d4-a94a-8b39c5fd700b
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1562.001/T1562.001.md
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001
title: Stop Or Remove Antivirus Service
