author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
category: process_creation
date: 2020/05/02
description: A General detection for svchost.exe spawning rundll32.exe with command
  arguments like C:\windows\system32\davclnt.dll,DavSetCookie. This could be an indicator
  of exfiltration or use of WebDav to launch code (hosted on WebDav Server).
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains: C:\windows\system32\davclnt.dll,DavSetCookie
    winlog.event_data.Image|endswith: \rundll32.exe
falsepositives:
- unknown
id: 2dbd9d3d-9e27-42a8-b8df-f13825c6c3d5
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://github.com/OTRF/detection-hackathon-apt29/issues/17
- https://threathunterplaybook.com/evals/apt29/detections/7.B.4_C10730EA-6345-4934-AA0F-B0EFCA0C4BA6.html
status: experimental
tags:
- attack.exfiltration
- attack.t1048.003
title: Suspicious WebDav Client Execution
