author: frack113
category: process_creation
date: 2021/07/12
description: Injects arbitrary DLL into running process specified by process ID. Requires
  Windows 10.
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains|all:
    - ' /INJECTRUNNING'
    - .dll
    winlog.event_data.OriginalFileName|contains: mavinject
falsepositives:
- Unknown
fields:
- winlog.ComputerName
- winlog.event_data.User
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: 4f73421b-5a0b-4bbf-a892-5a7fb99bea66
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1218/T1218.md
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1056.004/T1056.004.md
status: experimental
tags:
- attack.defense_evasion
- attack.collection
- attack.t1218
- attack.t1056.004
title: Mavinject Inject DLL Into Running Process
