author: E.M. Anhaus (originally from Atomic Blue Detections, Endgame), oscd.community
category: process_creation
date: 2019/10/24
description: Detect indirect command execution via Program Compatibility Assistant
  (pcalua.exe or forfiles.exe).
detection:
  condition: selection
  selection:
    winlog.event_data.ParentImage|endswith:
    - \pcalua.exe
    - \forfiles.exe
falsepositives:
- Need to use extra processing with 'unique_count' / 'filter' to focus on outliers
  as opposed to commonly seen artifacts.
- Legitimate usage of scripts.
fields:
- winlog.ComputerName
- winlog.event_data.User
- winlog.event_data.ParentCommandLine
- winlog.event_data.CommandLine
id: fa47597e-90e9-41cd-ab72-c3b74cfb0d02
level: low
logsource:
  category: process_creation
  product: windows
modified: 2019/11/11
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1202/T1202.md
- https://eqllib.readthedocs.io/en/latest/analytics/884a7ccd-7305-4130-82d0-d4f90bc118b6.html
status: experimental
tags:
- attack.defense_evasion
- attack.t1202
title: Indirect Command Execution
