author: Kirill Kiryanov, Beyu Denis, Daniil Yugoslavskiy, oscd.community
category: process_creation
date: 2019/10/25
description: Detects defence evasion attempt via odbcconf.exe execution to load DLL
detection:
  condition: selection_1 or selection_2
  selection_1:
    winlog.event_data.CommandLine|contains:
    - -f
    - regsvr
    winlog.event_data.Image|endswith: \odbcconf.exe
  selection_2:
    winlog.event_data.Image|endswith: \rundll32.exe
    winlog.event_data.ParentImage|endswith: \odbcconf.exe
falsepositives:
- Legitimate use of odbcconf.exe by legitimate user
id: 65d2be45-8600-4042-b4c0-577a1ff8a60e
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2019/11/07
product: windows
references:
- https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OSBinaries/Odbcconf.yml
- https://twitter.com/Hexacorn/status/1187143326673330176
status: experimental
tags:
- attack.defense_evasion
- attack.t1218.008
title: Application Whitelisting Bypass via DLL Loaded by odbcconf.exe
