author: E.M. Anhaus (originally from Atomic Blue Detections, Tony Lambert), oscd.community,
  omkar72
category: process_creation
date: 2019/10/24
description: Identifies execution of nltest.exe and dsquery.exe for domain trust discovery.
  This technique is used by attackers to enumerate Active Directory trusts.
detection:
  condition: 1 of them
  selection_dsquery_v1:
    winlog.event_data.CommandLine|contains: trustedDomain
    winlog.event_data.Image|endswith: \dsquery.exe
  selection_dsquery_v2:
    winlog.event_data.CommandLine|contains|all:
    - -filter
    - trustedDomain
    winlog.event_data.Image|endswith: \dsquery.exe
  selection_nltest_v1:
    winlog.event_data.CommandLine|contains:
    - domain_trusts
    - all_trusts
    - /trusted_domains
    - /dclist
    winlog.event_data.Image|endswith: \nltest.exe
falsepositives:
- Legitimate use of the utilities by legitimate user for legitimate reason
id: 3bad990e-4848-4a78-9530-b427d854aac0
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2021/07/09
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1482/T1482.md
- https://eqllib.readthedocs.io/en/latest/analytics/03e231a6-74bc-467a-acb1-e5676b0fb55e.html
- https://thedfirreport.com/2020/10/18/ryuk-in-5-hours/
- https://redcanary.com/blog/how-one-hospital-thwarted-a-ryuk-ransomware-outbreak/
- https://www.harmj0y.net/blog/redteaming/a-guide-to-attacking-domain-trusts/
related:
- id: 77815820-246c-47b8-9741-e0def3f57308
  type: obsoletes
status: experimental
tags:
- attack.discovery
- attack.t1482
title: Domain Trust Discovery
