author: Michael Haag
category: process_creation
date: 2019/01/16
description: Detects suspicious file execution by wscript and cscript
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains:
    - .jse
    - .vbe
    - .js
    - .vba
    winlog.event_data.Image|endswith:
    - \wscript.exe
    - \cscript.exe
falsepositives:
- Will need to be tuned. I recommend adding the user profile path in CommandLine if
  it is getting too noisy.
fields:
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: 1e33157c-53b1-41ad-bbcc-780b80b58288
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2020/08/28
product: windows
status: experimental
tags:
- attack.execution
- attack.t1059.005
- attack.t1059.007
title: WSF/JSE/JS/VBA/VBE File Execution
