author: juju4
category: process_creation
date: 2019/01/16
description: Detects execution of executables that can be used to bypass Applocker
  whitelisting
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains:
    - \msdt.exe
    - \installutil.exe
    - \regsvcs.exe
    - \regasm.exe
    - \msbuild.exe
    - \ieexec.exe
falsepositives:
- False positives depend on scripts and administrative tools used in the monitored
  environment
- Using installutil to add features for .NET applications (primarily would occur in
  developer environments)
id: 82a19e3a-2bfe-4a91-8c0d-5d4c98fbb719
level: low
logsource:
  category: process_creation
  product: windows
modified: 2020/09/01
product: windows
references:
- https://github.com/subTee/ApplicationWhitelistBypassTechniques/blob/master/TheList.txt
- https://room362.com/post/2014/2014-01-16-application-whitelist-bypass-using-ieexec-dot-exe/
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1127.001/T1127.001.md
status: experimental
tags:
- attack.defense_evasion
- attack.t1218.004
- attack.t1218.009
- attack.t1127.001
- attack.t1218.005
- attack.t1218
title: Possible Applocker Bypass
