author: Beyu Denis, oscd.community
category: process_creation
date: 2019/10/26
description: Launch 64-bit shellcode from a debugger script file using cdb.exe.
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains: -cf
    winlog.event_data.Image|endswith: \cdb.exe
falsepositives:
- Legitimate use of debugging tools
id: b5c7395f-e501-4a08-94d4-57fe7a9da9d2
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2020/09/05
product: windows
references:
- https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OtherMSBinaries/Cdb.yml
- http://www.exploit-monday.com/2016/08/windbg-cdb-shellcode-runner.html
status: experimental
tags:
- attack.execution
- attack.t1106
- attack.defense_evasion
- attack.t1218
- attack.t1127
title: Possible App Whitelisting Bypass via WinDbg/CDB as a Shellcode Runner
