author: omkar72 - https://www.fireeye.com/blog/threat-research/2020/10/kegtap-and-singlemalt-with-a-ransomware-chaser.html
category: process_creation
date: 2020/10/30
description: Detect ed user accept agreement execution in psexec commandline
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains: accepteula
    winlog.event_data.Image|endswith: \psexec.exe
falsepositives:
- Administrative scripts.
fields:
- winlog.ComputerName
- winlog.event_data.User
- winlog.event_data.CommandLine
id: 730fc21b-eaff-474b-ad23-90fd265d4988
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
status: experimental
tags:
- attack.execution
- attack.t1569
- attack.t1021
title: Psexec Accepteula Condition
