author: Florian Roth
category: process_creation
date: 2021/06/28
description: Detects a suspicious child process of a mshta.exe process
detection:
  condition: selection
  selection:
    winlog.event_data.Image|endswith:
    - \powershell.exe
    - \cmd.exe
    - \WScript.exe
    winlog.event_data.ParentImage|endswith: \mshta.exe
falsepositives:
- Unknown
fields:
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: 772bb24c-8df2-4be0-9157-ae4dfa794037
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://app.any.run/tasks/f0fac90f-84ac-4faa-b5b2-f4353c388969/#
- https://app.any.run/tasks/9c0f37bc-867a-4314-b685-e101566766d7/
status: experimental
tags:
- attack.execution
- attack.defense_evasion
- attack.t1059.005
- attack.t1059.001
- attack.t1218
title: Mshta Spawning Windows Shell
