author: Florian Roth
category: process_creation
date: 2019/11/14
description: Detects suspicious msiexec process starts in an uncommon directory
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.Image|startswith:
    - C:\Windows\System32\
    - C:\Windows\SysWOW64\
    - C:\Windows\WinSxS\
  selection:
    winlog.event_data.Image|endswith: \msiexec.exe
falsepositives:
- Unknown
id: e22a6eb2-f8a5-44b5-8b44-a2dbd47b1144
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://twitter.com/200_okay_/status/1194765831911215104
status: experimental
tags:
- attack.defense_evasion
- attack.t1036.005
title: Suspicious MsiExec Directory
