author: Christian Burkard
category: process_creation
date: 2021/08/30
description: Detects the pattern of UAC Bypass using a path parsing issue in winsat.exe
  (UACMe 52)
detection:
  condition: selection
  selection:
    winlog.event_data.IntegrityLevel:
    - High
    - System
    winlog.event_data.ParentCommandLine|contains: C:\Windows \system32\winsat.exe
    winlog.event_data.ParentImage|endswith: \AppData\Local\Temp\system32\winsat.exe
falsepositives:
- Unknown
id: 7a01183d-71a2-46ad-ad5c-acd989ac1793
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://github.com/hfiref0x/UACME
status: experimental
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1548.002
title: UAC Bypass Abusing Winsat Path Parsing - Process
