author: Florian Roth, Jonhnathan Ribeiro, oscd.community
category: process_creation
date: 2018/03/01
description: Detects Trojan loader acitivty as used by APT28
detection:
  condition: selection1 and selection2
  selection1:
    winlog.event_data.CommandLine|contains|all:
    - rundll32.exe
    - '%APPDATA%\'
  selection2:
  - winlog.event_data.CommandLine|contains: .dat",
  - winlog.event_data.CommandLine|endswith: .dll",#1
falsepositives:
- Unknown
id: ba778144-5e3d-40cf-8af9-e28fb1df1e20
level: critical
logsource:
  category: process_creation
  product: windows
modified: 2020/11/28
product: windows
references:
- https://researchcenter.paloaltonetworks.com/2018/02/unit42-sofacy-attacks-multiple-government-entities/
- https://www.reverse.it/sample/e3399d4802f9e6d6d539e3ae57e7ea9a54610a7c4155a6541df8e94d67af086e?environmentId=100
- https://twitter.com/ClearskySec/status/960924755355369472
status: experimental
tags:
- attack.g0007
- attack.execution
- attack.t1059.003
- attack.defense_evasion
- car.2013-10-002
- attack.t1218.011
title: Sofacy Trojan Loader Activity
