author: "Ensar \u015Eamil, @sblmsrsn, @oscd_initiative"
category: process_creation
date: 2020/10/07
description: Detects successful code compilation via Visual Basic Command Line Compiler
  that utilizes Windows Resource to Object Converter.
detection:
  condition: selection
  selection:
    winlog.event_data.Image|endswith: \cvtres.exe
    winlog.event_data.ParentImage|endswith: \vbc.exe
falsepositives:
- Utilization of this tool should not be seen in enterprise environment
id: 7b10f171-7f04-47c7-9fa2-5be43c76e535
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://lolbas-project.github.io/lolbas/Binaries/Vbc/
status: experimental
tags:
- attack.defense_evasion
- attack.t1027.004
title: Visual Basic Command Line Compiler Usage
