author: Florian Roth
category: process_creation
date: 2020/07/03
description: Detects a suspicious curl process start the adds a file to a web request
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains: ' -F '
    winlog.event_data.Image|endswith: \curl.exe
falsepositives:
- Scripts created by developers and admins
fields:
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: 00bca14a-df4e-4649-9054-3f2aa676bc04
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2020/09/05
product: windows
references:
- https://twitter.com/d1r4c/status/1279042657508081664
- https://medium.com/@petehouston/upload-files-with-curl-93064dcccc76
status: experimental
tags:
- attack.exfiltration
- attack.t1567
title: Suspicious Curl File Upload
