author: Florian Roth
category: process_creation
date: 2019/01/16
description: Detects a JAVA process running with remote debugging allowing more than
  just localhost to connect
detection:
  condition: selection and not exclusion
  exclusion:
  - winlog.event_data.CommandLine|contains: address=127.0.0.1
  - winlog.event_data.CommandLine|contains: address=localhost
  selection:
    winlog.event_data.CommandLine|contains: transport=dt_socket,address=
falsepositives:
- unknown
fields:
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: 8f88e3f6-2a49-48f5-a5c4-2f7eedf78710
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2020/08/29
product: windows
tags:
- attack.t1203
- attack.execution
title: Java Running with Remote Debugging
