author: Florian Roth
category: process_creation
date: 2018/03/13
description: Detects a PsExec service start
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine: C:\Windows\PSEXESVC.exe
falsepositives:
- Administrative activity
id: 3ede524d-21cc-472d-a3ce-d21b568d8db7
level: low
logsource:
  category: process_creation
  product: windows
modified: 2012/12/11
product: windows
tags:
- attack.execution
- attack.s0029
- attack.t1569.002
title: PsExec Service Start
