author: Florian Roth
category: process_creation
date: 2019/01/16
description: Detects the creation of scheduled tasks in user session
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.User|startswith:
    - NT AUTHORITY\SYSTEM
    - AUTORITE NT\Sys
  selection:
    winlog.event_data.CommandLine|contains: ' /create '
    winlog.event_data.Image|endswith: \schtasks.exe
falsepositives:
- Administrative activity
- Software installation
fields:
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: 92626ddd-662c-49e3-ac59-f6535f12d189
level: low
logsource:
  category: process_creation
  product: windows
modified: 2021/08/26
product: windows
status: experimental
tags:
- attack.execution
- attack.persistence
- attack.privilege_escalation
- attack.t1053.005
- attack.s0111
- car.2013-08-001
title: Scheduled Task Creation
