author: Florian Roth
category: process_creation
date: 2019/08/24
description: Detects a base64 encoded FromBase64String keyword in a process command
  line
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|base64offset|contains: ::FromBase64String
falsepositives:
- unknown
fields:
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: fdb62a13-9a81-4e5c-a38f-ea93a16f6d7c
level: critical
logsource:
  category: process_creation
  product: windows
product: windows
status: experimental
tags:
- attack.defense_evasion
- attack.t1140
- attack.execution
- attack.t1059.001
title: Encoded FromBase64String
