author: Florian Roth, Max Altgelt
category: process_creation
date: 2021/07/14
description: Detects a suspicious script executions from temporary folder
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.CommandLine|contains:
    - ' >'
    - Out-File
    - ConvertTo-Json
  selection:
    winlog.event_data.CommandLine|contains:
    - \Windows\Temp
    - \Temporary Internet
    - \AppData\Local\Temp
    - \AppData\Roaming\Temp
    - '%TEMP%'
    - '%TMP%'
    - '%LocalAppData%\Temp'
    winlog.event_data.Image|endswith:
    - \powershell.exe
    - \mshta.exe
    - \wscript.exe
    - \cscript.exe
falsepositives:
- Administrative scripts
id: a6a39bdb-935c-4f0a-ab77-35f4bbf44d33
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/08/10
product: windows
references:
- https://www.microsoft.com/security/blog/2021/07/13/microsoft-discovers-threat-actor-targeting-solarwinds-serv-u-software-with-0-day-exploit/
status: experimental
tags:
- attack.execution
title: Suspicious Script Execution From Temp Folder
