author: Florian Roth, oscd.community
category: process_creation
date: 2020/07/30
description: Detects specific process characteristics of Winnti Pipemon malware reported
  by ESET
detection:
  condition: 1 of them
  selection1:
    winlog.event_data.CommandLine|contains:
    - setup0.exe -p
  selection2:
    winlog.event_data.CommandLine|contains|all:
    - setup.exe
    winlog.event_data.CommandLine|endswith:
    - -x:0
    - -x:1
    - -x:2
falsepositives:
- Legitimate setups that use similar flags
id: 73d70463-75c9-4258-92c6-17500fe972f2
level: critical
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://www.welivesecurity.com/2020/05/21/no-game-over-winnti-group/
status: experimental
tags:
- attack.defense_evasion
- attack.t1574.002
- attack.g0044
title: Winnti Pipemon Characteristics
