author: Oddvar Moe, Sander Wiebing, oscd.community
category: process_creation
date: 2020/10/07
description: Detects the import of the specified file to the registry with regedit.exe.
detection:
  condition: selection and not filter and not filter_2
  filter:
    winlog.event_data.CommandLine|contains:
    - ' /e '
    - ' /a '
    - ' /c '
  filter_2:
    winlog.event_data.CommandLine|re: :[^ \\\\]
  selection:
    winlog.event_data.CommandLine|contains:
    - ' /i '
    - .reg
    winlog.event_data.Image|endswith: \regedit.exe
falsepositives:
- Legitimate import of keys
fields:
- winlog.event_data.ParentImage
- winlog.event_data.CommandLine
id: 73bba97f-a82d-42ce-b315-9182e76c57b1
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OSBinaries/Regedit.yml
- https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f
status: experimental
tags:
- attack.t1112
- attack.defense_evasion
title: Imports Registry Key From a File
