author: Alexander Rausch
category: process_creation
date: 2020/06/24
description: Detects actions caused by the RedMimicry Winnti playbook
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains:
    - gthread-3.6.dll
    - \Windows\Temp\tmp.bat
    - sigcmm-2.4.dll
    winlog.event_data.Image|contains:
    - rundll32.exe
    - cmd.exe
falsepositives:
- Unknown
id: 95022b85-ff2a-49fa-939a-d7b8f56eeb9b
level: high
logsource:
  category: process_creation
  product: windows
modified: 2020/09/06
product: windows
references:
- https://redmimicry.com
tags:
- attack.execution
- attack.defense_evasion
- attack.t1106
- attack.t1059.003
- attack.t1218.011
title: RedMimicry Winnti Playbook Execute
