author: Florian Roth
category: process_creation
date: 2019/08/23
description: Detects a base64 encoded IEX command string in a process command line
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|base64offset|contains:
    - IEX ([
    - iex ([
    - iex (New
    - IEX (New
falsepositives:
- unknown
fields:
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: 88f680b8-070e-402c-ae11-d2914f2257f1
level: critical
logsource:
  category: process_creation
  product: windows
modified: 2020/08/29
product: windows
status: experimental
tags:
- attack.execution
- attack.t1059.001
title: Encoded IEX
