author: Roberto Rodriguez @Cyb3rWard0g
category: process_creation
date: 2019/08/15
description: Detects wmiprvse spawning processes
detection:
  condition: selection and not filter and not filter_null1 and not filter_null2
  filter:
  - winlog.event_data.LogonId:
    - '0x3e7'
    - 'null'
  - winlog.event_data.SubjectLogonId:
    - '0x3e7'
    - 'null'
  - winlog.event_data.User|startswith:
    - NT AUTHORITY\SYSTEM
    - AUTORITE NT\Sys
  - winlog.event_data.Image|endswith:
    - \WmiPrvSE.exe
    - \WerFault.exe
  filter_null1:
    winlog.event_data.LogonId: null
  filter_null2:
    winlog.event_data.SubjectLogonId: null
  selection:
    winlog.event_data.ParentImage|endswith: \WmiPrvSe.exe
falsepositives:
- Unknown
id: d21374ff-f574-44a7-9998-4a8c8bf33d7d
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/08/26
product: windows
references:
- https://threathunterplaybook.com/notebooks/windows/02_execution/WIN-190810201010.html
status: experimental
tags:
- attack.execution
- attack.t1047
title: Wmiprvse Spawning Process
