author: Victor Sergeev, oscd.community
category: process_creation
date: 2020/10/09
description: Detects when GfxDownloadWrapper.exe downloads file from non standard
  URL
detection:
  cmd_known_url:
    winlog.event_data.CommandLine|contains: gameplayapi.intel.com
  condition: image_path and not cmd_known_url and not same_parent
  image_path:
    winlog.event_data.Image|endswith: \GfxDownloadWrapper.exe
  same_parent:
    winlog.event_data.ParentImage|endswith: \GfxDownloadWrapper.exe
falsepositives:
- Unknown
fields:
- winlog.event_data.CommandLine
id: eee00933-a761-4cd0-be70-c42fe91731e7
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OSBinaries/GfxDownloadWrapper.yml
status: experimental
tags:
- attack.command_and_control
- attack.t1105
title: GfxDownloadWrapper.exe Downloads File from Suspicious URL
