author: Maxim Pavlunin
category: process_creation
date: 2020/04/01
description: Detects a suspicious child process of a Microsoft HTML Help system when
  executing compiled HTML files (.chm)
detection:
  condition: selection
  selection:
    winlog.event_data.Image|endswith:
    - \cmd.exe
    - \powershell.exe
    - \wscript.exe
    - \cscript.exe
    - \regsvr32.exe
    - \wmic.exe
    - \rundll32.exe
    winlog.event_data.ParentImage: C:\Windows\hh.exe
falsepositives:
- unknown
fields:
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: 52cad028-0ff0-4854-8f67-d25dfcbc78b4
level: high
logsource:
  category: process_creation
  product: windows
modified: 2020/09/01
product: windows
references:
- https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/chm-badness-delivers-a-banking-trojan/
status: experimental
tags:
- attack.defense_evasion
- attack.t1218.001
- attack.t1218.010
- attack.t1218.011
- attack.execution
- attack.t1059.001
- attack.t1059.003
- attack.t1059.005
- attack.t1059.007
- attack.t1047
title: HTML Help Shell Spawn
