author: Victor Sergeev, oscd.community
category: process_creation
date: 2019/10/21
description: Detects service path modification to PowerShell or cmd.
detection:
  condition: selection_1 and selection_2
  selection_1:
    winlog.event_data.CommandLine|contains|all:
    - config
    - binpath
    winlog.event_data.Image|endswith: \sc.exe
  selection_2:
    winlog.event_data.CommandLine|contains:
    - powershell
    - cmd
falsepositives:
- Unknown
fields:
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: 138d3531-8793-4f50-a2cd-f291b2863d78
level: high
logsource:
  category: process_creation
  product: windows
modified: 2020/08/28
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1543.003/T1543.003.md
status: experimental
tags:
- attack.persistence
- attack.privilege_escalation
- attack.t1543.003
title: Suspicious Service Path Modification
