author: Roberto Rodriguez @Cyb3rWard0g
category: process_creation
date: 2019/09/12
description: Detects remote PowerShell sections by monitoring for wsmprovhost (WinRM
  host process) as a parent or child process (sign of an active PowerShell remote
  session).
detection:
  condition: selection
  selection:
  - winlog.event_data.Image|endswith: \wsmprovhost.exe
  - winlog.event_data.ParentImage|endswith: \wsmprovhost.exe
falsepositives:
- Legitimate usage of remote Powershell, e.g. for monitoring purposes.
fields:
- winlog.ComputerName
- winlog.event_data.User
- winlog.event_data.CommandLine
id: 734f8d9b-42b8-41b2-bcf5-abaf49d5a3c8
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2021/05/21
product: windows
references:
- https://threathunterplaybook.com/notebooks/windows/02_execution/WIN-190511223310.html
status: experimental
tags:
- attack.execution
- attack.t1059.001
- attack.t1021.006
title: Remote PowerShell Session Host Process (WinRM)
