author: Florian Roth
category: process_creation
date: 2020/07/03
description: Detects a suspicious Microsoft desktopimgdownldr execution with parameters
  used to download files from the Internet
detection:
  condition: ( selection1 and not selection1_filter ) or selection_reg
  selection1:
    winlog.event_data.CommandLine|contains: ' /lockscreenurl:'
  selection1_filter:
    winlog.event_data.CommandLine|contains:
    - .jpg
    - .jpeg
    - .png
  selection_reg:
    winlog.event_data.CommandLine|contains|all:
    - reg delete
    - \PersonalizationCSP
falsepositives:
- False positives depend on scripts and administrative tools used in the monitored
  environment
fields:
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: bb58aa4a-b80b-415a-a2c0-2f65a4c81009
level: high
logsource:
  category: process_creation
  product: windows
modified: 2020/08/30
product: windows
references:
- https://labs.sentinelone.com/living-off-windows-land-a-new-native-file-downldr/
- https://twitter.com/SBousseaden/status/1278977301745741825
status: experimental
tags:
- attack.command_and_control
- attack.t1105
title: Suspicious Desktopimgdownldr Command
