author: Victor Sergeev, oscd.community
category: process_creation
date: 2020/10/09
description: Detects Winword.exe loading of custmom dll via /l cmd switch
detection:
  cmd:
    winlog.event_data.CommandLine|contains: /l
  condition: image_path and cmd
  image_path:
    winlog.event_data.Image|endswith: \winword.exe
falsepositives:
- Unknown
fields:
- winlog.event_data.CommandLine
id: 2621b3a6-3840-4810-ac14-a02426086171
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/LOLUtilz/OtherMSBinaries/Winword.yml
status: experimental
tags:
- attack.defense_evasion
- attack.t1202
title: Winword.exe Loads Suspicious DLL
