author: Florian Roth, oscd.community, Jonhnathan Ribeiro
category: process_creation
date: 2019/09/06
description: Detects the registration of a debugger for a program that is available
  in the logon screen (sticky key backdoor).
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains:
    - sethc.exe
    - utilman.exe
    - osk.exe
    - magnify.exe
    - narrator.exe
    - displayswitch.exe
    - atbroker.exe
    winlog.event_data.CommandLine|contains|all:
    - \CurrentVersion\Image File Execution Options\
falsepositives:
- Penetration Tests
id: ae215552-081e-44c7-805f-be16f975c8a2
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://blogs.technet.microsoft.com/jonathantrull/2016/10/03/detecting-sticky-key-backdoors/
status: experimental
tags:
- attack.persistence
- attack.privilege_escalation
- attack.t1546.008
title: Suspicious Debugger Registration Cmdline
