author: Victor Sergeev, oscd.community
category: process_creation
date: 2019/10/25
description: Detects persitence via netsh helper
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains|all:
    - add
    - helper
    winlog.event_data.Image|endswith: \netsh.exe
falsepositives:
- Unknown
fields:
- winlog.ComputerName
- winlog.event_data.User
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: 56321594-9087-49d9-bf10-524fe8479452
level: high
logsource:
  category: process_creation
  product: windows
modified: 2020/08/30
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1546.007/T1546.007.md
- https://attack.mitre.org/software/S0108/
status: test
tags:
- attack.privilege_escalation
- attack.t1546.007
- attack.s0108
title: Suspicious Netsh DLL Persistence
