author: Julia Fomina, oscd.community
category: process_creation
date: 2020/10/07
description: Detects an attempt to execute code or create service on remote host via
  winrm.vbs.
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains|all:
    - winrm
    - invoke Create wmicimv2/Win32_
    - -r:http
    winlog.event_data.Image|endswith: \cscript.exe
falsepositives:
- Legitimate use for administartive purposes. Unlikely
id: 9df0dd3a-1a5c-47e3-a2bc-30ed177646a0
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://twitter.com/bohops/status/994405551751815170
- https://redcanary.com/blog/lateral-movement-winrm-wmi/
status: experimental
tags:
- attack.defense_evasion
- attack.t1216
title: Remote Code Execute via Winrm.vbs
