author: Florian Roth, Patrick Bareiss, Anton Kutepov, oscd.community
category: process_creation
date: 2017/11/27
description: Detects a Windows program executable started in a suspicious folder
detection:
  condition: selection and not filter
  filter:
  - winlog.event_data.Image|startswith:
    - C:\Windows\System32\
    - C:\Windows\system32\
    - C:\Windows\SysWow64\
    - C:\Windows\SysWOW64\
    - C:\Windows\winsxs\
    - C:\Windows\WinSxS\
    - C:\avast! sandbox
  - winlog.event_data.Image|contains: \SystemRoot\System32\
  - winlog.event_data.Image: C:\Windows\explorer.exe
  selection:
    winlog.event_data.Image|endswith:
    - \svchost.exe
    - \rundll32.exe
    - \services.exe
    - \powershell.exe
    - \regsvr32.exe
    - \spoolsv.exe
    - \lsass.exe
    - \smss.exe
    - \csrss.exe
    - \conhost.exe
    - \wininit.exe
    - \lsm.exe
    - \winlogon.exe
    - \explorer.exe
    - \taskhost.exe
    - \Taskmgr.exe
    - \sihost.exe
    - \RuntimeBroker.exe
    - \smartscreen.exe
    - \dllhost.exe
    - \audiodg.exe
    - \wlanext.exe
falsepositives:
- Exotic software
fields:
- winlog.ComputerName
- winlog.event_data.User
- winlog.event_data.Image
id: e4a6b256-3e47-40fc-89d2-7a477edd6915
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/03/02
product: windows
references:
- https://twitter.com/GelosSnake/status/934900723426439170
status: experimental
tags:
- attack.defense_evasion
- attack.t1036
title: System File Execution Location Anomaly
