author: Florian Roth
category: process_creation
date: 2021/06/18
description: Detect
detection:
  condition: selection1 or selection2
  selection1:
    winlog.event_data.CommandLine|contains:
    - xyz123456.exe
    - PurpleSharp
  selection2:
    winlog.event_data.OriginalFileName:
    - PurpleSharp.exe
falsepositives:
- Unlikely
id: ff23ffbc-3378-435e-992f-0624dcf93ab4
level: critical
logsource:
  category: process_creation
  product: windows
modified: 2021/07/06
product: windows
references:
- https://github.com/mvelazc0/PurpleSharp
status: experimental
tags:
- attack.t1587
- attack.resource_development
title: PurpleSharp Indicator
