author: Florian Roth
category: process_creation
date: 2021/05/05
description: Detects a whoami.exe executed with the /priv command line flag instructing
  the tool to show all current user privieleges. This is often used after a privilege
  escalation attempt.
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains: /priv
    winlog.event_data.Image|endswith: \whoami.exe
falsepositives:
- Administrative activity (rare lookups on current privileges)
id: 97a80ec7-0e2f-4d05-9ef4-65760e634f6b
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/whoami
status: experimental
tags:
- attack.privilege_escalation
- attack.discovery
- attack.t1033
title: Run Whoami Showing Privileges
