author: E.M. Anhaus (originally from Atomic Blue Detections, Endgame), oscd.community
category: process_creation
date: 2019/10/24
description: Identifies suspicious mshta.exe commands.
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains: javascript
    winlog.event_data.Image|endswith: \mshta.exe
falsepositives:
- unknown
fields:
- winlog.ComputerName
- winlog.event_data.User
- winlog.event_data.CommandLine
id: 67f113fa-e23d-4271-befa-30113b3e08b1
level: high
logsource:
  category: process_creation
  product: windows
modified: 2020/09/01
product: windows
references:
- https://eqllib.readthedocs.io/en/latest/analytics/6bc283c4-21f2-4aed-a05c-a9a3ffa95dd4.html
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1218.005/T1218.005.md
status: experimental
tags:
- attack.defense_evasion
- attack.t1218.005
title: Mshta JavaScript Execution
