author: Eli Salem, Sander Wiebing, oscd.community
category: process_creation
date: 2020/10/12
description: Detects the import of an alternate data stream with regini.exe, regini.exe
  can be used to modify registry keys.
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|re: :[^ \\\\]
    winlog.event_data.Image|endswith: \regini.exe
falsepositives:
- Unknown
fields:
- winlog.event_data.ParentImage
- winlog.event_data.CommandLine
id: 77946e79-97f1-45a2-84b4-f37b5c0d8682
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/05/24
product: windows
references:
- https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OSBinaries/Regini.yml
- https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/regini
status: experimental
tags:
- attack.t1112
- attack.defense_evasion
title: Modifies the Registry From a ADS
