author: "Agro (@agro_sev), Ensar \u015Eamil (@sblmsrsn), oscd.community"
category: process_creation
date: 2020/10/14
description: There is an option for a MS VS Just-In-Time Debugger "vsjitdebugger.exe"
  to launch specified executable and attach a debugger. This option may be used adversaries
  to execute malicious code by signed verified binary. The debugger is installed alongside
  with Microsoft Visual Studio package.
detection:
  condition: selection and not (reduction1 or reduction2)
  reduction1:
    winlog.event_data.Image|endswith: \vsimmersiveactivatehelper*.exe
  reduction2:
    winlog.event_data.Image|endswith: \devenv.exe
  selection:
    winlog.event_data.ParentImage|endswith: \vsjitdebugger.exe
falsepositives:
- the process spawned by vsjitdebugger.exe is uncommon.
id: 15c7904e-6ad1-4a45-9b46-5fb25df37fd2
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2021/07/06
product: windows
references:
- https://twitter.com/pabraeken/status/990758590020452353
- https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OtherMSBinaries/Vsjitdebugger.yml
- https://docs.microsoft.com/en-us/visualstudio/debugger/debug-using-the-just-in-time-debugger?view=vs-2019
status: experimental
tags:
- attack.t1218
- attack.defense_evasion
title: Malicious PE Execution by Microsoft Visual Studio Debugger
