author: Sami Ruohonen, Harish Segar (improvement)
category: process_creation
date: 2018/09/05
description: Detects suspicious powershell process which includes bxor command, alternative
  obfuscation method to b64 encoded commands.
detection:
  condition: selection and filter
  filter:
    winlog.event_data.CommandLine|contains:
    - bxor
    - join
    - char
  selection:
  - winlog.event_data.Description: Windows PowerShell
  - winlog.event_data.Product: PowerShell Core 6
falsepositives:
- unknown
id: bb780e0c-16cf-4383-8383-1e5471db6cf9
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2020/09/06
product: windows
status: experimental
tags:
- attack.defense_evasion
- attack.t1059.001
- attack.t1140
- attack.t1027
title: Suspicious XOR Encoded PowerShell Command Line
