author: Markus Neis
category: process_creation
date: 2018/08/25
description: Detects PowerShell Strings applied to rundll as seen in PowerShdll.dll
detection:
  condition: (selection1 or selection2) and selection3
  selection1:
    winlog.event_data.Image|endswith:
    - \rundll32.exe
  selection2:
    winlog.event_data.Description|contains:
    - Windows-Hostprozess (Rundll32)
  selection3:
    winlog.event_data.CommandLine|contains:
    - Default.GetString
    - FromBase64String
falsepositives:
- Unknown
id: 6812a10b-60ea-420c-832f-dfcc33b646ba
level: high
logsource:
  category: process_creation
  product: windows
modified: 2020/09/01
product: windows
references:
- https://github.com/p3nt4/PowerShdll/blob/master/README.md
status: experimental
tags:
- attack.defense_evasion
- attack.t1218.011
title: Detection of PowerShell Execution via DLL
