author: Florian Roth
category: process_creation
date: 2020/12/08
description: Detects mshta loaded by wmiprvse as parent as used by TA505 malicious
  documents
detection:
  condition: selection
  selection:
    winlog.event_data.Image|endswith: \mshta.exe
    winlog.event_data.ParentImage|endswith: \wmiprvse.exe
falsepositives:
- unknown
id: 18cf6cf0-39b0-4c22-9593-e244bdc9a2d4
level: critical
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://twitter.com/ForensicITGuy/status/1334734244120309760
status: experimental
tags:
- attack.execution
- attack.g0092
title: TA505 Dropper Load Pattern
