author: Florian Roth, Markus Neis
category: process_creation
date: 2020/07/03
description: Detects a suspicious copy command that copies a system program from System32
  to another directory on disk - sometimes used to use LOLBINs like certutil or desktopimgdownldr
  to a different location with a different name
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains:
    - ' /c copy'
    - xcopy
    winlog.event_data.CommandLine|contains|all:
    - \System32\
falsepositives:
- False positives depend on scripts and administrative tools used in the monitored
  environment
- Admin scripts like https://www.itexperience.net/sccm-batch-files-and-32-bits-processes-on-64-bits-os/
fields:
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: fff9d2b7-e11c-4a69-93d3-40ef66189767
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2020/09/05
product: windows
references:
- https://www.hybrid-analysis.com/sample/8da5b75b6380a41eee3a399c43dfe0d99eeefaa1fd21027a07b1ecaa4cd96fdd?environmentId=120
status: experimental
tags:
- attack.defense_evasion
- attack.t1036.003
title: Suspicious Copy From or To System32
