author: Janantha Marasinghe (https://github.com/blueteam0ps)
category: process_creation
date: 2021/02/02
description: Threat actors can use auditpol binary to change audit policy configuration
  to impair detection capability. This can be carried out by selectively disabling/removing
  certain audit policies as well as restoring a custom policy owned by the threat
  actor.
detection:
  condition: selection_auditpol_binary and selection_auditpol_command
  selection_auditpol_binary:
    winlog.event_data.Image|endswith: \auditpol.exe
  selection_auditpol_command:
    winlog.event_data.CommandLine|contains:
    - disable
    - clear
    - remove
    - restore
falsepositives:
- Admin activity
id: 0a13e132-651d-11eb-ae93-0242ac130002
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/02/02
product: windows
references:
- https://www.microsoft.com/security/blog/2021/01/20/deep-dive-into-the-solorigate-second-stage-activation-from-sunburst-to-teardrop-and-raindrop/
tags:
- attack.defense_evasion
- attack.t1562.002
title: Suspicious Auditpol Usage
