author: Julia Fomina, oscd.community
category: process_creation
date: 2020/10/05
description: Detects launch of executable by calling the LaunchApplication function
  from pcwutl.dll library.
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains|all:
    - pcwutl
    - LaunchApplication
    winlog.event_data.Image|endswith: \rundll32.exe
falsepositives:
- Use of Program Compatibility Troubleshooter Helper
id: 9386d78a-7207-4048-9c9f-a93a7c2d1c05
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://github.com/api0cradle/LOLBAS/blob/master/OSLibraries/Pcwutl.md
- https://twitter.com/harr0ey/status/989617817849876488
status: experimental
tags:
- attack.defense_evasion
- attack.t1218.011
title: Code Execution via Pcwutl.dll
