author: Florian Roth
category: process_creation
date: 2021/07/29
description: Detects suspicious PowerShell scripts accessing SAM hives
detection:
  condition: all of them
  selection_1:
    winlog.event_data.CommandLine|contains|all:
    - \HarddiskVolumeShadowCopy
    - ystem32\config\sam
  selection_2:
    winlog.event_data.CommandLine|contains:
    - Copy-Item
    - cp $_.
    - cpi $_.
    - copy $_.
    - .File]::Copy(
falsepositives:
- Some rare backup scenarios
- PowerShell scripts fixing HiveNightmare / SeriousSAM ACLs
id: 1af57a4b-460a-4738-9034-db68b880c665
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://twitter.com/splinter_code/status/1420546784250769408
status: experimental
tags:
- attack.credential_access
- attack.t1003.002
title: PowerShell SAM Copy
