author: Florian Roth
category: process_creation
date: 2020/06/19
description: Detects command lines that indicate unwanted modifications to registry
  keys that disable important Internet Explorer security features
detection:
  condition: 1 of them
  selection1:
    winlog.event_data.CommandLine|contains|all:
    - ' -name IEHarden '
    - ' -value 0 '
  selection2:
    winlog.event_data.CommandLine|contains|all:
    - ' -name DEPOff '
    - ' -value 1 '
  selection3:
    winlog.event_data.CommandLine|contains|all:
    - ' -name DisableFirstRunCustomize '
    - ' -value 2 '
falsepositives:
- Unknown, maybe some security software installer disables these features temporarily
id: fb50eb7a-5ab1-43ae-bcc9-091818cb8424
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://unit42.paloaltonetworks.com/operation-ke3chang-resurfaces-with-new-tidepool-malware/
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001
title: Disabled IE Security Features
