author: Florian Roth
category: process_creation
date: 2020/01/24
description: Detects RDP session hijacking by using MSTSC shadowing
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains|all:
    - noconsentprompt
    - 'shadow:'
falsepositives:
- Unknown
id: 6ba5a05f-b095-4f0a-8654-b825f4f16334
level: high
logsource:
  category: process_creation
  product: windows
modified: 2020/09/06
product: windows
references:
- https://twitter.com/kmkz_security/status/1220694202301976576
- https://github.com/kmkz/Pentesting/blob/master/Post-Exploitation-Cheat-Sheet
status: experimental
tags:
- attack.lateral_movement
- attack.t1563.002
title: MSTSC Shadowing
