author: Florian Roth, John Lambert (idea)
category: process_creation
date: 2021/07/14
description: Detects a suspicious reg.exe invocation that looks as if it would disable
  an important security service
detection:
  condition: selection_reg and selection_services
  selection_reg:
    winlog.event_data.CommandLine|contains|all:
    - reg
    - add
    - ' /d 4'
    - ' /v Start'
  selection_services:
    winlog.event_data.CommandLine|contains:
    - '\Sense '
    - \WinDefend
    - \MsMpSvc
    - \NisSrv
    - '\WdBoot '
    - \WdNisDrv
    - \WdNisSvc
    - '\wscsvc '
    - \SecurityHealthService
    - \wuauserv
    - '\UsoSvc '
falsepositives:
- Unknown
- Other security solution installers
id: 5e95028c-5229-4214-afae-d653d573d0ec
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://twitter.com/JohnLaTwC/status/1415295021041979392
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001
title: Reg Disable Security Service
