author: Christian Burkard
category: process_creation
date: 2021/08/30
description: Detects the pattern of UAC Bypass using DismHost DLL hijacking (UACMe
  63)
detection:
  condition: selection
  selection:
    winlog.event_data.IntegrityLevel:
    - High
    - System
    winlog.event_data.ParentImage|contains|all:
    - C:\Users\
    - \AppData\Local\Temp\
    - \DismHost.exe
falsepositives:
- Unknown
id: 853e74f9-9392-4935-ad3b-2e8c040dae86
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://github.com/hfiref0x/UACME
status: experimental
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1548.002
title: UAC Bypass Using DismHost
