author: oscd.community, @redcanary, Zach Stanford @svch0st
category: process_creation
date: 2020/10/08
description: Detects when when a mounted share is removed. Adversaries may remove
  share connections that are no longer useful in order to clean up traces of their
  operation
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains|all:
    - share
    - /delete
    winlog.event_data.Image|endswith: \net1.exe
    winlog.event_data.ParentImage|endswith: \net.exe
falsepositives:
- Administrators or Power users may remove their shares via cmd line
id: cb7c4a03-2871-43c0-9bbb-18bbdb079896
level: low
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1070.005/T1070.005.md
status: experimental
tags:
- attack.defense_evasion
- attack.t1070.005
title: Mounted Share Deleted
