author: Markus Neis / @Karneades
category: process_creation
date: 2019/04/03
description: Detects WMI spawning PowerShell
detection:
  condition: selection and not filter_null1 and not filter_null2
  filter_null1:
    winlog.event_data.CommandLine: 'null'
  filter_null2:
    winlog.event_data.CommandLine: null
  selection:
    winlog.event_data.Image|endswith:
    - \powershell.exe
    winlog.event_data.ParentImage|endswith:
    - \wmiprvse.exe
falsepositives:
- AppvClient
- CCM
id: 692f0bec-83ba-4d04-af7e-e884a96059b6
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/02/24
product: windows
references:
- https://github.com/Neo23x0/sigma/blob/master/rules/windows/process_creation/win_shell_spawn_susp_program.yml
- https://any.run/report/68bc255f9b0db6a0d30a8f2dadfbee3256acfe12497bf93943bc1eab0735e45e/a2385d6f-34f7-403c-90d3-b1f9d2a90a5e
status: experimental
tags:
- attack.execution
- attack.t1047
- attack.t1059.001
title: WMI Spawning Windows PowerShell
