author: E.M. Anhaus (originally from Atomic Blue Detections, Endgame), oscd.community
category: process_creation
date: 2019/10/24
description: Detect an interactive AT job, which may be used as a form of privilege
  escalation.
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains: interactive
    winlog.event_data.Image|endswith: \at.exe
falsepositives:
- Unlikely (at.exe deprecated as of Windows 8)
fields:
- winlog.ComputerName
- winlog.event_data.User
- winlog.event_data.CommandLine
id: 60fc936d-2eb0-4543-8a13-911c750a1dfc
level: high
logsource:
  category: process_creation
  product: windows
modified: 2019/11/11
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1053.002/T1053.002.md
- https://eqllib.readthedocs.io/en/latest/analytics/d8db43cf-ed52-4f5c-9fb3-c9a4b95a0b56.html
status: experimental
tags:
- attack.privilege_escalation
- attack.t1053.002
title: Interactive AT Job
