author: E.M. Anhaus (originally from Atomic Blue Detections, Endgame), oscd.community
category: process_creation
date: 2019/10/24
description: Identifies use of the bcdedit command to delete boot configuration data.
  This tactic is sometimes used as by malware or an attacker as a destructive technique.
detection:
  condition: selection1 and selection2
  selection1:
    winlog.event_data.CommandLine|contains: set
    winlog.event_data.Image|endswith: \bcdedit.exe
  selection2:
  - winlog.event_data.CommandLine|contains|all:
    - bootstatuspolicy
    - ignoreallfailures
  - winlog.event_data.CommandLine|contains|all:
    - recoveryenabled
    - 'no'
falsepositives:
- Unlikely
fields:
- winlog.ComputerName
- winlog.event_data.User
- winlog.event_data.CommandLine
id: 1444443e-6757-43e4-9ea4-c8fc705f79a2
level: high
logsource:
  category: process_creation
  product: windows
modified: 2019/11/11
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1490/T1490.md
- https://eqllib.readthedocs.io/en/latest/analytics/c4732632-9c1d-4980-9fa8-1d98c93f918e.html
status: experimental
tags:
- attack.impact
- attack.t1490
title: Modification of Boot Configuration
