author: Florian Roth
category: process_creation
date: 2020/05/20
description: Detects tools and process executions as observed in a Greenbug campaign
  in May 2020
detection:
  condition: 1 of them
  selection1:
    winlog.event_data.CommandLine|contains|all:
    - bitsadmin
    - /transfer
    - CSIDL_APPDATA
  selection2:
    winlog.event_data.CommandLine|contains:
    - CSIDL_SYSTEM_DRIVE
  selection3:
    winlog.event_data.CommandLine|contains:
    - \msf.ps1
    - 8989 -e cmd.exe
    - system.Data.SqlClient.SqlDataAdapter($cmd); [void]$da.fill
    - -nop -w hidden -c $k=new-object
    - '[Net.CredentialCache]::DefaultCredentials;IEX '
    - ' -nop -w hidden -c $m=new-object net.webclient;$m'
    - -noninteractive -executionpolicy bypass whoami
    - -noninteractive -executionpolicy bypass netstat -a
    - L3NlcnZlcj1
  selection4:
    winlog.event_data.Image|endswith:
    - \adobe\Adobe.exe
    - \oracle\local.exe
    - \revshell.exe
    - infopagesbackup\ncat.exe
    - CSIDL_SYSTEM\cmd.exe
    - \programdata\oracle\java.exe
    - CSIDL_COMMON_APPDATA\comms\comms.exe
    - \Programdata\VMware\Vmware.exe
falsepositives:
- Unknown
id: 3711eee4-a808-4849-8a14-faf733da3612
level: critical
logsource:
  category: process_creation
  product: windows
modified: 2021/09/21
product: windows
references:
- https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/greenbug-espionage-telco-south-asia
status: experimental
tags:
- attack.g0049
- attack.execution
- attack.t1059.001
- attack.command_and_control
- attack.t1105
- attack.defense_evasion
- attack.t1036.005
title: Greenbug Campaign Indicators
