author: Florian Roth
category: process_creation
date: 2018/06/22
description: Detects suspicious sysprep process start with AppData folder as target
  (as used by Trojan Syndicasec in Thrip report by Symantec)
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains:
    - \AppData\
    winlog.event_data.Image|endswith:
    - \sysprep.exe
falsepositives:
- False positives depend on scripts and administrative tools used in the monitored
  environment
id: d5b9ae7a-e6fc-405e-80ff-2ff9dcc64e7e
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2018/12/11
product: windows
references:
- https://www.symantec.com/blogs/threat-intelligence/thrip-hits-satellite-telecoms-defense-targets
- https://app.any.run/tasks/61a296bb-81ad-4fee-955f-3b399f4aaf4b
status: experimental
tags:
- attack.execution
title: Sysprep on AppData Folder
