author: Christian Burkard
category: process_creation
date: 2021/08/30
description: Detects execution of UACMe (a tool used for UAC bypass) via default PE
  metadata
detection:
  condition: selection
  selection:
  - winlog.event_data.Product: UACMe
  - winlog.event_data.Company: REvol Corp
  - winlog.event_data.OriginalFileName: Akagi.exe
falsepositives:
- Unknown
id: d38d2fa4-98e6-4a24-aff1-410b0c9ad177
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://github.com/hfiref0x/UACME
status: experimental
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1548.002
title: UAC Bypass Tool UACMe
