author: Florian Roth
category: process_creation
date: 2017/08/15
description: Detects a suspicious svchost process start
detection:
  condition: selection and not filter and not filter_null
  filter:
    winlog.event_data.ParentImage|endswith:
    - \services.exe
    - \MsMpEng.exe
    - \Mrt.exe
    - \rpcnet.exe
    - \svchost.exe
  filter_null:
    winlog.event_data.ParentImage: null
  selection:
    winlog.event_data.Image|endswith: \svchost.exe
falsepositives:
- Unknown
fields:
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: 01d2e2a1-5f09-44f7-9fc1-24faa7479b6d
level: high
logsource:
  category: process_creation
  product: windows
modified: 2020/08/28
product: windows
status: experimental
tags:
- attack.defense_evasion
- attack.t1036.005
title: Suspicious Svchost Process
