author: Florian Roth
category: process_creation
date: 2018/03/23
description: Detects a ping command that uses a hex encoded IP address
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains: 0x
    winlog.event_data.Image|endswith: \ping.exe
falsepositives:
- Unlikely, because no sane admin pings IP addresses in a hexadecimal form
fields:
- winlog.event_data.ParentCommandLine
id: 1a0d4aba-7668-4365-9ce4-6d79ab088dfd
level: high
logsource:
  category: process_creation
  product: windows
modified: 2020/11/28
product: windows
references:
- https://github.com/vysec/Aggressor-VYSEC/blob/master/ping.can
- https://twitter.com/vysecurity/status/977198418354491392
tags:
- attack.defense_evasion
- attack.t1140
- attack.t1027
title: Ping Hex IP
