author: E.M. Anhaus (originally from Atomic Blue Detections, Endgame), oscd.community
category: process_creation
date: 2019/10/24
description: Detects audio capture via PowerShell Cmdlet.
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains: WindowsAudioDevice-Powershell-Cmdlet
falsepositives:
- Legitimate audio capture by legitimate user.
id: 932fb0d8-692b-4b0f-a26e-5643a50fe7d6
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2019/11/11
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1123/T1123.md
- https://eqllib.readthedocs.io/en/latest/analytics/ab7a6ef4-0983-4275-a4f1-5c6bd3c31c23.html
status: experimental
tags:
- attack.collection
- attack.t1123
title: Audio Capture via PowerShell
