author: Florian Roth, oscd.community
category: process_creation
date: 2019/01/16
description: Detects various anomalies in relation to regsvr32.exe
detection:
  condition: 1 of them
  selection1:
    winlog.event_data.CommandLine|contains: \Temp\
    winlog.event_data.Image|endswith: \regsvr32.exe
  selection2:
    winlog.event_data.Image|endswith: \regsvr32.exe
    winlog.event_data.ParentImage|endswith: \powershell.exe
  selection3:
    winlog.event_data.Image|endswith: \regsvr32.exe
    winlog.event_data.ParentImage|endswith: \cmd.exe
  selection4:
    winlog.event_data.CommandLine|contains:
    - http
    - ftp
    winlog.event_data.CommandLine|contains|all:
    - '/i:'
    winlog.event_data.CommandLine|endswith: scrobj.dll
    winlog.event_data.Image|endswith: \regsvr32.exe
  selection5:
    winlog.event_data.Image|endswith: \wscript.exe
    winlog.event_data.ParentImage|endswith: \regsvr32.exe
  selection6:
    winlog.event_data.CommandLine|contains: '..\..\..\Windows\System32\regsvr32.exe '
    winlog.event_data.Image|endswith: \EXCEL.EXE
  selection7:
    winlog.event_data.Image|endswith: \regsvr32.exe
    winlog.event_data.ParentImage|endswith: \mshta.exe
  selection8:
    winlog.event_data.CommandLine|contains:
    - \AppData\Local
    - C:\Users\Public
    winlog.event_data.Image|endswith: \regsvr32.exe
falsepositives:
- Unknown
fields:
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: 8e2b24c9-4add-46a0-b4bb-0057b4e6187d
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/07/18
product: windows
references:
- https://subt0x10.blogspot.de/2017/04/bypass-application-whitelisting-script.html
- https://app.any.run/tasks/34221348-072d-4b70-93f3-aa71f6ebecad/
status: experimental
tags:
- attack.defense_evasion
- attack.t1218.010
- car.2019-04-002
- car.2019-04-003
title: Regsvr32 Anomaly
