author: Florian Roth
category: process_creation
date: 2021/01/21
description: Detects commands that indicate a Raccine removal from an end system.
  Raccine is a free ransomware protection tool.
detection:
  condition: 1 of them
  selection1:
    winlog.event_data.CommandLine|contains|all:
    - 'taskkill '
    - RaccineSettings.exe
  selection2:
    winlog.event_data.CommandLine|contains|all:
    - reg.exe
    - delete
    - Raccine Tray
  selection3:
    winlog.event_data.CommandLine|contains|all:
    - schtasks
    - /DELETE
    - Raccine Rules Updater
falsepositives:
- Legitimate deinstallation by administrative staff
id: a31eeaed-3fd5-478e-a8ba-e62c6b3f9ecc
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/07/14
product: windows
references:
- https://github.com/Neo23x0/Raccine
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001
title: Raccine Uninstall
