author: Florian Roth
category: process_creation
date: 2021/08/23
description: Detects suspicious Splwow64.exe process without any command line parameters
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.CommandLine|endswith: splwow64.exe
  selection:
    winlog.event_data.Image|endswith: \splwow64.exe
falsepositives:
- Unknown
id: 1f1a8509-2cbb-44f5-8751-8e1571518ce2
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://twitter.com/sbousseaden/status/1429401053229891590?s=12
status: experimental
tags:
- attack.defense_evasion
- attack.t1202
title: Suspicious Splwow64 Without Params
