author: E.M. Anhaus (originally from Atomic Blue Detections, Tony Lambert), oscd.community
category: process_creation
date: 2019/10/24
description: Detect creation of dump files containing the memory space of lsass.exe,
  which contains sensitive credentials. Identifies usage of Sysinternals procdump.exe
  to export the memory space of lsass.exe which contains sensitive credentials.
detection:
  condition: selection1 and not selection2 or selection3
  selection1:
    winlog.event_data.CommandLine|contains|all:
    - lsass
    - .dmp
  selection2:
    winlog.event_data.Image|endswith: \werfault.exe
  selection3:
    winlog.event_data.CommandLine|contains: lsass
    winlog.event_data.Image|contains: \procdump
    winlog.event_data.Image|endswith: .exe
falsepositives:
- Unlikely
fields:
- winlog.ComputerName
- winlog.event_data.User
- winlog.event_data.CommandLine
id: ffa6861c-4461-4f59-8a41-578c39f3f23e
level: high
logsource:
  category: process_creation
  product: windows
modified: 2019/11/11
product: windows
references:
- https://eqllib.readthedocs.io/en/latest/analytics/1e1ef6be-12fc-11e9-8d76-4d6bb837cda4.html
- https://eqllib.readthedocs.io/en/latest/analytics/210b4ea4-12fc-11e9-8d76-4d6bb837cda4.html
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1003/T1003.md
status: experimental
tags:
- attack.credential_access
- attack.t1003.001
title: LSASS Memory Dumping
