author: Florian Roth
category: process_creation
date: 2021/07/24
description: Detects different hacktools used for relay attacks on Windows for privilege
  escalation
detection:
  condition: selection_pe or selection_script
  selection_pe:
    winlog.event_data.Image|contains:
    - PetitPotam
    - RottenPotato
    - HotPotato
    - JuicyPotato
    - \just_dce_
    - Juicy Potato
    - \temp\rot.exe
    - \Potato.exe
    - \SpoolSample.exe
    - \Responder.exe
    - \smbrelayx
    - \ntlmrelayx
  selection_script:
    winlog.event_data.CommandLine|contains:
    - Invoke-Tater
    - ' smbrelay'
    - ' ntlmrelay'
    - 'cme smb '
    - ' /ntlm:NTLMhash '
    - Invoke-PetitPotam
falsepositives:
- Legitimate files with these rare hacktool names
id: 5589ab4f-a767-433c-961d-c91f3f704db1
level: critical
logsource:
  category: process_creation
  product: windows
modified: 2021/07/26
product: windows
references:
- https://attack.mitre.org/techniques/T1557/001/
- https://foxglovesecurity.com/2016/09/26/rotten-potato-privilege-escalation-from-service-accounts-to-system/
- https://pentestlab.blog/2017/04/13/hot-potato/
- https://github.com/ohpe/juicy-potato
- https://hunter2.gitbook.io/darthsidious/other/war-stories/domain-admin-in-30-minutes
- https://hunter2.gitbook.io/darthsidious/execution/responder-with-ntlm-relay-and-empire
status: experimental
tags:
- attack.execution
- attack.t1557.001
title: SMB Relay Attack Tools
