author: Victor Sergeev, oscd.community
category: process_creation
date: 2020/10/09
description: Detects when verclsid.exe is used to run COM object via GUID
detection:
  cmd_c:
    winlog.event_data.CommandLine|contains: /C
  cmd_s:
    winlog.event_data.CommandLine|contains: /S
  condition: image_path and cmd_c and cmd_s
  image_path:
    winlog.event_data.Image|endswith: \verclsid.exe
falsepositives:
- Unknown
fields:
- winlog.event_data.CommandLine
id: d06be4b9-8045-428b-a567-740a26d9db25
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OSBinaries/Verclsid.yml
- https://gist.github.com/NickTyrer/0598b60112eaafe6d07789f7964290d5
- https://bohops.com/2018/08/18/abusing-the-com-registry-structure-part-2-loading-techniques-for-evasion-and-persistence/
status: experimental
tags:
- attack.defense_evasion
- attack.t1218
title: Verclsid.exe Runs COM Object
