author: Timur Zinniatullin, oscd.community
category: process_creation
date: 2019/10/21
description: Extensible Stylesheet Language (XSL) files are commonly used to describe
  the processing and rendering of data within XML files. Rule detects when adversaries
  abuse this functionality to execute arbitrary files while potentially bypassing
  application whitelisting defenses.
detection:
  condition: selection
  selection:
  - winlog.event_data.CommandLine|contains: /format
    winlog.event_data.Image|endswith: \wmic.exe
  - winlog.event_data.Image|endswith: \msxsl.exe
falsepositives:
- WMIC.exe FP depend on scripts and administrative methods used in the monitored environment.
- msxsl.exe is not installed by default, so unlikely.
id: 05c36dd6-79d6-4a9a-97da-3db20298ab2d
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2019/11/04
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1220/T1220.md
status: experimental
tags:
- attack.defense_evasion
- attack.t1220
title: XSL Script Processing
