author: Daniel Bohannon (@Mandiant/@FireEye), oscd.community
category: process_creation
date: 2019/11/08
description: "Detects all variations of obfuscated powershell IEX invocation code\
  \ generated by Invoke-Obfuscation framework from the following code block \u2014\
  \ https://github.com/danielbohannon/Invoke-Obfuscation/blob/master/Out-ObfuscatedStringCommand.ps1#L873-L888"
detection:
  condition: selection
  selection:
  - winlog.event_data.CommandLine|re: \$PSHome\[\s*\d{1,3}\s*\]\s*\+\s*\$PSHome\[
  - winlog.event_data.CommandLine|re: \$ShellId\[\s*\d{1,3}\s*\]\s*\+\s*\$ShellId\[
  - winlog.event_data.CommandLine|re: \$env:Public\[\s*\d{1,3}\s*\]\s*\+\s*\$env:Public\[
  - winlog.event_data.CommandLine|re: \$env:ComSpec\[(\s*\d{1,3}\s*,){2}
  - winlog.event_data.CommandLine|re: \\\\*mdr\\\\*\W\s*\)\.Name
  - winlog.event_data.CommandLine|re: \$VerbosePreference\.ToString\(
  - winlog.event_data.CommandLine|re: \\\\String\]\s*\$VerbosePreference
falsepositives:
- Unknown
id: 4bf943c6-5146-4273-98dd-e958fd1e3abf
level: high
logsource:
  category: process_creation
  product: windows
modified: 2020/09/01
product: windows
status: experimental
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
title: Invoke-Obfuscation Obfuscated IEX Invocation
