author: Maxime Thiebaut (@0xThiebaut)
category: process_creation
date: 2021/10/21
definition: 'Requirements: Sysmon ProcessCreation logging must be activated'
description: Detects using WorkFolders.exe to execute an arbitrary control.exe
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.Image: C:\Windows\System32\control.exe
  selection:
    winlog.event_data.Image|endswith: \control.exe
    winlog.event_data.ParentImage|endswith: \WorkFolders.exe
falsepositives:
- Legitimate usage of the uncommon Windows Work Folders feature.
id: 0bbc6369-43e3-453d-9944-cae58821c173
level: high
logsource:
  category: process_creation
  definition: 'Requirements: Sysmon ProcessCreation logging must be activated'
  product: windows
product: windows
references:
- https://twitter.com/elliotkillick/status/1449812843772227588
status: experimental
tags:
- attack.defense_evasion
- attack.t1218
title: Execution via WorkFolders.exe
