author: Florian Roth
category: process_creation
date: 2019/02/24
description: Detects activity that could be related to Baby Shark malware
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine:
    - reg query "HKEY_CURRENT_USER\Software\Microsoft\Terminal Server Client\Default"
    - powershell.exe mshta.exe http*
    - cmd.exe /c taskkill /im cmd.exe
falsepositives:
- unknown
id: 2b30fa36-3a18-402f-a22d-bf4ce2189f35
level: high
logsource:
  category: process_creation
  product: windows
modified: 2020/08/26
product: windows
references:
- https://unit42.paloaltonetworks.com/new-babyshark-malware-targets-u-s-national-security-think-tanks/
status: experimental
tags:
- attack.execution
- attack.t1059.003
- attack.t1059.001
- attack.discovery
- attack.t1012
- attack.defense_evasion
- attack.t1218.005
title: Baby Shark Activity
