author: Florian Roth, Jonhnathan Ribeiro, Anton Kutepov, oscd.community
category: process_creation
date: 2017/01/01
description: Detects certain command line parameters often used during reconnaissance
  activity via web shells
detection:
  change_dir:
    winlog.event_data.CommandLine|contains:
    - '&cd&echo'
    - 'cd /d '
  condition: parent_is_web_server_process and (net_utility or ping_utility or change_dir
    or wmic_utility or misc_discovery_binaries or misc_discovery_commands)
  misc_discovery_binaries:
    winlog.event_data.Image|endswith:
    - \whoami.exe
    - \systeminfo.exe
    - \quser.exe
    - \ipconfig.exe
    - \pathping.exe
    - \tracert.exe
    - \netstat.exe
    - \schtasks.exe
    - \vssadmin.exe
    - \wevtutil.exe
    - \tasklist.exe
  misc_discovery_commands:
    winlog.event_data.CommandLine|contains:
    - ' Test-NetConnection '
    - dir \
  net_utility:
    winlog.event_data.CommandLine|contains:
    - ' user '
    - ' use '
    - ' group '
    winlog.event_data.Image|endswith:
    - \net.exe
    - \net1.exe
  parent_is_web_server_process:
  - winlog.event_data.ParentImage|endswith:
    - \w3wp.exe
    - \php-cgi.exe
    - \nginx.exe
    - \httpd.exe
  - winlog.event_data.ParentImage|contains:
    - \apache
    - \tomcat
  ping_utility:
    winlog.event_data.CommandLine|contains: ' -n '
    winlog.event_data.Image|endswith: \ping.exe
  wmic_utility:
    winlog.event_data.CommandLine|contains: ' /node:'
    winlog.event_data.Image|endswith: \wmic.exe
falsepositives:
- unknown
fields:
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: bed2a484-9348-4143-8a8a-b801c979301c
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/03/02
product: windows
references:
- https://www.fireeye.com/blog/threat-research/2013/08/breaking-down-the-china-chopper-web-shell-part-ii.html
- https://unit42.paloaltonetworks.com/bumblebee-webshell-xhunt-campaign/
tags:
- attack.persistence
- attack.t1505.003
- attack.t1018
- attack.t1033
- attack.t1087
title: Webshell Detection With Command Line Keywords
