author: Christian Burkard
category: process_creation
date: 2021/09/20
description: Detects the execution of Xwizard tool from the non-default directory
  which can be used to sideload a custom xwizards.dll
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.Image|startswith: C:\Windows\System32\
  selection:
    winlog.event_data.Image|endswith: \xwizard.exe
falsepositives:
- Windows installed on non-C drive
id: 193d5ccd-6f59-40c6-b5b0-8e32d5ddd3d1
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://lolbas-project.github.io/lolbas/Binaries/Xwizard/
- http://www.hexacorn.com/blog/2017/07/31/the-wizard-of-x-oppa-plugx-style/
status: experimental
tags:
- attack.defense_evasion
- attack.t1574.002
title: Xwizard DLL Sideloading
