author: juju4, Jonhnathan Ribeiro, oscd.community
category: process_creation
date: 2019/01/16
description: Detects suspicious process related to rundll32 based on arguments
detection:
  condition: selection
  selection:
  - winlog.event_data.CommandLine|contains:
    - 'javascript:'
    - .RegisterXLL
  - winlog.event_data.CommandLine|contains|all:
    - url.dll
    - OpenURL
  - winlog.event_data.CommandLine|contains|all:
    - url.dll
    - OpenURLA
  - winlog.event_data.CommandLine|contains|all:
    - url.dll
    - FileProtocolHandler
  - winlog.event_data.CommandLine|contains|all:
    - zipfldr.dll
    - RouteTheCall
  - winlog.event_data.CommandLine|contains|all:
    - shell32.dll
    - Control_RunDLL
  - winlog.event_data.CommandLine|contains|all:
    - shell32.dll
    - ShellExec_RunDLL
  - winlog.event_data.CommandLine|contains|all:
    - mshtml.dll
    - PrintHTML
  - winlog.event_data.CommandLine|contains|all:
    - advpack.dll
    - LaunchINFSection
  - winlog.event_data.CommandLine|contains|all:
    - advpack.dll
    - RegisterOCX
  - winlog.event_data.CommandLine|contains|all:
    - ieadvpack.dll
    - LaunchINFSection
  - winlog.event_data.CommandLine|contains|all:
    - ieadvpack.dll
    - RegisterOCX
  - winlog.event_data.CommandLine|contains|all:
    - ieframe.dll
    - OpenURL
  - winlog.event_data.CommandLine|contains|all:
    - shdocvw.dll
    - OpenURL
  - winlog.event_data.CommandLine|contains|all:
    - syssetup.dll
    - SetupInfObjectInstallAction'
  - winlog.event_data.CommandLine|contains|all:
    - setupapi.dll
    - InstallHinfSection
  - winlog.event_data.CommandLine|contains|all:
    - pcwutl.dll
    - LaunchApplication
  - winlog.event_data.CommandLine|contains|all:
    - dfshim.dll
    - ShOpenVerbApplication
falsepositives:
- False positives depend on scripts and administrative tools used in the monitored
  environment
id: e593cf51-88db-4ee1-b920-37e89012a3c9
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- http://www.hexacorn.com/blog/2017/05/01/running-programs-via-proxy-jumping-on-a-edr-bypass-trampoline/
- https://twitter.com/Hexacorn/status/885258886428725250
- https://gist.github.com/ryhanson/227229866af52e2d963cf941af135a52
status: experimental
tags:
- attack.defense_evasion
- attack.t1218.011
title: Suspicious Rundll32 Activity
