author: Endgame, JHasenbusch (adapted to Sigma for oscd.community)
category: process_creation
date: 2018/10/30
description: Identifies creation of local users via the net.exe command.
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains|all:
    - user
    - add
    winlog.event_data.Image|endswith:
    - \net.exe
    - \net1.exe
falsepositives:
- Legitimate user creation.
- Better use event IDs for user creation rather than command line rules.
fields:
- winlog.ComputerName
- winlog.event_data.User
- winlog.event_data.CommandLine
id: cd219ff3-fa99-45d4-8380-a7d15116c6dc
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2020/09/01
product: windows
references:
- https://eqllib.readthedocs.io/en/latest/analytics/014c3f51-89c6-40f1-ac9c-5688f26090ab.html
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1136.001/T1136.001.md
status: experimental
tags:
- attack.persistence
- attack.t1136.001
title: Net.exe User Account Creation
