author: Florian Roth
category: process_creation
date: 2019/11/18
description: Detects the execution of a renamed ProcDump executable often used by
  attackers or malware
detection:
  condition: ( selection1 or selection2 or selection3 ) and not filter
  filter:
    winlog.event_data.Image|endswith:
    - \procdump.exe
    - \procdump64.exe
  selection1:
    winlog.event_data.OriginalFileName: procdump
  selection2:
    winlog.event_data.CommandLine|contains|all:
    - ' -ma '
    - ' -accepteula '
  selection3:
    winlog.event_data.CommandLine|contains|all:
    - ' -ma '
    - .dmp
falsepositives:
- Procdump illegaly bundled with legitimate software
- Weird admins who renamed binaries
id: 4a0b2c7e-7cb2-495d-8b63-5f268e7bfd67
level: critical
logsource:
  category: process_creation
  product: windows
modified: 2021/08/16
product: windows
references:
- https://docs.microsoft.com/en-us/sysinternals/downloads/procdump
status: experimental
tags:
- attack.defense_evasion
- attack.t1036.003
title: Renamed ProcDump
