author: oscd.community, Natalia Shornikova
category: process_creation
date: 2020/10/14
description: Detects Execution via runAfterCancelProcess in CL_Mutexverifiers.ps1
  module
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains|all:
    - CL_Mutexverifiers.ps1
    - runAfterCancelProcess
falsepositives:
- Unknown
id: 99465c8f-f102-4157-b11c-b0cddd53b79a
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/05/21
product: windows
references:
- https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OSScripts/CL_mutexverifiers.yml
- https://twitter.com/pabraeken/status/995111125447577600
status: experimental
tags:
- attack.defense_evasion
- attack.t1216
title: Execution via CL_Mutexverifiers.ps1
