author: Trent Liffick
category: process_creation
date: 2020/05/01
description: Detects usage of findstr to identify and execute a lnk file as seen within
  the HHS redirect attack
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|endswith: .lnk
    winlog.event_data.Image|endswith: \findstr.exe
falsepositives:
- unknown
fields:
- winlog.event_data.Image
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: 33339be3-148b-4e16-af56-ad16ec6c7e7b
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2020/08/30
product: windows
references:
- https://www.bleepingcomputer.com/news/security/hhsgov-open-redirect-used-by-coronavirus-phishing-to-spread-malware/
status: experimental
tags:
- attack.defense_evasion
- attack.t1036
- attack.t1202
- attack.t1027.003
title: Findstr Launching .lnk File
