author: Florian Roth, Tom Ueltschi, Jonhnathan Ribeiro, oscd.community
category: process_creation
date: 2017/11/10
description: Detects javaw.exe in AppData folder as used by Adwind / JRAT
detection:
  condition: selection
  selection:
  - winlog.event_data.CommandLine|contains|all:
    - \AppData\Roaming\Oracle
    - \java
    - '.exe '
  - winlog.event_data.CommandLine|contains|all:
    - cscript.exe
    - Retrive
    - '.vbs '
id: 1fac1481-2dbc-48b2-9096-753c49b4ec71
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/09/19
product: windows
references:
- https://www.hybrid-analysis.com/sample/ba86fa0d4b6af2db0656a88b1dd29f36fe362473ae8ad04255c4e52f214a541c?environmentId=100
- https://www.first.org/resources/papers/conf2017/Advanced-Incident-Detection-and-Threat-Hunting-using-Sysmon-and-Splunk.pdf
status: experimental
tags:
- attack.execution
- attack.t1059.005
- attack.t1059.007
title: Adwind RAT / JRAT
