author: Oddvar Moe, Sander Wiebing, oscd.community
category: process_creation
date: 2020/10/07
description: Detects the export of the target Registry key to a file.
detection:
  condition: selection and not (filter_1 and filter_2)
  filter_1:
    winlog.event_data.CommandLine|contains:
    - hklm
    - hkey_local_machine
  filter_2:
    winlog.event_data.CommandLine|endswith:
    - \system
    - \sam
    - \security
  selection:
    winlog.event_data.CommandLine|contains: ' /E '
    winlog.event_data.Image|endswith: \regedit.exe
falsepositives:
- Legitimate export of keys
fields:
- winlog.event_data.ParentImage
- winlog.event_data.CommandLine
id: f0e53e89-8d22-46ea-9db5-9d4796ee2f8a
level: low
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OSBinaries/Regedit.yml
- https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f
status: experimental
tags:
- attack.exfiltration
- attack.t1012
title: Exports Registry Key To a File
