author: Cian Heasley
category: process_creation
date: 2020/08/08
description: The PowerShell implementation of DNSCat2 calls nslookup to craft queries.
  Counting nslookup processes spawned by PowerShell will show hundreds or thousands
  of instances if PS DNSCat2 is active locally.
detection:
  condition: selection | count(Image) by ParentImage > 100
  selection:
    winlog.event_data.CommandLine|endswith: \nslookup.exe
    winlog.event_data.Image|endswith: \nslookup.exe
    winlog.event_data.ParentImage|endswith: \powershell.exe
falsepositives:
- Other powershell scripts that call nslookup.exe
fields:
- winlog.event_data.Image
- winlog.event_data.CommandLine
- winlog.event_data.ParentImage
id: b11d75d6-d7c1-11ea-87d0-0242ac130003
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://github.com/lukebaggett/dnscat2-powershell
- https://blu3-team.blogspot.com/2019/08/powershell-dns-c2-notes.html
- https://ragged-lab.blogspot.com/2020/06/it-is-always-dns-powershell-edition.html
status: experimental
tags:
- attack.command_and_control
- attack.t1071
- attack.t1071.004
- attack.t1001.003
- attack.t1041
title: DNSCat2 Powershell Implementation Detection Via Process Creation
