author: Max Altgelt, Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research),
  MSTIC
category: process_creation
date: 2021/10/15
description: Detects specific commands commonly used to remove or empty the syslog.
detection:
  condition: selection
  selection:
    CommandLine|contains:
    - rm /var/log/syslog
    - rm -r /var/log/syslog
    - rm -f /var/log/syslog
    - rm -rf /var/log/syslog
    - mv /var/log/syslog
    - ' >/var/log/syslog'
    - ' > /var/log/syslog'
falsepositives:
- Log rotation.
id: 3fcc9b35-39e4-44c0-a2ad-9e82b6902b31
level: high
logsource:
  category: process_creation
  product: linux
product: linux
references:
- https://github.com/SigmaHQ/sigma/blob/master/rules/linux/lnx_clear_syslog.yml
status: experimental
tags:
- attack.impact
- attack.t1565.001
title: Commands to Clear or Remove the Syslog
