author: Florian Roth
category: process_creation
date: 2021/10/15
description: Detects suspicious sub processes of web server processes
detection:
  condition: selection_sub_processes and ( selection_general or selection_tomcat )
  selection_general:
    ParentImage|endswith:
    - /httpd
    - /lighttpd
    - /nginx
    - /apache2
    - /node
  selection_sub_processes:
    Image|endswith:
    - /whoami
    - /ifconfig
    - /usr/bin/ip
    - /bin/uname
  selection_tomcat:
    ParentCommandLine|contains|all:
    - /bin/java
    - tomcat
  selection_websphere:
    ParentCommandLine|contains|all:
    - /bin/java
    - websphere
falsepositives:
- Web applications that invoke Linux command line tools
id: 818f7b24-0fba-4c49-a073-8b755573b9c7
level: critical
logsource:
  category: process_creation
  product: linux
product: linux
references:
- https://www.acunetix.com/blog/articles/web-shells-101-using-php-introduction-web-shells-part-2/
status: experimental
tags:
- attack.persistence
- attack.t1505.003
title: Linux Webshell Indicators
