author: Daniil Yugoslavskiy, oscd.community
category: process_creation
date: 2020/10/19
description: Detects usage of system utilities to discover system network connections
detection:
  condition: selection
  selection:
    Image|endswith:
    - /who
    - /w
    - /last
    - /lsof
    - /netstat
falsepositives:
- Legitimate activities
id: 4c519226-f0cd-4471-bd2f-6fbb2bb68a79
level: low
logsource:
  category: process_creation
  product: linux
modified: 2021/11/27
product: linux
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1049/T1049.md
status: test
tags:
- attack.discovery
- attack.t1049
title: System Network Connections Discovery
