author: Daniil Yugoslavskiy, oscd.community
category: process_creation
date: 2020/10/19
description: Detects usage of system utilities (only grep for now) to discover security
  software discovery
detection:
  condition: selection
  selection:
    CommandLine|contains:
    - nessusd
    - td-agent
    - packetbeat
    - filebeat
    - auditbeat
    - osqueryd
    - cbagentd
    - falcond
    Image|endswith: /grep
falsepositives:
- Legitimate activities
id: c9d8b7fd-78e4-44fe-88f6-599135d46d60
level: low
logsource:
  category: process_creation
  product: linux
modified: 2022/07/11
product: linux
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1518.001/T1518.001.md
status: test
tags:
- attack.discovery
- attack.t1518.001
title: Security Software Discovery
