author: Alejandro Ortuno, oscd.community
category: process_creation
date: 2020/10/21
definition: Detect netcat and filter our listening mode
description: Detects enumeration of local or remote network services.
detection:
  condition: (netcat and not netcat_listen_flag) or network_scanning_tools
  netcat:
    Image|endswith:
    - /nc
    - /netcat
  netcat_listen_flag:
    CommandLine|contains: l
  network_scanning_tools:
    Image|endswith:
    - /telnet
    - /nmap
falsepositives:
- Legitimate administration activities
id: 3e102cd9-a70d-4a7a-9508-403963092f31
level: low
logsource:
  category: process_creation
  definition: Detect netcat and filter our listening mode
  product: linux
modified: 2021/09/14
product: linux
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1046/T1046.md
status: experimental
tags:
- attack.discovery
- attack.t1046
title: Linux Network Service Scanning
