author: "\xD6mer G\xFCnal, oscd.community"
category: process_creation
date: 2020/10/05
description: Detects installation of new certificate on the system which attackers
  may use to avoid warnings when connecting to controlled web servers or C2s
detection:
  condition: selection
  selection:
    Image|endswith:
    - /update-ca-certificates
    - /update-ca-trust
falsepositives:
- Legitimate administration activities
id: 78a80655-a51e-4669-bc6b-e9d206a462ee
level: low
logsource:
  category: process_creation
  product: linux
modified: 2022/07/07
product: linux
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1553.004/T1553.004.md
status: test
tags:
- attack.defense_evasion
- attack.t1553.004
title: Install Root Certificate
