author: Nasreddine Bencherchali
category: process_creation
date: 2022/07/05
description: Detects default install commands of the Triple Cross eBPF rootkit based
  on the "deployer.sh" script
detection:
  condition: selection
  selection:
    CommandLine|contains:
    - ' qdisc '
    - ' filter '
    CommandLine|contains|all:
    - ' tc '
    - ' enp0s3 '
    Image|endswith: /sudo
falsepositives:
- Unlikely
id: 22236d75-d5a0-4287-bf06-c93b1770860f
level: high
logsource:
  category: process_creation
  product: linux
product: linux
references:
- https://github.com/h3xduck/TripleCross/blob/1f1c3e0958af8ad9f6ebe10ab442e75de33e91de/apps/deployer.sh
status: experimental
tags:
- attack.defense_evasion
- attack.t1014
title: Triple Cross eBPF Rootkit Install Commands
