author: Christopher Peacock @SecurePeacock, SCYTHE @scythe_io
category: process_creation
date: 2022/06/03
description: Detects chmod targeting files in abnormal directory paths.
detection:
  condition: selection
  selection:
    CommandLine|contains:
    - /tmp/
    - /.Library/
    - /etc/
    - /opt/
    Image|endswith: /chmod
falsepositives:
- Admin changing file permissions.
id: 6419afd1-3742-47a5-a7e6-b50386cd15f8
level: medium
logsource:
  category: process_creation
  product: linux
product: linux
references:
- https://www.intezer.com/blog/malware-analysis/new-backdoor-sysjoker/
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1222.002/T1222.002.md
status: experimental
tags:
- attack.defense_evasion
- attack.t1222.002
title: Chmod Suspicious Directory
