author: pH-T
category: process_creation
date: 2022/07/26
description: Detects suspicious process command line that uses base64 encoded input
  for execution with a shell
detection:
  condition: selection_base64 and selection_exec
  selection_base64:
    CommandLine|contains: 'base64 -w0 '
  selection_exec:
  - CommandLine|contains:
    - '| bash '
    - '| sh '
    - '|bash '
    - '|sh '
  - CommandLine|endswith:
    - '| bash'
    - '| sh'
    - '|bash'
    - ' |sh'
falsepositives:
- Legitimate administration activities
id: ba592c6d-6888-43c3-b8c6-689b8fe47337
level: medium
logsource:
  category: process_creation
  product: linux
product: linux
references:
- https://github.com/arget13/DDexec
status: experimental
tags:
- attack.defense_evasion
- attack.t1140
title: Linux Base64 Encoded Pipe to Shell
