author: "\xD6mer G\xFCnal, Alejandro Ortuno, oscd.community"
category: process_creation
date: 2020/06/17
description: Detects disabling security tools
detection:
  condition: 1 of selection*
  selection_carbonblack_1:
    CommandLine|contains|all:
    - cbdaemon
    - stop
    Image|endswith: /service
  selection_carbonblack_2:
    CommandLine|contains|all:
    - cbdaemon
    - 'off'
    Image|endswith: /chkconfig
  selection_carbonblack_3:
    CommandLine|contains|all:
    - cbdaemon
    - stop
    Image|endswith: /systemctl
  selection_carbonblack_4:
    CommandLine|contains|all:
    - cbdaemon
    - disable
    Image|endswith: /systemctl
  selection_crowdstrike_1:
    CommandLine|contains|all:
    - stop
    - falcon-sensor
    Image|endswith: /systemctl
  selection_crowdstrike_2:
    CommandLine|contains|all:
    - disable
    - falcon-sensor
    Image|endswith: /systemctl
  selection_firewall_1:
    CommandLine|contains|all:
    - firewalld
    - stop
    Image|endswith: /systemctl
  selection_firewall_2:
    CommandLine|contains|all:
    - firewalld
    - disable
    Image|endswith: /systemctl
  selection_iptables_1:
    CommandLine|contains|all:
    - iptables
    - stop
    Image|endswith: /service
  selection_iptables_2:
    CommandLine|contains|all:
    - ip6tables
    - stop
    Image|endswith: /service
  selection_iptables_3:
    CommandLine|contains|all:
    - iptables
    - stop
    Image|endswith: /chkconfig
  selection_iptables_4:
    CommandLine|contains|all:
    - ip6tables
    - stop
    Image|endswith: /chkconfig
  selection_selinux:
    CommandLine|contains: '0'
    Image|endswith: /setenforce
falsepositives:
- Legitimate administration activities
id: e3a8a052-111f-4606-9aee-f28ebeb76776
level: medium
logsource:
  category: process_creation
  product: linux
modified: 2021/09/14
product: linux
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.004/T1562.004.md
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.004
title: Disabling Security Tools
