author: Nasreddine Bencherchali
category: process_creation
date: 2022/07/05
description: Detects execution of a the file "execve_hijack" which is used by the
  Triple Cross rootkit as a way to elevate privileges
detection:
  condition: selection
  selection:
    CommandLine|contains: execve_hijack
    Image|endswith: /sudo
falsepositives:
- Unlikely
id: 0326c3c8-7803-4a0f-8c5c-368f747f7c3e
level: high
logsource:
  category: process_creation
  product: linux
product: linux
references:
- https://github.com/h3xduck/TripleCross/blob/1f1c3e0958af8ad9f6ebe10ab442e75de33e91de/src/helpers/execve_hijack.c#L275
status: experimental
tags:
- attack.defense_evasion
- attack.privilege_escalation
title: Triple Cross eBPF Rootkit Execve Hijack
