author: Florian Roth
category: process_creation
date: 2022/06/20
description: Detects events with patterns found in commands used for reconnaissance
  on linux systems
detection:
  condition: selection
  selection:
    CommandLine|contains:
    - ' -name .htpasswd'
    - ' -perm -4000 '
falsepositives:
- Legitimate administration activities
id: 0cf7a157-8879-41a2-8f55-388dd23746b7
level: high
logsource:
  category: process_creation
  product: linux
product: linux
references:
- https://github.com/sleventyeleven/linuxprivchecker/blob/0d701080bbf92efd464e97d71a70f97c6f2cd658/linuxprivchecker.py
status: experimental
tags:
- attack.reconnaissance
- attack.t1592.004
- attack.credential_access
- attack.t1552.001
title: Linux Recon Indicators
