author: "\xD6mer G\xFCnal, oscd.community"
category: process_creation
date: 2020/10/06
description: Detects process discovery commands. Adversaries may attempt to get information
  about running processes on a system. Information obtained could be used to gain
  an understanding of common software/applications running on systems within the network
detection:
  condition: selection
  selection:
    Image|endswith:
    - /ps
    - /top
falsepositives:
- Legitimate administration activities
id: 4e2f5868-08d4-413d-899f-dc2f1508627b
level: informational
logsource:
  category: process_creation
  product: linux
modified: 2022/07/07
product: linux
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1057/T1057.md
status: stable
tags:
- attack.discovery
- attack.t1057
title: Process Discovery
