author: Florian Roth
category: process_creation
date: 2021/10/26
description: Detects command line parameters or strings often used by crypto miners
detection:
  condition: selection
  selection:
    CommandLine|contains:
    - ' --cpu-priority='
    - --donate-level=0
    - ' -o pool.'
    - ' --nicehash'
    - ' --algo=rx/0 '
    - stratum+tcp://
    - stratum+udp://
    - sh -c /sbin/modprobe msr allow_writes=on
    - LS1kb25hdGUtbGV2ZWw9
    - 0tZG9uYXRlLWxldmVsP
    - tLWRvbmF0ZS1sZXZlbD
    - c3RyYXR1bSt0Y3A6Ly
    - N0cmF0dW0rdGNwOi8v
    - zdHJhdHVtK3RjcDovL
    - c3RyYXR1bSt1ZHA6Ly
    - N0cmF0dW0rdWRwOi8v
    - zdHJhdHVtK3VkcDovL
falsepositives:
- Legitimate use of crypto miners
id: 9069ea3c-b213-4c52-be13-86506a227ab1
level: high
logsource:
  category: process_creation
  product: linux
product: linux
references:
- https://www.poolwatch.io/coin/monero
status: experimental
title: Linux Crypto Mining Indicators
