author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research), MSTIC
category: process_creation
date: 2021/10/15
description: Rule to detect the use of the SCX RunAsProvider Invoke_ExecuteShellCommand
  to execute any UNIX/Linux command using the /bin/sh shell. SCXcore, started as the
  Microsoft Operations Manager UNIX/Linux Agent, is now used in a host of products
  including Microsoft Operations Manager. Microsoft Azure, and Microsoft Operations
  Management Suite.
detection:
  condition: selection
  selection:
    CommandLine|contains: /bin/sh
    CurrentDirectory: /var/opt/microsoft/scx/tmp
    LogonId: '0'
    User: root
falsepositives:
- Legitimate use of SCX RunAsProvider Invoke_ExecuteShellCommand.
id: 21541900-27a9-4454-9c4c-3f0a4240344a
level: high
logsource:
  category: process_creation
  product: linux
product: linux
references:
- https://www.wiz.io/blog/omigod-critical-vulnerabilities-in-omi-azure
- https://github.com/Azure/Azure-Sentinel/pull/3059
status: experimental
tags:
- attack.privilege_escalation
- attack.initial_access
- attack.execution
- attack.t1068
- attack.t1190
- attack.t1203
title: OMIGOD SCX RunAsProvider ExecuteShellCommand
