author: Florian Roth, Nasreddine Bencherchali (update)
category: process_creation
date: 2021/10/15
description: Detects suspicious sub processes of web server processes
detection:
  condition: 1 of selection_* and sub_processes
  selection_general:
    ParentImage|endswith:
    - /httpd
    - /lighttpd
    - /nginx
    - /apache2
    - /node
    - /caddy
  selection_tomcat:
    ParentCommandLine|contains|all:
    - /bin/java
    - tomcat
  selection_websphere:
    ParentCommandLine|contains|all:
    - /bin/java
    - websphere
  sub_processes:
    Image|endswith:
    - /whoami
    - /ifconfig
    - /usr/bin/ip
    - /usr/sbin/ip
    - /bin/uname
    - /bin/cat
    - /bin/crontab
    - /hostname
    - /iptables
    - /netstat
    - /pwd
    - /route
falsepositives:
- Web applications that invoke Linux command line tools
id: 818f7b24-0fba-4c49-a073-8b755573b9c7
level: high
logsource:
  category: process_creation
  product: linux
modified: 2022/08/01
product: linux
references:
- https://www.acunetix.com/blog/articles/web-shells-101-using-php-introduction-web-shells-part-2/
- https://media.defense.gov/2020/Jun/09/2002313081/-1/-1/0/CSI-DETECT-AND-PREVENT-WEB-SHELL-MALWARE-20200422.PDF
status: experimental
tags:
- attack.persistence
- attack.t1505.003
title: Linux Webshell Indicators
