author: "\xD6mer G\xFCnal and remotephone, oscd.community"
category: process_creation
date: 2020/10/06
description: Detects enumeration of local network configuration
detection:
  condition: 1 of selection*
  selection1:
    Image|endswith:
    - /firewall-cmd
    - /ufw
    - /iptables
    - /netstat
    - /ss
    - /ip
    - /ifconfig
    - /systemd-resolve
    - /route
  selection2:
    CommandLine|contains: /etc/resolv.conf
falsepositives:
- Legitimate administration activities
id: e7bd1cfa-b446-4c88-8afb-403bcd79e3fa
level: informational
logsource:
  category: process_creation
  product: linux
modified: 2022/07/11
product: linux
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1016/T1016.md
status: test
tags:
- attack.discovery
- attack.t1016
title: System Network Discovery - Linux
