author: Alejandro Ortuno, oscd.community
category: process_creation
date: 2020/10/08
description: Detects enumeration of local systeam accounts. This information can help
  adversaries determine which local accounts exist on a system to aid in follow-on
  behavior.
detection:
  condition: 1 of selection*
  selection_1:
    Image|endswith: /lastlog
  selection_2:
    CommandLine|contains: '''x:0:'''
  selection_3:
    CommandLine|contains:
    - /etc/passwd
    - /etc/sudoers
    Image|endswith: /cat
  selection_4:
    Image|endswith: /id
  selection_5:
    CommandLine|contains: -u
    Image|endswith: /lsof
falsepositives:
- Legitimate administration activities
id: b45e3d6f-42c6-47d8-a478-df6bd6cf534c
level: low
logsource:
  category: process_creation
  product: linux
modified: 2022/07/07
product: linux
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1087.001/T1087.001.md
status: test
tags:
- attack.discovery
- attack.t1087.001
title: Local System Accounts Discovery
