author: Florian Roth
category: registry_event
date: 2017/06/01
description: Detects Pandemic Windows Implant
detection:
  condition: selection
  selection:
    winlog.event_data.TargetObject|contains: \SYSTEM\CurrentControlSet\services\null\Instance
falsepositives:
- unknown
fields:
- winlog.event_id
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
- winlog.event_data.Image
- winlog.event_data.User
- winlog.event_data.TargetObject
id: 47e0852a-cf81-4494-a8e6-31864f8c86ed
level: critical
logsource:
  category: registry_event
  product: windows
modified: 2021/09/12
product: windows
references:
- https://wikileaks.org/vault7/#Pandemic
- https://twitter.com/MalwareJake/status/870349480356454401
status: experimental
tags:
- attack.lateral_movement
- attack.t1105
title: Pandemic Registry Key
