author: "J\xE1n Tren\u010Dansk\xFD, frack113, AlertIQ"
category: registry_event
date: 2020/07/28
description: Detects disabling Windows Defender threat protection
detection:
  condition: tamper_registry or selection2
  selection2:
    winlog.event_data.Details: DWORD (0x00000001)
    winlog.event_data.TargetObject:
    - HKLM\SYSTEM\CurrentControlSet\Services\WinDefend
    - HKLM\SOFTWARE\Microsoft\Windows Defender
    - HKLM\SOFTWARE\Policies\Microsoft\Windows Defender
  tamper_registry:
    winlog.event_data.Details: DWORD (0x00000001)
    winlog.event_data.EventType: SetValue
    winlog.event_data.TargetObject:
    - HKLM\SOFTWARE\Policies\Microsoft\Windows Defender\DisableAntiSpyware
    - HKLM\SOFTWARE\Policies\Microsoft\Windows Defender\DisableAntiVirus
falsepositives:
- Administrator actions
id: a64e4198-c1c8-46a5-bc9c-324c86455fd4
level: high
logsource:
  category: registry_event
  product: windows
modified: 2021/10/18
product: windows
references:
- https://docs.microsoft.com/en-us/windows/security/threat-protection/windows-defender-antivirus/troubleshoot-windows-defender-antivirus
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1562.001/T1562.001.md
- https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/
related:
- id: fe34868f-6e0e-4882-81f6-c43aa8f15b62
  type: derived
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001
title: Windows Defender Threat Detection Disabled
