author: Austin Songer
category: registry_event
date: 2021/07/22
description: Detects when a user enables DNS-over-HTTPS. This can be used to hide
  internet activity or be used to hide the process of exfiltrating data. With this
  enabled organization will lose visibility into data such as query type, response
  and originating IP that are used to determine bad actors.
detection:
  condition: selection_edge or selection_chrome or selection_firefox
  selection_chrome:
    winlog.event_data.Details: DWORD (secure)
    winlog.event_data.TargetObject|endswith: \SOFTWARE\Google\Chrome\DnsOverHttpsMode
  selection_edge:
    winlog.event_data.Details: DWORD (1)
    winlog.event_data.TargetObject|endswith: \SOFTWARE\Policies\Microsoft\Edge\BuiltInDnsClientEnabled
  selection_firefox:
    winlog.event_data.Details: DWORD (1)
    winlog.event_data.TargetObject|endswith: \SOFTWARE\Policies\Mozilla\Firefox\DNSOverHTTPS\Enabled
falsepositives:
- Unlikely
id: 04b45a8a-d11d-49e4-9acc-4a1b524407a5
level: medium
logsource:
  category: registry_event
  product: windows
modified: 2021/09/08
product: windows
references:
- https://www.tenforums.com/tutorials/151318-how-enable-disable-dns-over-https-doh-microsoft-edge.html
- https://github.com/elastic/detection-rules/issues/1371
- https://chromeenterprise.google/policies/?policy=DnsOverHttpsMode
- https://admx.help/HKLM/Software/Policies/Mozilla/Firefox/DNSOverHTTPS
status: experimental
tags:
- attack.defense_evasion
- attack.t1140
- attack.t1112
title: DNS-over-HTTPS Enabled by Registry
