author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
category: registry_event
date: 2019/09/12
description: Detects potential malicious modification of the property value of UseLogonCredential
  from HKLM:\SYSTEM\CurrentControlSet\Control\SecurityProviders\WDigest to enable
  clear-text credentials
detection:
  condition: selection
  selection:
    winlog.event_data.TargetObject|endswith: WDigest\UseLogonCredential
falsepositives:
- Unknown
id: d6a9b252-c666-4de6-8806-5561bbbd3bdc
level: high
logsource:
  category: registry_event
  product: windows
modified: 2021/05/27
product: windows
references:
- https://threathunterplaybook.com/notebooks/windows/02_execution/WIN-190511223310.html
status: experimental
tags:
- attack.defense_evasion
- attack.t1112
title: Wdigest Enable UseLogonCredential
