author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
category: registry_event
date: 2019/08/25
description: Detects potential malicious modification of the property value of IsCredGuardEnabled
  from HKLM:\SYSTEM\CurrentControlSet\Control\SecurityProviders\WDigest to disable
  Cred Guard on a system. This is usually used with UseLogonCredential to manipulate
  the caching credentials.
detection:
  condition: selection
  selection:
    winlog.event_data.TargetObject|endswith: \IsCredGuardEnabled
falsepositives:
- Unknown
id: 1a2d6c47-75b0-45bd-b133-2c0be75349fd
level: critical
logsource:
  category: registry_event
  product: windows
product: windows
references:
- https://teamhydra.blog/2020/08/25/bypassing-credential-guard/
status: experimental
tags:
- attack.defense_evasion
- attack.t1112
title: Wdigest CredGuard Registry Modification
