author: Florian Roth
category: registry_event
date: 2020/07/01
description: Detects a suspicious printer driver installation with an empty Manufacturer
  value
detection:
  condition: selection
  selection:
    winlog.event_data.Details: (Empty)
    winlog.event_data.TargetObject|contains|all:
    - \Control\Print\Environments\Windows x64\Drivers
    - \Manufacturer
falsepositives:
- Alerts on legitimate printer drivers that do not set any more details in the Manufacturer
  value
id: e0813366-0407-449a-9869-a2db1119dc41
level: high
logsource:
  category: registry_event
  product: windows
product: windows
references:
- https://twitter.com/SBousseaden/status/1410545674773467140
status: experimental
tags:
- attack.privilege_escalation
- cve.2021.1675
title: Suspicious Printer Driver Empty Manufacturer
