author: Trent Liffick (@tliffick)
category: registry_event
date: 2020/05/22
description: Detects registry changes to Office macro settings
detection:
  condition: sec_settings
  sec_settings:
    winlog.event_data.TargetObject|endswith:
    - \Security\Trusted Documents\TrustRecords
    - \Security\AccessVBOM
    - \Security\VBAWarnings
falsepositives:
- Valid Macros and/or internal documents
id: a166f74e-bf44-409d-b9ba-ea4b2dd8b3cd
level: high
logsource:
  category: registry_event
  product: windows
modified: 2021/07/12
product: windows
references:
- Internal Research
- https://www.mcafee.com/blogs/other-blogs/mcafee-labs/zloader-with-a-new-infection-technique/
status: experimental
tags:
- attack.defense_evasion
- attack.t1112
title: Office Security Settings Changed
