author: Sagie Dulce, Dekel Paz
category: application
date: 2022/01/01
definition: 'Requirements: install and apply the RPC Firewall to all processes with
  "audit:true action:block uuid:378e52b0-c0a9-11cf-822d-00aa0051e40f"'
description: Detects remote RPC calls to create or execute a scheduled task via SASec
detection:
  condition: selection
  selection:
    EventID: 3
    EventLog: RPCFW
    InterfaceUuid: 378e52b0-c0a9-11cf-822d-00aa0051e40f
    OpNum:
    - 0
    - 1
falsepositives:
- Unknown
id: aff229ab-f8cd-447b-b215-084d11e79eb0
level: high
logsource:
  category: application
  definition: 'Requirements: install and apply the RPC Firewall to all processes with
    "audit:true action:block uuid:378e52b0-c0a9-11cf-822d-00aa0051e40f"'
  product: rpc_firewall
modified: 2022/01/01
product: rpc_firewall
references:
- https://attack.mitre.org/techniques/T1053/
- https://attack.mitre.org/tactics/TA0008/
- https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-tsch/d1058a28-7e02-4948-8b8d-4a347fa64931
- https://github.com/jsecurity101/MSRPC-to-ATTACK/blob/ddd4608fe8684fcf2fcf9b48c5f0b3c28097f8a3/documents/MS-TSCH.md
- https://github.com/zeronetworks/rpcfirewall
- https://zeronetworks.com/blog/stopping_lateral_movement_via_the_rpc_firewall/
status: experimental
tags:
- attack.lateral_movement
- attack.t1053
- attack.t1053.002
title: Remote Schedule Task Lateral Movement via SASec
