author: Sagie Dulce, Dekel Paz
category: application
date: 2022/01/01
definition: 'Requirements: install and apply the RPC Firewall to all processes with
  "audit:true action:block uuid:86d35949-83c9-4044-b424-db363231fd0c"'
description: Detects remote RPC calls to create or execute a scheduled task
detection:
  condition: selection
  selection:
    EventID: 3
    EventLog: RPCFW
    InterfaceUuid: 86d35949-83c9-4044-b424-db363231fd0c
    OpNum:
    - 1
    - 3
    - 4
    - 10
    - 11
    - 12
    - 13
    - 14
    - 15
falsepositives:
- Unknown
id: ace3ff54-e7fd-46bd-8ea0-74b49a0aca1d
level: high
logsource:
  category: application
  definition: 'Requirements: install and apply the RPC Firewall to all processes with
    "audit:true action:block uuid:86d35949-83c9-4044-b424-db363231fd0c"'
  product: rpc_firewall
modified: 2022/01/01
product: rpc_firewall
references:
- https://attack.mitre.org/techniques/T1053/
- https://attack.mitre.org/tactics/TA0008/
- https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-tsch/d1058a28-7e02-4948-8b8d-4a347fa64931
- https://github.com/jsecurity101/MSRPC-to-ATTACK/blob/ddd4608fe8684fcf2fcf9b48c5f0b3c28097f8a3/documents/MS-TSCH.md
- https://github.com/zeronetworks/rpcfirewall
- https://zeronetworks.com/blog/stopping_lateral_movement_via_the_rpc_firewall/
status: experimental
tags:
- attack.lateral_movement
- attack.t1053
- attack.t1053.002
title: Remote Schedule Task Lateral Movement via ITaskSchedulerService
