author: Sagie Dulce, Dekel Paz
category: application
date: 2022/01/01
definition: 'Requirements: install and apply the RPC Firewall to all processes with
  "audit:true action:block uuid:1ff70682-0a51-30e8-076d-740be8cee98b"'
description: Detects remote RPC calls to create or execute a scheduled task via ATSvc
detection:
  condition: selection
  selection:
    EventID: 3
    EventLog: RPCFW
    InterfaceUuid: 1ff70682-0a51-30e8-076d-740be8cee98b
    OpNum:
    - 0
    - 1
falsepositives:
- Unknown
id: 0fcd1c79-4eeb-4746-aba9-1b458f7a79cb
level: high
logsource:
  category: application
  definition: 'Requirements: install and apply the RPC Firewall to all processes with
    "audit:true action:block uuid:1ff70682-0a51-30e8-076d-740be8cee98b"'
  product: rpc_firewall
modified: 2022/01/01
product: rpc_firewall
references:
- https://attack.mitre.org/techniques/T1053/
- https://attack.mitre.org/tactics/TA0008/
- https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-tsch/d1058a28-7e02-4948-8b8d-4a347fa64931
- https://github.com/jsecurity101/MSRPC-to-ATTACK/blob/ddd4608fe8684fcf2fcf9b48c5f0b3c28097f8a3/documents/MS-TSCH.md
- https://github.com/zeronetworks/rpcfirewall
- https://zeronetworks.com/blog/stopping_lateral_movement_via_the_rpc_firewall/
status: experimental
tags:
- attack.lateral_movement
- attack.t1053
- attack.t1053.002
title: Remote Schedule Task Lateral Movement via ATSvc
