author: Sagie Dulce, Dekel Paz
category: application
date: 2022/01/01
definition: 'Requirements: install and apply the RPC Firewall to all processes with
  "audit:true action:block uuid:338cd001-2244-31f1-aaaa-900038001003"'
description: Detects remote RPC calls to collect information
detection:
  condition: selection and not filter
  filter:
    OpNum:
    - 6
    - 7
    - 8
    - 13
    - 18
    - 19
    - 21
    - 22
    - 23
    - 35
  selection:
    EventID: 3
    EventLog: RPCFW
    InterfaceUuid: 338cd001-2244-31f1-aaaa-900038001003
falsepositives:
- Remote administration of registry values
id: d8ffe17e-04be-4886-beb9-c1dd1944b9a8
level: high
logsource:
  category: application
  definition: 'Requirements: install and apply the RPC Firewall to all processes with
    "audit:true action:block uuid:338cd001-2244-31f1-aaaa-900038001003"'
  product: rpc_firewall
modified: 2022/01/01
product: rpc_firewall
references:
- https://attack.mitre.org/tactics/TA0007/
- https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-rrp/0fa3191d-bb79-490a-81bd-54c2601b7a78
- https://github.com/jsecurity101/MSRPC-to-ATTACK/blob/ddd4608fe8684fcf2fcf9b48c5f0b3c28097f8a3/documents/MS-RRP.md
- https://github.com/zeronetworks/rpcfirewall
- https://zeronetworks.com/blog/stopping_lateral_movement_via_the_rpc_firewall/
status: experimental
title: Remote Registry Recon
