author: Bailey Bercik '@baileybercik', Mark Morowczynski '@markmorow'
date: 2022/07/28
description: Detects when administrator grants either application permissions (app
  roles) or highly privileged delegated permissions
detection:
  condition: selection
  selection:
    properties.message: Add app role assignment to service principal
falsepositives:
- When the permission is legitimately needed for the app
id: 5aecf3d5-f8a0-48e7-99be-3a759df7358f
level: high
logsource:
  product: microsoft365portal
  service: auditlogs
product: microsoft365portal
references:
- https://docs.microsoft.com/en-us/azure/active-directory/fundamentals/security-operations-applications#application-granted-highly-privileged-permissions
service: auditlogs
status: experimental
tags:
- attack.privilege_escalation
title: App Granted Privileged Delegated Or App Permissions
