author: Mauricio Velazco, frack113
date: 2021/06/01
description: Detects multiple failed logins with multiple valid domain accounts from
  a single source system using the Kerberos protocol.
detection:
  condition:
  - selection and not filter_computer | count(TargetUserName) by IpAddress > 10
  filter_computer:
    winlog.event_data.TargetUserName|endswith: $
  selection:
    winlog.event_data.Status: '0x18'
    winlog.event_id: 4771
  timeframe: 24h
falsepositives:
- Vulnerability scanners
- Misconfigured systems
- Remote administration tools
- VPN terminators
- Multiuser systems like Citrix server farms
id: 5d1d946e-32e6-4d9a-a0dc-0ac022c7eb98
level: medium
logsource:
  product: windows
  service: security
modified: 2021/07/06
product: windows
references:
- https://docs.splunk.com/Documentation/ESSOC/3.22.0/stories/UseCase#Active_directory_password_spraying
service: security
status: experimental
tags:
- attack.t1110.003
- attack.initial_access
- attack.privilege_escalation
title: Valid Users Failing to Authenticate From Single Source Using Kerberos
