author: OTR (Open Threat Research)
date: 2018/11/28
description: Detects the use of the spoolss named pipe over SMB. This can be used
  to trigger the authentication via NTLM of any machine that has the spoolservice
  enabled.
detection:
  condition: selection
  selection:
    winlog.event_data.RelativeTargetName: spoolss
    winlog.event_data.ShareName: \\\\\*\\IPC$
    winlog.event_id: 5145
falsepositives:
- Domain Controllers acting as printer servers too? :)
id: 214e8f95-100a-4e04-bb31-ef6cba8ce07e
level: medium
logsource:
  product: windows
  service: security
modified: 2022/08/11
product: windows
references:
- https://posts.specterops.io/hunting-in-active-directory-unconstrained-delegation-forests-trusts-71f2b33688e1
- https://dirkjanm.io/a-different-way-of-abusing-zerologon/
- https://twitter.com/_dirkjan/status/1309214379003588608
service: security
status: test
tags:
- attack.lateral_movement
- attack.t1021.002
title: DCERPC SMB Spoolss Named Pipe
