author: Florian Roth (rule), Jack Croock (method), Jonhnathan Ribeiro (improvements),
  oscd.community
date: 2017/03/07
definition: The volume of Event ID 4661 is high on Domain Controllers and therefore
  "Audit SAM" and "Audit Kernel Object" advanced audit policy settings are not configured
  in the recommendations for server systems
description: Detects activity as "net user administrator /domain" and "net group domain
  admins /domain"
detection:
  condition: selection
  selection:
    winlog.event_data.AccessMask: '0x2d'
    winlog.event_data.ObjectName|endswith:
    - '-500'
    - '-512'
    winlog.event_data.ObjectName|startswith: S-1-5-21-
    winlog.event_data.ObjectType:
    - SAM_USER
    - SAM_GROUP
    winlog.event_id: 4661
falsepositives:
- Administrator activity
id: 968eef52-9cff-4454-8992-1e74b9cbad6c
level: high
logsource:
  definition: The volume of Event ID 4661 is high on Domain Controllers and therefore
    "Audit SAM" and "Audit Kernel Object" advanced audit policy settings are not configured
    in the recommendations for server systems
  product: windows
  service: security
modified: 2022/08/22
product: windows
references:
- https://findingbad.blogspot.de/2017/01/hunting-what-does-it-look-like.html
service: security
status: test
tags:
- attack.discovery
- attack.t1087.002
- attack.t1069.002
- attack.s0039
title: Reconnaissance Activity
