author: Thomas Patzke, @atc_project (improvements)
date: 2017/02/19
description: An attacker can use the SID history attribute to gain additional privileges.
detection:
  condition: selection1 or (selection2 and not selection3 and not filter_null)
  filter_null:
    SidHistory: null
  selection1:
    winlog.event_id:
    - 4765
    - 4766
  selection2:
    winlog.event_id: 4738
  selection3:
    SidHistory:
    - '-'
    - '%%1793'
falsepositives:
- Migration of an account into a new domain
id: 2632954e-db1c-49cb-9936-67d1ef1d17d2
level: medium
logsource:
  product: windows
  service: security
product: windows
references:
- https://adsecurity.org/?p=1772
service: security
status: stable
tags:
- attack.persistence
- attack.privilege_escalation
- attack.t1134.005
title: Addition of SID History to Active Directory Object
