author: Saw Winn Naung
date: 2021/08/15
description: Checks for event id 1102 which indicates the security event log was cleared.
detection:
  condition: selection
  selection:
    Provider_Name: Microsoft-Windows-Eventlog
    winlog.event_id: 1102
falsepositives:
- Legitimate administrative activity
fields:
- winlog.event_data.SubjectLogonId
- winlog.event_data.SubjectUserName
- winlog.event_data.SubjectUserSid
- winlog.event_data.SubjectDomainName
id: a122ac13-daf8-4175-83a2-72c387be339d
level: medium
logsource:
  product: windows
  service: security
modified: 2021/10/13
product: windows
references:
- https://github.com/Azure/Azure-Sentinel/blob/f99542b94afe0ad2f19a82cc08262e7ac8e1428e/Detections/SecurityEvent/SecurityEventLogCleared.yaml
service: security
status: experimental
tags:
- attack.t1070.001
title: Security Event Log Cleared
