author: Jonathan Cheong, oscd.community
date: 2020/10/13
description: Detects Obfuscated use of Clip.exe to execute PowerShell
detection:
  condition: selection
  selection:
    Provider_Name: Microsoft-Windows-Security-Auditing
    winlog.event_data.ServiceFileName|contains|all:
    - cmd
    - '&&'
    - 'clipboard]::'
    winlog.event_id: 4697
falsepositives:
- Unknown
id: 4edf51e1-cb83-4e1a-bc39-800e396068e3
level: high
logsource:
  product: windows
  service: security
modified: 2022/02/24
product: windows
references:
- https://github.com/Neo23x0/sigma/issues/1009
related:
- id: f7385ee2-0e0c-11eb-adc1-0242ac120002
  type: derived
service: security
status: experimental
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
title: Invoke-Obfuscation CLIP+ Launcher
