author: Samir Bousseaden
date: 2019/04/03
definition: The advanced audit policy setting "Object Access > Audit Detailed File
  Share" must be configured for Success/Failure
description: Detects remote task creation via at.exe or API interacting with ATSVC
  namedpipe
detection:
  condition: selection
  selection:
    Accesses|contains: WriteData
    winlog.event_data.RelativeTargetName: atsvc
    winlog.event_data.ShareName: \\\\\*\\IPC$
    winlog.event_id: 5145
falsepositives:
- Unknown
id: f6de6525-4509-495a-8a82-1f8b0ed73a00
level: medium
logsource:
  definition: The advanced audit policy setting "Object Access > Audit Detailed File
    Share" must be configured for Success/Failure
  product: windows
  service: security
modified: 2022/08/11
product: windows
references:
- https://blog.menasec.net/2019/03/threat-hunting-25-scheduled-tasks-for.html
service: security
status: test
tags:
- attack.lateral_movement
- attack.persistence
- car.2013-05-004
- car.2015-04-001
- attack.t1053.002
title: Remote Task Creation via ATSVC Named Pipe
