author: Florian Roth
date: 2017/02/19
description: This method uses uncommon error codes on failed logons to determine suspicious
  activity and tampering with accounts that have been disabled or somehow restricted.
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.SubjectUserSid: S-1-0-0
  selection:
    winlog.event_data.Status:
    - '0xC0000072'
    - '0xC000006F'
    - '0xC0000070'
    - '0xC0000413'
    - '0xC000018C'
    - '0xC000015B'
    winlog.event_id:
    - 4625
    - 4776
falsepositives:
- User using a disabled account
id: 9eb99343-d336-4020-a3cd-67f3819e68ee
level: medium
logsource:
  product: windows
  service: security
modified: 2022/06/29
product: windows
references:
- https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4625
- https://twitter.com/SBousseaden/status/1101431884540710913
service: security
status: experimental
tags:
- attack.persistence
- attack.defense_evasion
- attack.privilege_escalation
- attack.initial_access
- attack.t1078
title: Account Tampering - Suspicious Failed Logon Reasons
