author: Florian Roth
date: 2017/03/14
description: This rule triggers on user accounts that are added to the local Administrators
  group, which could be legitimate activity or a sign of privilege escalation activity
detection:
  condition: selection and (1 of selection_group*) and not filter
  filter:
    winlog.event_data.SubjectUserName|endswith: $
  selection:
    Provider_Name: Microsoft-Windows-Security-Auditing
    winlog.event_id: 4732
  selection_group1:
    winlog.event_data.TargetUserName|startswith: Administr
  selection_group2:
    TargetSid: S-1-5-32-544
falsepositives:
- Legitimate administrative activity
id: c265cf08-3f99-46c1-8d59-328247057d57
level: medium
logsource:
  product: windows
  service: security
modified: 2021/01/17
product: windows
service: security
status: stable
tags:
- attack.privilege_escalation
- attack.t1078
- attack.persistence
- attack.t1098
title: User Added to Local Administrators
