author: Roberto Rodriguez @Cyb3rWard0g, Open Threat Research (OTR)
date: 2020/10/20
description: Detects the registration of the security event source VSSAudit. It would
  usually trigger when volume shadow copy operations happen.
detection:
  condition: selection
  selection:
    AuditSourceName: VSSAudit
    Provider_Name: Microsoft-Windows-Security-Auditing
    winlog.event_id:
    - 4904
    - 4905
falsepositives:
- Legitimate use of VSSVC. Maybe backup operations. It would usually be done by C:\Windows\System32\VSSVC.exe.
id: e9faba72-4974-4ab2-a4c5-46e25ad59e9b
level: informational
logsource:
  product: windows
  service: security
modified: 2022/04/28
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1003.002/T1003.002.md#atomic-test-3---esentutlexe-sam-copy
service: security
status: experimental
tags:
- attack.credential_access
- attack.t1003.002
title: VSSAudit Security Event Source Registration
