author: Benjamin Delpy, Florian Roth, Scott Dermott, Sorina Ionescu
date: 2018/06/03
description: Detects Mimikatz DC sync security events
detection:
  condition: selection and not 1 of filter*
  filter1:
    winlog.event_data.SubjectDomainName: Window Manager
  filter2:
    winlog.event_data.SubjectUserName|startswith:
    - NT AUT
    - MSOL_
  filter3:
    winlog.event_data.SubjectUserName|endswith: $
  selection:
    winlog.event_data.AccessMask: '0x100'
    winlog.event_data.Properties|contains:
    - Replicating Directory Changes All
    - 1131f6ad-9c07-11d1-f79f-00c04fc2dcd2
    - 1131f6aa-9c07-11d1-f79f-00c04fc2dcd2
    - 9923a32a-3607-11d2-b9be-0000f87a36b2
    - 89e95b76-444d-4c62-991a-0facbeda640c
    winlog.event_id: 4662
falsepositives:
- Valid DC Sync that is not covered by the filters; please report
- Local Domain Admin account used for Azure AD Connect
id: 611eab06-a145-4dfa-a295-3ccc5c20f59a
level: high
logsource:
  product: windows
  service: security
modified: 2022/04/26
product: windows
references:
- https://twitter.com/gentilkiwi/status/1003236624925413376
- https://gist.github.com/gentilkiwi/dcc132457408cf11ad2061340dcb53c2
- https://blog.blacklanternsecurity.com/p/detecting-dcsync?s=r
- https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4662
service: security
status: experimental
tags:
- attack.credential_access
- attack.s0002
- attack.t1003.006
title: Mimikatz DC Sync
