author: Arun Chauhan
date: 2021/10/04
description: The attacker might use LOLBAS nltest.exe for discovery of domain controllers,
  domain trusts, parent domain and the current user permissions.
detection:
  condition: selection
  selection:
    winlog.event_data.ProcessName|endswith: nltest.exe
    winlog.event_data.Status: '0x0'
    winlog.event_id: 4689
falsepositives:
- Red team activity
- Rare legitimate use by an administrator
fields:
- winlog.event_data.SubjectUserName
- winlog.event_data.SubjectDomainName
id: eeb66bbb-3dde-4582-815a-584aee9fe6d1
level: high
logsource:
  product: windows
  service: security
product: windows
references:
- https://jpcertcc.github.io/ToolAnalysisResultSheet/details/nltest.htm
- https://attack.mitre.org/software/S0359/
service: security
status: experimental
tags:
- attack.discovery
- attack.t1482
- attack.t1018
- attack.t1016
title: Correct Execution of Nltest.exe
