author: Roberto Rodriguez @Cyb3rWard0g
date: 2019/08/12
description: Detects non-system users failing to get a handle of the SCM database.
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.SubjectLogonId: '0x3e4'
  selection:
    winlog.event_data.AccessMask: '0xf003f'
    winlog.event_data.ObjectName: ServicesActive
    winlog.event_data.ObjectType: SC_MANAGER OBJECT
    winlog.event_id: 4656
falsepositives:
- Unknown
id: 13addce7-47b2-4ca0-a98f-1de964d1d669
level: medium
logsource:
  product: windows
  service: security
modified: 2022/07/11
product: windows
references:
- https://threathunterplaybook.com/notebooks/windows/07_discovery/WIN-190826010110.html
service: security
status: experimental
tags:
- attack.discovery
- attack.t1010
title: SCM Database Handle Failure
