author: Roberto Rodriguez @Cyb3rWard0g
date: 2019/09/12
description: Detects basic PowerShell Remoting (WinRM) by monitoring for network inbound
  connections to ports 5985 OR 5986
detection:
  condition: selection
  selection:
    DestPort:
    - 5985
    - 5986
    LayerRTID: 44
    winlog.event_id: 5156
falsepositives:
- Legitimate use of remote PowerShell execution
id: 13acf386-b8c6-4fe0-9a6e-c4756b974698
level: high
logsource:
  product: windows
  service: security
modified: 2021/05/21
product: windows
references:
- https://threathunterplaybook.com/notebooks/windows/02_execution/WIN-190511223310.html
service: security
status: experimental
tags:
- attack.execution
- attack.t1059.001
title: Remote PowerShell Sessions Network Connections (WinRM)
