author: Florian Roth, Bartlomiej Czyz (@bczyz1)
date: 2019/03/04
definition: 'Requirements: Audit Policy : Audit Other Object Access Events > Success'
description: Detects the deactivation and disabling of the Scheduled defragmentation
  task as seen by Slingshot APT group
detection:
  condition: selection
  selection:
    TaskName: \Microsoft\Windows\Defrag\ScheduledDefrag
    winlog.event_id: 4701
falsepositives:
- Unknown
id: c5a178bf-9cfb-4340-b584-e4df39b6a3e7
level: medium
logsource:
  definition: 'Requirements: Audit Policy : Audit Other Object Access Events > Success'
  product: windows
  service: security
modified: 2021/09/19
product: windows
references:
- https://securelist.com/apt-slingshot/84312/
related:
- id: 958d81aa-8566-4cea-a565-59ccd4df27b0
  type: derived
service: security
status: experimental
tags:
- attack.persistence
- attack.t1053
- attack.s0111
title: Defrag Deactivation
