author: Mauricio Velazco
date: 2021/06/01
description: Detects a source system failing to authenticate against a remote host
  with multiple users.
detection:
  condition: selection1 and not filter | count(TargetUserName) by IpAddress > 10
  filter:
    winlog.event_data.IpAddress: '-'
  selection1:
    winlog.event_data.LogonType: 3
    winlog.event_id: 4625
  timeframe: 24h
falsepositives:
- Terminal servers
- Jump servers
- Other multiuser systems like Citrix server farms
- Workstations with frequently changing users
id: add2ef8d-dc91-4002-9e7e-f2702369f53a
level: medium
logsource:
  product: windows
  service: security
modified: 2021/07/09
product: windows
references:
- https://docs.splunk.com/Documentation/ESSOC/3.22.0/stories/UseCase#Active_directory_password_spraying
service: security
status: experimental
tags:
- attack.t1110.003
- attack.initial_access
- attack.privilege_escalation
title: Multiple Users Remotely Failing To Authenticate From Single Source
