author: Nasreddine Bencherchali
date: 2022/08/03
description: Detects the default "UserName" used by the DiagTrackEoP POC
detection:
  condition: selection
  selection:
    TargetOutboundUserName: thisisnotvaliduser
    winlog.event_data.LogonType: 9
    winlog.event_id: 4624
falsepositives:
- Unlikely
id: 2111118f-7e46-4fc8-974a-59fd8ec95196
level: critical
logsource:
  product: windows
  service: security
product: windows
references:
- https://github.com/Wh04m1001/DiagTrackEoP/blob/3a2fc99c9700623eb7dc7d4b5f314fd9ce5ef51f/main.cpp#L46
service: security
status: experimental
tags:
- attack.privilege_escalation
title: DiagTrackEoP Default Login Username
