author: Chakib Gzenayi (@Chak092), Hosni Mribah
date: 2020/05/11
definition: The advanced audit policy setting "Windows Filtering Platform > Filtering
  Platform Connection" must be configured for Success
description: Detects enumeration of the global catalog (that can be performed using
  BloodHound or others AD reconnaissance tools). Adjust Threshold according to domain
  width.
detection:
  condition: selection | count() by SourceAddress > 2000
  selection:
    DestPort:
    - 3268
    - 3269
    winlog.event_id: 5156
  timeframe: 1h
falsepositives:
- Exclude known DCs.
id: 619b020f-0fd7-4f23-87db-3f51ef837a34
level: medium
logsource:
  definition: The advanced audit policy setting "Windows Filtering Platform > Filtering
    Platform Connection" must be configured for Success
  product: windows
  service: security
modified: 2022/08/15
product: windows
references:
- https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-5156
service: security
status: experimental
tags:
- attack.discovery
- attack.t1087.002
title: Enumeration via the Global Catalog
