author: Thomas Patzke
date: 2017/06/14
description: Detects renaming of file while deletion with SDelete tool.
detection:
  condition: selection
  selection:
    winlog.event_data.ObjectName|endswith:
    - .AAA
    - .ZZZ
    winlog.event_id:
    - 4656
    - 4663
    - 4658
falsepositives:
- Legitimate usage of SDelete
id: 39a80702-d7ca-4a83-b776-525b1f86a36d
level: medium
logsource:
  product: windows
  service: security
modified: 2021/11/27
product: windows
references:
- https://jpcertcc.github.io/ToolAnalysisResultSheet/details/sdelete.htm
- https://www.jpcert.or.jp/english/pub/sr/ir_research.html
- https://docs.microsoft.com/en-gb/sysinternals/downloads/sdelete
service: security
status: test
tags:
- attack.impact
- attack.defense_evasion
- attack.t1070.004
- attack.t1027.005
- attack.t1485
- attack.t1553.002
- attack.s0195
title: Secure Deletion with SDelete
