author: Samir Bousseaden, wagga
date: 2019/04/03
definition: The advanced audit policy setting "Object Access > Audit Detailed File
  Share" must be configured for Success/Failure
description: Detect AD credential dumping using impacket secretdump HKTL
detection:
  condition: selection
  selection:
    winlog.event_data.RelativeTargetName|contains|all:
    - SYSTEM32\
    - .tmp
    winlog.event_data.ShareName: \\\\\*\\ADMIN$
    winlog.event_id: 5145
falsepositives:
- Unknown
id: 252902e3-5830-4cf6-bf21-c22083dfd5cf
level: high
logsource:
  definition: The advanced audit policy setting "Object Access > Audit Detailed File
    Share" must be configured for Success/Failure
  product: windows
  service: security
modified: 2022/08/11
product: windows
references:
- https://blog.menasec.net/2019/02/threat-huting-10-impacketsecretdump.html
service: security
status: experimental
tags:
- attack.credential_access
- attack.t1003.002
- attack.t1003.004
- attack.t1003.003
title: Possible Impacket SecretDump Remote Activity
