author: '@SBousseaden, Florian Roth'
date: 2022/04/27
description: Detects logon events that have characteristics of events generated during
  an attack with KrbRelayUp and the like
detection:
  condition: selection
  selection:
    winlog.event_data.AuthenticationPackageName: Kerberos
    winlog.event_data.IpAddress: 127.0.0.1
    winlog.event_data.LogonType: 3
    winlog.event_data.TargetUserSid|endswith: '-500'
    winlog.event_data.TargetUserSid|startswith: S-1-5-21-
    winlog.event_id: 4624
falsepositives:
- Unknown
id: 749c9f5e-b353-4b90-a9c1-05243357ca4b
level: high
logsource:
  product: windows
  service: security
product: windows
references:
- https://twitter.com/sbousseaden/status/1518976397364056071?s=12&t=qKO5eKHvWhAP19a50FTZ7g
- https://github.com/elastic/detection-rules/blob/fb6ee2c69864ffdfe347bf3b050cb931f53067a6/rules/windows/privilege_escalation_krbrelayup_suspicious_logon.toml
service: security
status: experimental
tags:
- attack.privilege_escalation
- attack.credential_access
title: KrbRelayUp Attack Pattern
