author: Samir Bousseaden
date: 2019/04/03
definition: The advanced audit policy setting "Object Access > Audit Detailed File
  Share" must be configured for Success/Failure
description: Detect lateral movement using GPO scheduled task, usually used to deploy
  ransomware at scale
detection:
  condition: selection
  selection:
    Accesses|contains:
    - WriteData
    - '%%4417'
    winlog.event_data.RelativeTargetName|endswith: ScheduledTasks.xml
    winlog.event_data.ShareName: \\\\\*\\SYSVOL
    winlog.event_id: 5145
falsepositives:
- If the source IP is not localhost then it's super suspicious, better to monitor
  both local and remote changes to GPO scheduledtasks
id: a8f29a7b-b137-4446-80a0-b804272f3da2
level: high
logsource:
  definition: The advanced audit policy setting "Object Access > Audit Detailed File
    Share" must be configured for Success/Failure
  product: windows
  service: security
modified: 2021/11/27
product: windows
references:
- https://twitter.com/menasec1/status/1106899890377052160
- https://www.secureworks.com/blog/ransomware-as-a-distraction
service: security
status: test
tags:
- attack.persistence
- attack.lateral_movement
- attack.t1053.005
title: Persistence and Execution at Scale via GPO Scheduled Task
