author: Chakib Gzenayi (@Chak092), Hosni Mribah
date: 2020/05/06
description: Alerts on Metasploit host's authentications on the domain.
detection:
  condition: 1 of selection*
  selection1:
    winlog.event_data.AuthenticationPackageName: NTLM
    winlog.event_data.LogonType: 3
    winlog.event_data.WorkstationName|re: ^[A-Za-z0-9]{16}$
    winlog.event_id:
    - 4625
    - 4624
  selection2:
    winlog.event_data.ProcessName: null
    winlog.event_data.Workstation|re: ^[A-Za-z0-9]{16}$
    winlog.event_id: 4776
falsepositives:
- Linux hostnames composed of 16 characters.
id: 72124974-a68b-4366-b990-d30e0b2a190d
level: high
logsource:
  product: windows
  service: security
modified: 2021/07/07
product: windows
references:
- https://github.com/rapid7/metasploit-framework/blob/1416b5776d963f21b7b5b45d19f3e961201e0aed/lib/rex/proto/smb/client.rb
service: security
status: experimental
tags:
- attack.lateral_movement
- attack.t1021.002
title: Metasploit SMB Authentication
