author: NVISO
date: 2020/05/06
description: A login from a public IP can indicate a misconfigured firewall or network
  boundary.
detection:
  condition: selection and not 1 of ip_*
  ip_privatev4:
    winlog.event_data.IpAddress|startswith:
    - '10.'
    - 192.168.
    - 172.16.
    - 172.17.
    - 172.18.
    - 172.19.
    - 172.20.
    - 172.21.
    - 172.22.
    - 172.23.
    - 172.24.
    - 172.25.
    - 172.26.
    - 172.27.
    - 172.28.
    - 172.29.
    - 172.30.
    - 172.31.
    - '127.'
    - 169.254.
  ip_privatev6:
  - winlog.event_data.IpAddress: ::1
  - winlog.event_data.IpAddress|startswith:
    - 'fe80::'
    - 'fc00::'
  ip_unknown:
    winlog.event_data.IpAddress|contains: '-'
  selection:
    winlog.event_id: 4625
falsepositives:
- Legitimate logon attempts over the internet
- IPv4-to-IPv6 mapped IPs
id: f88e112a-21aa-44bd-9b01-6ee2a2bbbed1
level: medium
logsource:
  product: windows
  service: security
modified: 2021/11/27
product: windows
service: security
status: test
tags:
- attack.initial_access
- attack.persistence
- attack.t1078
- attack.t1190
- attack.t1133
title: Failed Logon From Public IP
