author: Vasiliy Burov, oscd.community
date: 2020/10/16
definition: 'Requirements: Audit Policy : Policies/Windows Settings/Security Settings/Local
  Policies/Audit Policy/Audit object access, Policies/Windows Settings/Security Settings/Advanced
  Audit Policy Configuration/Object Access'
description: Detects multiple file rename or delete events occurrence within a specified
  period of time by a same user (these events may signalize about ransomware activity).
detection:
  condition: selection | count() by SubjectLogonId > 10
  selection:
    AccessList: '%%1537'
    Keywords: '0x8020000000000000'
    winlog.event_data.ObjectType: File
    winlog.event_id: 4663
  timeframe: 30s
falsepositives:
- Software uninstallation
- Files restore activities
id: 97919310-06a7-482c-9639-92b67ed63cf8
level: medium
logsource:
  definition: 'Requirements: Audit Policy : Policies/Windows Settings/Security Settings/Local
    Policies/Audit Policy/Audit object access, Policies/Windows Settings/Security
    Settings/Advanced Audit Policy Configuration/Object Access'
  product: windows
  service: security
modified: 2021/11/27
product: windows
references:
- https://www.manageengine.com/data-security/how-to/how-to-detect-ransomware-attacks.html
service: security
status: test
tags:
- attack.impact
- attack.t1486
title: Suspicious Multiple File Rename Or Delete Occurred
