author: Austin Songer
date: 2021/08/23
description: Detects when an Google Workspace user is granted admin privileges.
detection:
  condition: selection
  selection:
    eventName:
    - GRANT_DELEGATED_ADMIN_PRIVILEGES
    - GRANT_ADMIN_PRIVILEGE
    eventService: admin.googleapis.com
falsepositives:
- Google Workspace admin role privileges, may be modified by system administrators.
id: 2d1b83e4-17c6-4896-a37b-29140b40a788
level: medium
logsource:
  product: google_workspace
  service: google_workspace.admin
product: google_workspace
references:
- https://cloud.google.com/logging/docs/audit/gsuite-audit-logging#3
- https://developers.google.com/admin-sdk/reports/v1/appendix/activity/admin-user-settings#GRANT_ADMIN_PRIVILEGE
service: google_workspace.admin
status: experimental
tags:
- attack.persistence
- attack.t1098
title: Google Workspace User Granted Admin Privileges
