author: Austin Songer
date: 2021/08/24
description: Detects when an a role privilege is deleted in Google Workspace.
detection:
  condition: selection
  selection:
    eventName: REMOVE_PRIVILEGE
    eventService: admin.googleapis.com
falsepositives:
- Unknown
id: bf638ef7-4d2d-44bb-a1dc-a238252e6267
level: medium
logsource:
  product: google_workspace
  service: google_workspace.admin
product: google_workspace
references:
- https://cloud.google.com/logging/docs/audit/gsuite-audit-logging#3
- https://developers.google.com/admin-sdk/reports/v1/appendix/activity/admin-delegated-admin-settings
service: google_workspace.admin
status: experimental
tags:
- attack.impact
title: Google Workspace Role Privilege Deleted
