author: Florian Roth
category: network_connection
date: 2021/10/26
description: Detects process connections to a Monero crypto mining pool
detection:
  condition: selection
  selection:
    DestinationHostname:
    - pool.minexmr.com
    - fr.minexmr.com
    - de.minexmr.com
    - sg.minexmr.com
    - ca.minexmr.com
    - us-west.minexmr.com
    - pool.supportxmr.com
    - mine.c3pool.com
    - xmr-eu1.nanopool.org
    - xmr-eu2.nanopool.org
    - xmr-us-east1.nanopool.org
    - xmr-us-west1.nanopool.org
    - xmr-asia1.nanopool.org
    - xmr-jp1.nanopool.org
    - xmr-au1.nanopool.org
    - xmr.2miners.com
    - xmr.hashcity.org
    - xmr.f2pool.com
    - xmrpool.eu
    - pool.hashvault.pro
    - moneroocean.stream
    - monerocean.stream
falsepositives:
- Legitimate use of crypto miners
id: a46c93b7-55ed-4d27-a41b-c259456c4746
level: high
logsource:
  category: network_connection
  product: linux
product: linux
references:
- https://www.poolwatch.io/coin/monero
status: stable
title: Linux Crypto Mining Pool Connections
