author: Florian Roth
category: driver_load
date: 2022/07/26
description: Detects the load of a signed WinRing0 driver often used by threat actors,
  crypto miners (XMRIG) or malware for privilege escalation
detection:
  condition: 1 of selection*
  selection_name:
    winlog.event_data.ImageLoaded|endswith:
    - \WinRing0x64.sys
    - \WinRing0.sys
    - \WinRing0.dll
    - \WinRing0x64.dll
  selection_other:
    IMPHASH: d41fa95d4642dc981f10de36f4dc8cd7
  selection_sysmon:
    winlog.event_data.Hashes|contains: IMPHASH=D41FA95D4642DC981F10DE36F4DC8CD7
falsepositives:
- Unknown
id: 1a42dfa6-6cb2-4df9-9b48-295be477e835
level: high
logsource:
  category: driver_load
  product: windows
product: windows
references:
- https://github.com/xmrig/xmrig/tree/master/bin/WinRing0
status: experimental
tags:
- attack.privilege_escalation
- attack.t1543.003
title: Vulnerable WinRing0 Driver Load
