author: Teymur Kheirkhabarov, Ecco, Florian Roth
category: driver_load
date: 2019/10/26
description: Detects the use of getsystem Meterpreter/Cobalt Strike command by detecting
  a specific service installation
detection:
  condition: selection
  selection:
  - winlog.event_data.ImagePath|contains|all:
    - cmd
    - /c
    - echo
    - \pipe\
  - winlog.event_data.ImagePath|contains|all:
    - '%COMSPEC%'
    - /c
    - echo
    - \pipe\
  - winlog.event_data.ImagePath|contains|all:
    - cmd.exe
    - /c
    - echo
    - \pipe\
  - winlog.event_data.ImagePath|contains|all:
    - rundll32
    - .dll,a
    - '/p:'
falsepositives:
- Highly unlikely
fields:
- winlog.ComputerName
- winlog.event_data.SubjectDomainName
- winlog.event_data.SubjectUserName
- winlog.event_data.ImagePath
id: d585ab5a-6a69-49a8-96e8-4a726a54de46
level: critical
logsource:
  category: driver_load
  product: windows
modified: 2021/09/21
product: windows
references:
- https://speakerdeck.com/heirhabarov/hunting-for-privilege-escalation-in-windows-environment
- https://blog.cobaltstrike.com/2014/04/02/what-happens-when-i-type-getsystem/
related:
- id: 843544a7-56e0-4dcc-a44f-5cc266dd97d6
  type: derived
tags:
- attack.privilege_escalation
- attack.t1134.001
- attack.t1134.002
title: Meterpreter or Cobalt Strike Getsystem Service Installation
