author: Florian Roth
category: driver_load
date: 2017/02/12
description: Detects a driver load from a temporary directory
detection:
  condition: selection
  selection:
    winlog.event_data.ImageLoaded|contains: \Temp\
falsepositives:
- there is a relevant set of false positives depending on applications in the environment
id: 2c4523d5-d481-4ed0-8ec3-7fbf0cb41a75
level: high
logsource:
  category: driver_load
  product: windows
modified: 2020/08/23
product: windows
tags:
- attack.persistence
- attack.privilege_escalation
- attack.t1543.003
title: Suspicious Driver Load from Temp
