author: Nasreddine Bencherchali
category: driver_load
date: 2022/08/18
description: Detects the load of HackSys Extreme Vulnerable Driver which is an intentionally
  vulnerable Windows driver developed for security enthusiasts to learn and polish
  their exploitation skills at Kernel level and often abused by threat actors
detection:
  condition: 1 of selection*
  selection_name:
    winlog.event_data.ImageLoaded|endswith: \HEVD.sys
  selection_other:
    IMPHASH:
    - f26d0b110873a1c7d8c4f08fbeab89c5
    - c46ea2e651fd5f7f716c8867c6d13594
  selection_sysmon:
    winlog.event_data.Hashes|contains:
    - IMPHASH=f26d0b110873a1c7d8c4f08fbeab89c5
    - IMPHASH=c46ea2e651fd5f7f716c8867c6d13594
falsepositives:
- Unlikely
id: 295c9289-acee-4503-a571-8eacaef36b28
level: high
logsource:
  category: driver_load
  product: windows
product: windows
references:
- https://github.com/hacksysteam/HackSysExtremeVulnerableDriver
status: experimental
tags:
- attack.privilege_escalation
- attack.t1543.003
title: Vulnerable HackSys Extreme Vulnerable Driver Load
