author: Austin Clark
category: accounting
date: 2019/08/12
description: Find local accounts being created or modified as well as remote authentication
  configurations
detection:
  condition: keywords
  keywords:
  - username
  - aaa
falsepositives:
- When remote authentication is in place, this should not change often
fields:
- CmdSet
id: 6d844f0f-1c18-41af-8f19-33e7654edfc3
level: high
logsource:
  category: accounting
  product: cisco
  service: aaa
modified: 2020/09/02
product: cisco
service: aaa
status: experimental
tags:
- attack.persistence
- attack.t1136.001
- attack.t1098
title: Cisco Local Accounts
