author: Austin Clark
category: accounting
date: 2019/08/12
description: Clear command history in network OS which is used for defense evasion
detection:
  condition: keywords
  keywords:
  - clear logging
  - clear archive
falsepositives:
- Legitimate administrators may run these commands
fields:
- src
- CmdSet
- User
- Privilege_Level
- Remote_Address
id: ceb407f6-8277-439b-951f-e4210e3ed956
level: high
logsource:
  category: accounting
  product: cisco
  service: aaa
modified: 2020/09/02
product: cisco
service: aaa
status: experimental
tags:
- attack.defense_evasion
- attack.t1070.003
title: Cisco Clear Logs
