author: Thomas Patzke
category: webserver
date: 2017/02/19
description: Detects possible exploitation activity or bugs in a web application
detection:
  condition: selection | count() by clientip > 10
  selection:
    sc-status:
    - 400
    - 401
    - 403
    - 500
  timeframe: 10m
falsepositives:
- Unstable application
- Application that misuses the response codes
fields:
- scr_ip
- http.hostname
- http.url
- http.status
id: 6fdfc796-06b3-46e8-af08-58f3505318af
level: medium
logsource:
  category: webserver
  product: suricata
  service: http
modified: 2020/09/03
product: suricata
service: http
status: experimental
tags:
- attack.initial_access
- attack.t1190
title: Multiple Suspicious Resp Codes Caused by Single Client
