author: Florian Roth
category: webserver
date: 2021/11/17
description: Detects exploitation attempts of Sitecore Experience Platform Pre-Auth
  RCE CVE-2021-42237 found in Report.ashx
detection:
  condition: selection
  selection:
    http.http_method: POST
    http.url|contains: /sitecore/shell/ClientBin/Reporting/Report.ashx
    sc-status: 200
falsepositives:
- Vulnerability Scanning
id: 20c6ed1c-f7f0-4ea3-aa65-4f198e6acb0f
level: high
logsource:
  category: webserver
  product: suricata
  service: http
product: suricata
references:
- https://blog.assetnote.io/2021/11/02/sitecore-rce/
- https://support.sitecore.com/kb?id=kb_article_view&sysparm_article=KB1000776
service: http
status: experimental
tags:
- attack.initial_access
- attack.t1190
title: Sitecore Pre-Auth RCE CVE-2021-42237
