author: Nasreddine Bencherchali
category: webserver
date: 2022/06/14
description: Detects SSTI attempts sent via GET requests in access logs
detection:
  condition: select_method and keywords and not filter
  filter:
    sc-status: 404
  keywords:
  - ={{
  - =%7B%7B
  - =${
  - =$%7B
  - =<%=
  - =%3C%25=
  - =@(
  - freemarker.template.utility.Execute
  - .getClass().forName('javax.script.ScriptEngineManager')
  - T(org.apache.commons.io.IOUtils)
  select_method:
    http.http_method: GET
falsepositives:
- User searches in search boxes of the respective website
- Internal vulnerability scanners can cause some serious FPs when used, if you experience
  a lot of FPs due to this think of adding more filters such as "User Agent" strings
  and more response codes
id: ada3bc4f-f0fd-42b9-ba91-e105e8af7342
level: high
logsource:
  category: webserver
  product: suricata
  service: http
product: suricata
references:
- https://book.hacktricks.xyz/pentesting-web/ssti-server-side-template-injection
- https://github.com/payloadbox/ssti-payloads
service: http
status: experimental
title: Server Side Template Injection Strings
