author: Florian Roth
category: webserver
date: 2017/02/19
description: Detects webshells that use GET requests by keyword searches in URL strings
detection:
  condition: keywords
  keywords:
  - =whoami
  - =net%20user
  - =cmd%20/c%20
falsepositives:
- Web sites like wikis with articles on os commands and pages that include the os
  commands in the URLs
- User searches in search boxes of the respective website
fields:
- scr_ip
- http.hostname
- http.url
- http.status
id: 7ff9db12-1b94-4a79-ba68-a2402c5d6729
level: high
logsource:
  category: webserver
  product: suricata
  service: http
modified: 2020/09/03
product: suricata
service: http
status: experimental
tags:
- attack.persistence
- attack.t1505.003
title: Webshell Detection by Keyword
