author: Florian Roth, Nasreddine Bencherchali
category: webserver
date: 2017/02/19
description: Detects Windows Webshells that use GET requests via access logs
detection:
  condition: select_method and keywords
  keywords:
  - =whoami
  - =net%20user
  - =cmd%20/c%20
  - =powershell%20
  - =tasklist%20
  - =wmic%20
  - =ssh%20
  - =python%20
  - =ipconfig
  - =wget%20
  - =curl%20
  - =certutil
  - =copy%20%5C%5C
  select_method:
    http.http_method: GET
falsepositives:
- Web sites like wikis with articles on os commands and pages that include the os
  commands in the URLs
- User searches in search boxes of the respective website
fields:
- scr_ip
- http.hostname
- http.url
- http.status
id: 7ff9db12-1b94-4a79-ba68-a2402c5d6729
level: high
logsource:
  category: webserver
  product: suricata
  service: http
modified: 2022/06/14
product: suricata
references:
- https://bad-jubies.github.io/RCE-NOW-WHAT/
service: http
status: test
tags:
- attack.persistence
- attack.t1505.003
title: Windows Webshell Strings
