author: Saw Win Naung
category: webserver
date: 2021/08/15
description: Detects XSS that use GET requests by keyword searches in URL strings
detection:
  condition: keywords
  keywords:
  - =cookie
  - =script
  - =onload
  - =onmouseover
falsepositives:
- Java scripts,CSS Files and PNG files
- User searches in search boxes of the respective website
fields:
- scr_ip
- http.hostname
- http.url
- http.status
id: 65354b83-a2ea-4ea6-8414-3ab38be0d409
level: high
logsource:
  category: webserver
  product: suricata
  service: http
product: suricata
service: http
status: experimental
title: Detect XSS Attempts By Keywords
