author: Nasreddine Bencherchali
date: 2022/08/31
description: Detects MSI package installation from suspicious locations
detection:
  condition: selection
  selection:
    Data|contains:
    - \Users\Public\
    - \PerfLogs\
    - \Desktop\
    - \Downloads\
    - \AppData\Local\Temp\
    - C:\Windows\TEMP\
    - \\\\
    Provider_Name: MsiInstaller
    winlog.event_id:
    - 1040
    - 1042
falsepositives:
- Some false positives may occure depending on the environnement
id: c7c8aa1c-5aff-408e-828b-998e3620b341
level: high
logsource:
  product: windows
  service: application
product: windows
references:
- https://www.trendmicro.com/en_us/research/22/h/ransomware-actor-abuses-genshin-impact-anti-cheat-driver-to-kill-antivirus.html
service: application
status: experimental
tags:
- attack.execution
title: MSI Installation From Suspicious Locations
