author: Nasreddine Bencherchali
date: 2022/08/14
description: Detects potential abuse of ntdsutil to dump ntds.dit database
detection:
  condition: selection
  selection:
    Data|contains: ntds.dit
    Provider_Name: ESENT
    winlog.event_id:
    - 216
    - 325
    - 326
    - 327
falsepositives:
- Legitimate backup operation/creating shadow copies
id: e6e88853-5f20-4c4a-8d26-cd469fd8d31f
level: medium
logsource:
  product: windows
  service: application
product: windows
references:
- https://twitter.com/mgreen27/status/1558223256704122882
- https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/jj574207(v=ws.11)
service: application
status: experimental
tags:
- attack.execution
title: Ntdsutil Abuse
