author: Nasreddine Bencherchali
date: 2022/07/13
definition: MSSQL audit policy to monitor for 'sp_procoption' must be enabled in order
  to receive this event in the application log
description: Detects when the a stored procedure is set or cleared for automatic execution
  in MSSQL. A stored procedure that is set to automatic execution runs every time
  an instance of SQL Server is started
detection:
  condition: selection
  selection:
    Data|contains|all:
    - object_name:sp_procoption
    - statement:EXEC
    Provider_Name: MSSQLSERVER
    winlog.event_id: 33205
falsepositives:
- Legitimate use of the feature by administrators (rare)
id: b3d57a5c-c92e-4b48-9a79-5f124b7cf964
level: high
logsource:
  definition: MSSQL audit policy to monitor for 'sp_procoption' must be enabled in
    order to receive this event in the application log
  product: windows
  service: application
product: windows
references:
- https://www.netspi.com/blog/technical/network-penetration-testing/sql-server-persistence-part-1-startup-stored-procedures/
- https://docs.microsoft.com/en-us/sql/relational-databases/system-stored-procedures/sp-procoption-transact-sql?view=sql-server-ver16
service: application
status: experimental
tags:
- attack.persistence
title: MSSQL SPProcoption Set
