author: Florian Roth
date: 2021/11/22
description: Detects PoC tool used to exploit LPE vulnerability CVE-2021-41379
detection:
  condition: selection
  selection:
    Data|contains: test pkg
    Provider_Name: MsiInstaller
    winlog.event_id: 1033
falsepositives:
- Other MSI packages for which your admins have used that name
id: 7dbb86de-a0cc-494c-8aa8-b2996c9ef3c8
level: high
logsource:
  product: windows
  service: application
modified: 2022/07/12
product: windows
references:
- https://github.com/klinix5/InstallerFileTakeOver
service: application
status: experimental
tags:
- attack.initial_access
- attack.t1190
title: LPE InstallerFileTakeOver PoC CVE-2021-41379
