author: Thomas Patzke
category: file_event
date: 2017/06/12
description: Detects PsExec service installation and execution events (service and
  Sysmon)
detection:
  condition: selection
  selection:
    winlog.event_data.TargetFilename|endswith: \PSEXESVC.exe
falsepositives:
- Unknown
fields:
- winlog.event_id
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
- winlog.event_data.ServiceName
- winlog.event_data.ServiceFileName
- winlog.event_data.TargetFilename
- winlog.event_data.PipeName
id: 259e5a6a-b8d2-4c38-86e2-26c5e651361d
level: low
logsource:
  category: file_event
  product: windows
modified: 2021/09/21
product: windows
references:
- https://www.jpcert.or.jp/english/pub/sr/ir_research.html
- https://jpcertcc.github.io/ToolAnalysisResultSheet
related:
- id: 42c575ea-e41e-41f1-b248-8093c3e82a28
  type: derived
status: experimental
tags:
- attack.execution
- attack.t1569.002
- attack.s0029
title: PsExec Tool Execution
