author: frack113
category: file_event
date: 2022/06/08
description: Detects the creation of diagcab file, which could be caused by some legitimate
  installer or is a sign of exploitation (review the filename and its location)
detection:
  condition: selection
  selection:
    winlog.event_data.TargetFilename|endswith: .diagcab
falsepositives:
- Legitimate microsoft diagcab
id: 3d0ed417-3d94-4963-a562-4a92c940656a
level: medium
logsource:
  category: file_event
  product: windows
product: windows
references:
- https://threadreaderapp.com/thread/1533879688141086720.html
status: experimental
tags:
- attack.resource_development
title: Creation of a Diagcab
