author: frack113
category: file_event
date: 2021/12/19
description: 'Attempts to access unattend.xml, where credentials are commonly stored,
  within the Panther directory where installation logs are stored.

  If these files exist, their contents will be displayed. They are used to store credentials/answers
  during the unattended windows install process

  '
detection:
  condition: selection
  selection:
    winlog.event_data.TargetFilename|endswith: \unattend.xml
falsepositives:
- Unknown
id: 1a3d42dd-3763-46b9-8025-b5f17f340dfb
level: medium
logsource:
  category: file_event
  product: windows
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1552.001/T1552.001.md
status: experimental
tags:
- attack.credential_access
- attack.t1552.001
title: Suspicious Unattend.xml File Access
