author: frack113
category: file_event
date: 2021/12/26
description: Ransomware create txt file in the user Desktop
detection:
  condition: selection
  selection:
    winlog.event_data.Image|endswith: \cmd.exe
    winlog.event_data.TargetFilename|contains|all:
    - \Users\
    - \Desktop\
    winlog.event_data.TargetFilename|endswith: .txt
falsepositives:
- Unknown
id: caf02a0a-1e1c-4552-9b48-5e070bd88d11
level: high
logsource:
  category: file_event
  product: windows
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1486/T1486.md#atomic-test-5---purelocker-ransom-note
status: experimental
tags:
- attack.impact
- attack.t1486
title: Suspicious Creation TXT File in User Desktop
