author: NVISO
category: file_event
date: 2020/05/11
description: Detects add-ins that load when Microsoft Word or Excel starts (.wll/.xll
  are simply .dll fit for Word or Excel).
detection:
  condition: 1 of selection*
  selection_generic:
    winlog.event_data.TargetFilename|contains: \Microsoft\Addins\
    winlog.event_data.TargetFilename|endswith:
    - .xlam
    - .xla
  selection_wlldropped:
    winlog.event_data.TargetFilename|contains: \Microsoft\Word\Startup\
    winlog.event_data.TargetFilename|endswith: .wll
  selection_xlldropped:
    winlog.event_data.TargetFilename|contains: \Microsoft\Excel\Startup\
    winlog.event_data.TargetFilename|endswith: .xll
falsepositives:
- Legitimate add-ins
id: 8e1cb247-6cf6-42fa-b440-3f27d57e9936
level: high
logsource:
  category: file_event
  product: windows
modified: 2021/11/27
product: windows
references:
- Internal Research
status: test
tags:
- attack.persistence
- attack.t1137.006
title: Microsoft Office Add-In Loading
