author: Florian Roth
category: file_event
date: 2021/11/20
description: Detects a Windows executable that writes files to suspicious folders
detection:
  condition: 1 of selection*
  selection_program:
    winlog.event_data.Image|endswith:
    - \schtasks.exe
    - \wmic.exe
    - \mshta.exe
    - \forfiles.exe
    - \scriptrunner.exe
    - \certutil.exe
    winlog.event_data.TargetFilename|contains:
    - C:\Users\Public
    - C:\PerfLogs
    - \AppData\
    - C:\Windows\Temp
  selection_shells:
    winlog.event_data.Image|endswith:
    - \cmd.exe
    - \powershell.exe
    - \pwsh.exe
    - \wscript.exe
    - \cscript.exe
    - \sh.exe
    - \bash.exe
    - \msbuild.exe
    - \certutil.exe
    winlog.event_data.TargetFilename|contains:
    - C:\Users\Public
    - C:\PerfLogs
falsepositives:
- Unknown
fields:
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: 1277f594-a7d1-4f28-a2d3-73af5cbeab43
level: high
logsource:
  category: file_event
  product: windows
modified: 2022/07/14
product: windows
references:
- Internal Research
status: experimental
title: Windows Shell File Write to Suspicious Folder
