author: frack113
category: file_event
date: 2022/01/21
description: Once executed, colorcpl.exe will copy the arbitrary file to c:\windows\system32\spool\drivers\color\
detection:
  condition: selection and not valid_ext
  selection:
    winlog.event_data.Image|endswith: \colorcpl.exe
  valid_ext:
    winlog.event_data.TargetFilename|endswith:
    - .icm
    - .gmmp
    - .cdmp
    - .camp
falsepositives:
- Unknown
id: e15b518d-b4ce-4410-a9cd-501f23ce4a18
level: high
logsource:
  category: file_event
  product: windows
product: windows
references:
- https://twitter.com/eral4m/status/1480468728324231172?s=20
status: experimental
tags:
- attack.defense_evasion
- attack.t1564
title: Suspicious Creation with Colorcpl
