author: frack113
category: file_event
date: 2022/01/28
description: TeamViewer_Desktop.exe is create during install
detection:
  condition: selection
  selection:
    winlog.event_data.TargetFilename|endswith: \TeamViewer_Desktop.exe
falsepositives:
- Unknown
id: 9711de76-5d4f-4c50-a94f-21e4e8f8384d
level: medium
logsource:
  category: file_event
  product: windows
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1219/T1219.md#atomic-test-1---teamviewer-files-detected-test-on-windows
status: experimental
tags:
- attack.command_and_control
- attack.t1219
title: Installation of TeamViewer Desktop
