author: Maxime Thiebaut (@0xThiebaut), Tim Shelton (HAWK.IO)
category: file_event
date: 2020/03/19
description: Detects unusual processes accessing desktop.ini, which can be leveraged
  to alter how Explorer displays a folder's content (i.e. renaming files) without
  changing them on disk.
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.Image|startswith:
    - C:\Windows\
    - C:\Program Files\
    - C:\Program Files (x86)\
  selection:
    winlog.event_data.TargetFilename|endswith: \desktop.ini
falsepositives:
- Operations performed through Windows SCCM or equivalent
- Read only access list authority
id: 81315b50-6b60-4d8f-9928-3466e1022515
level: medium
logsource:
  category: file_event
  product: windows
modified: 2021/12/03
product: windows
references:
- https://isc.sans.edu/forums/diary/Desktopini+as+a+postexploitation+tool/25912/
status: test
tags:
- attack.persistence
- attack.t1547.009
title: Suspicious desktop.ini Action
