author: frack113
category: file_event
date: 2022/08/12
description: "Detects creation of a malicious DLL file in the location where the OneDrive\
  \ or Team applications\nUpon execution of the Teams or OneDrive application, the\
  \ dropped malicious DLL file (\u201Ciphlpapi.dll\u201D) is sideloaded\n"
detection:
  condition: selection
  selection:
    winlog.event_data.TargetFilename|contains|all:
    - iphlpapi.dll
    - \AppData\Local\Microsoft
falsepositives:
- Unknown
id: 1908fcc1-1b92-4272-8214-0fbaf2fa5163
level: high
logsource:
  category: file_event
  product: windows
product: windows
references:
- https://blog.cyble.com/2022/07/27/targeted-attacks-being-carried-out-via-dll-sideloading/
status: experimental
tags:
- attack.persistence
- attack.privilege_escalation
- attack.defense_evasion
- attack.t1574.002
title: Malicious DLL File Dropped in the Teams or OneDrive Folder
