author: Nasreddine Bencherchali
category: file_event
date: 2022/06/10
description: Detects creation of new ".dll" files inside the plugins directory of
  a notepad++ installation by a process other than "gup.exe". Which could indicates
  possible persistence
detection:
  condition: selection and not 1 of filter*
  filter_gup:
    winlog.event_data.Image|endswith: \Notepad++\updater\gup.exe
  filter_install:
    winlog.event_data.Image|contains: \AppData\Local\Temp\
    winlog.event_data.Image|endswith: \target.exe
    winlog.event_data.Image|startswith: C:\Users\
  selection:
    winlog.event_data.TargetFilename|contains: \Notepad++\plugins\
    winlog.event_data.TargetFilename|endswith: .dll
falsepositives:
- Possible FPs during first installation of Notepad++
- Legitimate use of custom plugins to enhance notepad++ functionality by users
id: 54127bd4-f541-4ac3-afdb-ea073f63f692
level: medium
logsource:
  category: file_event
  product: windows
modified: 2022/06/21
product: windows
references:
- https://pentestlab.blog/2022/02/14/persistence-notepad-plugins/
status: experimental
tags:
- attack.persistence
title: Persistence Via Notepad++ Plugins
