author: C.J. May
category: file_event
date: 2022/08/09
description: Detects default file names outputted by the BloodHound collection tool
  SharpHound
detection:
  condition: 1 of selection*
  selection1:
    winlog.event_data.TargetFilename|endswith:
    - _BloodHound.zip
    - _computers.json
    - _containers.json
    - _domains.json
    - _gpos.json
    - _groups.json
    - _ous.json
    - _users.json
  selection2:
    winlog.event_data.TargetFilename|contains|all:
    - BloodHound
    - .zip
falsepositives:
- Unknown
id: 02773bed-83bf-469f-b7ff-e676e7d78bab
level: high
logsource:
  category: file_event
  product: windows
modified: 2022/08/09
product: windows
references:
- https://academy.hackthebox.com/course/preview/active-directory-bloodhound/bloodhound--data-collection
status: experimental
tags:
- attack.discovery
- attack.t1087.001
- attack.t1087.002
- attack.t1482
- attack.t1069.001
- attack.t1069.002
- attack.execution
- attack.t1059.001
title: BloodHound Collection Files
