author: Nasreddine Bencherchali
category: file_event
date: 2022/08/05
description: Detects the creation of suspicious files and folders inside the user's
  AppData folder but not inside any of the common and well known directories (Local,
  Romaing, LocalLow). This method could be used as a method to bypass detection who
  exclude the AppData folder in fear of FPs
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.TargetFilename|contains:
    - \AppData\Local\
    - \AppData\LocalLow\
    - \AppData\Roaming\
  selection:
    winlog.event_data.TargetFilename|contains: \AppData\
    winlog.event_data.TargetFilename|endswith:
    - .exe
    - .bat
    - .vbe
    - .vbs
    - .msi
    - .iso
    - .lnk
    - .cmd
falsepositives:
- Unlikely
id: d7b50671-d1ad-4871-aa60-5aa5b331fe04
level: high
logsource:
  category: file_event
  product: windows
product: windows
references:
- Internal Research
status: experimental
tags:
- attack.defense_evasion
- attack.execution
title: Creation Suspicious File In Uncommon AppData Folder
