author: HieuTT35, Nasreddine Bencherchali
category: file_event
date: 2019/10/24
description: Detects the creation or modification of a powershell profile which could
  indicate suspicious activity as the profile can be used as a mean of persistence
detection:
  condition: selection
  selection:
    winlog.event_data.TargetFilename|endswith:
    - \Microsoft.PowerShell_profile.ps1
    - \WindowsPowerShell\profile.ps1
    - \PowerShell\profile.ps1
    - \Windows\System32\WindowsPowerShell\v1.0\profile.ps1
    - \Program Files\PowerShell\7\profile.ps1
falsepositives:
- System administrator create Powershell profile manually
id: b5b78988-486d-4a80-b991-930eff3ff8bf
level: high
logsource:
  category: file_event
  product: windows
modified: 2022/08/24
product: windows
references:
- https://www.welivesecurity.com/2019/05/29/turla-powershell-usage/
- https://persistence-info.github.io/Data/powershellprofile.html
status: test
tags:
- attack.persistence
- attack.privilege_escalation
- attack.t1546.013
title: PowerShell Profile Modification
