author: Nasreddine Bencherchali
category: file_event
date: 2022/08/12
description: Detects windows executables that writes files with suspicious extensions
detection:
  condition: selection
  selection:
    winlog.event_data.Image|endswith:
    - \rundll32.exe
    - \dllhost.exe
    - \smss.exe
    - \RuntimeBroker.exe
    - \sihost.exe
    - \lsass.exe
    - \csrss.exe
    - \winlogon.exe
    - \wininit.exe
    winlog.event_data.TargetFilename|endswith:
    - .bat
    - .vbe
    - .txt
    - .vbs
    - .exe
    - .ps1
    - .hta
    - .iso
falsepositives:
- Unknown
id: b8fd0e93-ff58-4cbd-8f48-1c114e342e62
level: high
logsource:
  category: file_event
  product: windows
product: windows
references:
- Internal Research
related:
- id: 1277f594-a7d1-4f28-a2d3-73af5cbeab43
  type: derived
status: experimental
title: Windows Binaries Write Suspicious Extensions
