author: Florian Roth
category: file_event
date: 2022/06/27
description: Detects WerFault creating a dump file with a name that indicates that
  the dump file could be an LSASS process memory, which contains user credentials
detection:
  condition: selection
  selection:
    winlog.event_data.Image: C:\WINDOWS\system32\WerFault.exe
    winlog.event_data.TargetFilename|contains:
    - \lsass
    - lsass.exe
falsepositives:
- Unknown
id: c3e76af5-4ce0-4a14-9c9a-25ceb8fda182
level: high
logsource:
  category: file_event
  product: windows
product: windows
references:
- https://github.com/helpsystems/nanodump
status: experimental
tags:
- attack.credential_access
- attack.t1003.001
title: WerFault LSASS Process Memory Dump
