author: Florian Roth
category: file_event
date: 2019/12/22
description: Detects the use of CreateMiniDump hack tool used to dump the LSASS process
  memory for credential extraction on the attacker's machine
detection:
  condition: selection
  selection:
    winlog.event_data.TargetFilename|endswith: \lsass.dmp
falsepositives:
- Unknown
id: db2110f3-479d-42a6-94fb-d35bc1e46492
level: high
logsource:
  category: file_event
  product: windows
modified: 2021/09/19
product: windows
references:
- https://ired.team/offensive-security/credential-access-and-credential-dumping/dumping-lsass-passwords-without-mimikatz-minidumpwritedump-av-signature-bypass
related:
- id: 36d88494-1d43-4dc0-b3fa-35c8fea0ca9d
  type: derived
tags:
- attack.credential_access
- attack.t1003.001
title: CreateMiniDump Hacktool
