author: Florian Roth
category: file_event
date: 2022/03/11
description: Detects suspicious creations of a file named ntds.dit, e.g. by a PowerShell
  parent or in a suspicious directory or a suspicious one liner
detection:
  condition: selection_file and 1 of selection_process*
  selection_file:
    winlog.event_data.TargetFilename|endswith: \ntds.dit
  selection_process:
  - winlog.event_data.ParentImage|endswith:
    - \powershell.exe
    - \pwsh.exe
    - \wscript.exe
    - \cscript.exe
    - \w3wp.exe
    - \php-cgi.exe
    - \nginx.exe
    - \httpd.exe
  - winlog.event_data.ParentImage|contains:
    - \apache
    - \tomcat
    - \AppData\
    - \Temp\
    - \Public\
    - \PerfLogs\
  - winlog.event_data.Image|contains:
    - \AppData\
    - \Temp\
    - \Public\
    - \PerfLogs\
falsepositives:
- Unknown
id: 4e7050dd-e548-483f-b7d6-527ab4fa784d
level: high
logsource:
  category: file_event
  product: windows
modified: 2022/07/14
product: windows
references:
- https://www.ired.team/offensive-security/credential-access-and-credential-dumping/ntds.dit-enumeration
- https://www.n00py.io/2022/03/manipulating-user-passwords-without-mimikatz/
- https://pentestlab.blog/tag/ntds-dit/
- https://github.com/samratashok/nishang/blob/414ee1104526d7057f9adaeee196d91ae447283e/Gather/Copy-VSS.ps1
status: experimental
tags:
- attack.credential_access
- attack.t1003.003
title: Suspicious NTDS.DIT Creation
