author: frack113
category: file_event
date: 2022/06/05
description: Detects the creation of an file in user Word Startup
detection:
  condition: selection and not filter_ext
  filter_ext:
    winlog.event_data.TargetFilename|endswith:
    - .docx
    - .docm
    - .dotx
    - .dotm
    - .docb
    - .pdf
    - .wll
    - .wwl
  selection:
    winlog.event_data.TargetFilename|contains: \AppData\Roaming\Microsoft\Word\STARTUP\
falsepositives:
- Addition of legitimate plugins
id: a10a2c40-2c4d-49f8-b557-1a946bc55d9d
level: medium
logsource:
  category: file_event
  product: windows
product: windows
references:
- Malware Sandbox https://app.any.run/tasks/d6fe6624-6ef8-485d-aa75-3d1bdda2a08c/
status: experimental
tags:
- attack.resource_development
- attack.t1587.001
title: Creation In User Word Startup Folder
