author: Vadim Khrykov (ThreatIntel), Cyb3rEng (Rule)
category: file_event
date: 2021/08/23
description: This rule will monitor executable and script file creation by office
  applications. Please add more file extensions or magic bytes to the logic of your
  choice.
detection:
  condition: all of selection* and not 1 of filter_*
  filter_localassembly:
    winlog.event_data.TargetFilename|contains: \AppData\Local\assembly\tmp\
    winlog.event_data.TargetFilename|endswith: .dll
  filter_webex:
    winlog.event_data.Image|endswith: \winword.exe
    winlog.event_data.TargetFilename|contains: \AppData\Local\Temp\webexdelta\
    winlog.event_data.TargetFilename|endswith:
    - .dll
    - .exe
  filter_webservicecache:
    winlog.event_data.TargetFilename|contains|all:
    - C:\Users\
    - \AppData\Local\Microsoft\Office\
    - \WebServiceCache\AllUsers
    winlog.event_data.TargetFilename|endswith: .com
  selection1:
    winlog.event_data.Image|endswith:
    - \winword.exe
    - \excel.exe
    - \powerpnt.exe
  selection2:
    winlog.event_data.TargetFilename|endswith:
    - .exe
    - .dll
    - .ocx
    - .com
    - .ps1
    - .vbs
    - .sys
    - .bat
    - .scr
    - .proj
falsepositives:
- Unknown
id: c7a74c80-ba5a-486e-9974-ab9e682bc5e4
level: high
logsource:
  category: file_event
  product: windows
modified: 2022/07/11
product: windows
references:
- https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware/
- https://github.com/vadim-hunter/Detection-Ideas-Rules/blob/02bcbfc2bfb8b4da601bb30de0344ae453aa1afe/Threat%20Intelligence/The%20DFIR%20Report/20210329_Sodinokibi_(aka_REvil)_Ransomware.yaml
status: experimental
tags:
- attack.t1204.002
- attack.execution
title: Created Files by Office Applications
