author: frack113
category: file_event
date: 2021/12/29
description: 'Adversaries may establish persistence by executing malicious content
  triggered by user inactivity.

  Screensavers are programs that execute after a configurable time of user inactivity
  and consist of Portable Executable (PE) files with a .scr file extension

  '
detection:
  condition: selection and not 1 of filter*
  filter:
    winlog.event_data.Image|endswith:
    - \Kindle.exe
    - \Bin\ccSvcHst.exe
  selection:
    winlog.event_data.TargetFilename|endswith: .scr
falsepositives:
- Unknown
id: 97aa2e88-555c-450d-85a6-229bcd87efb8
level: medium
logsource:
  category: file_event
  product: windows
modified: 2022/01/10
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1546.002/T1546.002.md
status: experimental
tags:
- attack.persistence
- attack.t1546.002
title: Suspicious Screensaver Binary File Creation
