author: omkar72, oscd.community, Wojciech Lesicki
category: file_event
date: 2020/10/12
definition: Check your sysmon configuration for monitoring UsageLogs folder. In SwiftOnSecurity
  configuration we have that thanks @SBousseaden
description: Detects suspicious .NET assembly executions. Could detect using Cobalt
  Strike's command execute-assembly.
detection:
  condition: selection
  selection:
    winlog.event_data.TargetFilename|contains:
    - mshta
    - cscript
    - wscript
    - regsvr32
    - wmic
    - rundll32
    - svchost
    winlog.event_data.TargetFilename|contains|all:
    - \AppData\Local\Microsoft\CLR
    - \UsageLogs\
falsepositives:
- Rundll32.exe with zzzzInvokeManagedCustomActionOutOfProc in command line and msiexec.exe
  as parent process - https://twitter.com/SBousseaden/status/1388064061087260675
id: e4b63079-6198-405c-abd7-3fe8b0ce3263
level: high
logsource:
  category: file_event
  definition: Check your sysmon configuration for monitoring UsageLogs folder. In
    SwiftOnSecurity configuration we have that thanks @SBousseaden
  product: windows
modified: 2022/06/24
product: windows
references:
- https://blog.menasec.net/2019/07/interesting-difr-traces-of-net-clr.html
- https://bohops.com/2021/03/16/investigating-net-clr-usage-log-tampering-techniques-for-edr-evasion/
- https://github.com/olafhartong/sysmon-modular/blob/5e5f6d90819a7f35eec0aba08021d0d201bb9055/11_file_create/include_dotnet.xml
status: experimental
tags:
- attack.execution
- attack.defense_evasion
- attack.t1059.001
- attack.t1218
title: Suspicious CLR Logs Creation
