author: Florian Roth
category: file_event
date: 2021/12/07
description: Detects the creation of files that indicator an interactive use of PowerShell
  in the SYSTEM user context
detection:
  condition: selection
  selection:
    winlog.event_data.TargetFilename:
    - C:\Windows\System32\config\systemprofile\AppData\Roaming\Microsoft\Windows\PowerShell\PSReadLine\ConsoleHost_history.txt
    - C:\Windows\System32\config\systemprofile\AppData\Local\Microsoft\Windows\PowerShell\StartupProfileData-Interactive
falsepositives:
- Administrative activity
- PowerShell scripts running as SYSTEM user
id: 5b40a734-99b6-4b98-a1d0-1cea51a08ab2
level: high
logsource:
  category: file_event
  product: windows
modified: 2022/08/13
product: windows
references:
- https://jpcertcc.github.io/ToolAnalysisResultSheet/details/PowerSploit_Invoke-Mimikatz.htm
status: experimental
title: Suspicious Interactive PowerShell as SYSTEM
