author: elhoim
category: file_event
date: 2022/04/28
description: This rule detects suspicious files created by Microsoft Sync Center (mobsync)
detection:
  condition: selection_mobsync and filter_created_file
  filter_created_file:
    winlog.event_data.TargetFilename|endswith:
    - .dll
    - .exe
  selection_mobsync:
    winlog.event_data.Image|endswith: \mobsync.exe
falsepositives:
- Unknown
id: 409f8a98-4496-4aaa-818a-c931c0a8b832
level: medium
logsource:
  category: file_event
  product: windows
modified: 2022/06/02
product: windows
references:
- https://redcanary.com/blog/intelligence-insights-november-2021/
status: experimental
tags:
- attack.t1055
- attack.t1218
- attack.execution
- attack.defense_evasion
title: Created Files by Microsoft Sync Center
