author: Florian Roth
category: file_event
date: 2022/04/13
description: Detects files created during the local privilege exploitation of CVE-2022-24527
  Microsoft Connected Cache
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.User|contains:
    - AUTHORI
    - AUTORI
  selection:
    winlog.event_data.TargetFilename|endswith: WindowsPowerShell\Modules\webAdministration\webAdministration.psm1
falsepositives:
- Unknown
id: e0a41412-c69a-446f-8e6e-0e6d7483dad7
level: high
logsource:
  category: file_event
  product: windows
product: windows
references:
- https://www.rapid7.com/blog/post/2022/04/12/cve-2022-24527-microsoft-connected-cache-local-privilege-escalation-fixed/
status: experimental
tags:
- attack.privilege_escalation
- attack.t1059.001
- cve.2022.24527
title: CVE-2022-24527 Microsoft Connected Cache LPE
