author: frack113, Nasreddine Bencherchali
category: file_event
date: 2022/07/30
description: 'Detects when an attacker create a similar folder structure to windows
  system folders such as (Windows, Program Files...)

  but with a space in order to trick DLL load search order and perform a "DLL Search
  Order Hijacking" attack

  '
detection:
  condition: selection
  selection:
    winlog.event_data.TargetFilename|endswith: .dll
    winlog.event_data.TargetFilename|startswith:
    - C:\Windows \
    - C:\Program Files \
    - C:\Program Files (x86) \
falsepositives:
- Unknown
id: b6f91281-20aa-446a-b986-38a92813a18f
level: high
logsource:
  category: file_event
  product: windows
product: windows
references:
- https://twitter.com/cyb3rops/status/1552932770464292864
- https://www.wietzebeukema.nl/blog/hijacking-dlls-in-windows
status: experimental
tags:
- attack.persistence
- attack.privilege_escalation
- attack.defense_evasion
- attack.t1574.002
title: DLL Search Order Hijackig Via Additional Space in Path
