author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
category: file_event
date: 2020/05/02
description: A General detection for files being created in the Windows startup directory.
  This could be an indicator of persistence.
detection:
  condition: selection and not filter_update
  filter_update:
    winlog.event_data.Image: C:\Windows\System32\wuauclt.exe
  selection:
    winlog.event_data.TargetFilename|contains: \Microsoft\Windows\Start Menu\Programs\StartUp
falsepositives:
- An FP could be caused by legitimate application writing shortcuts for example. This
  folder should always be inspected to make sure that all the files in there are legitimate
id: 2aa0a6b4-a865-495b-ab51-c28249537b75
level: medium
logsource:
  category: file_event
  product: windows
modified: 2022/08/22
product: windows
references:
- https://github.com/OTRF/detection-hackathon-apt29/issues/12
- https://threathunterplaybook.com/evals/apt29/detections/5.B.1_611FCA99-97D0-4873-9E51-1C1BA2DBB40D.html
status: test
tags:
- attack.persistence
- attack.t1547.001
title: Startup Folder File Write
