author: Markus Neis
category: file_event
date: 2018/07/24
description: Detects possible SafetyKatz Behaviour
detection:
  condition: selection
  selection:
    winlog.event_data.TargetFilename|endswith: \Temp\debug.bin
falsepositives:
- Unknown
id: e074832a-eada-4fd7-94a1-10642b130e16
level: high
logsource:
  category: file_event
  product: windows
modified: 2021/11/27
product: windows
references:
- https://github.com/GhostPack/SafetyKatz
status: test
tags:
- attack.credential_access
- attack.t1003.001
title: Detection of SafetyKatz
