author: Nasreddine Bencherchali
category: file_event
date: 2022/07/18
description: Detects creation of a file named "wpbbin" in the "%systemroot%\system32\"
  directory. Which could be indicative of UEFI based persistence method
detection:
  condition: selection
  selection:
    winlog.event_data.TargetFilename: C:\Windows\System32\wpbbin.exe
falsepositives:
- Legitimate usage of the file by hardware manufacturer such as lenovo (Thanks @0gtweet
  for the tip)
id: e94b9ddc-eec5-4bb8-8a58-b9dc5f4e185f
level: high
logsource:
  category: file_event
  product: windows
product: windows
references:
- https://grzegorztworek.medium.com/using-uefi-to-inject-executable-files-into-bitlocker-protected-drives-8ff4ca59c94c
- https://persistence-info.github.io/Data/wpbbin.html
status: experimental
tags:
- attack.persistence
- attack.defense_evasion
- attack.t1542.001
title: UEFI Persistence Via Wpbbin - FileCreation
