author: frack113
category: file_event
date: 2022/02/13
description: 'An adversary may use legitimate desktop support and remote access software,
  such as Team Viewer, Go2Assist, LogMein, AmmyyAdmin, etc, to establish an interactive
  command and control channel to target systems within networks.

  These services are commonly used as legitimate technical support software, and may
  be allowed by application control within a target environment.

  Remote access tools like VNC, Ammyy, and Teamviewer are used frequently when compared
  with other legitimate software commonly used by adversaries. (Citation: Symantec
  Living off the Land)

  '
detection:
  condition: selection
  selection:
    winlog.event_data.TargetFilename|contains: \AppData\Local\Temp\LogMeInInc\GoToAssist
      Remote Support Expert\
falsepositives:
- Legitimate use
id: 5d756aee-ad3e-4306-ad95-cb1abec48de2
level: medium
logsource:
  category: file_event
  product: windows
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1219/T1219.md#atomic-test-4---gotoassist-files-detected-test-on-windows
status: experimental
tags:
- attack.command_and_control
- attack.t1219
title: GoToAssist Temporary Installation Artefact
