author: Vadim Khrykov (ThreatIntel), Cyb3rEng (Rule)
category: file_event
date: 2021/08/23
description: This rule will monitor executable and script file creation by office
  applications. Please add more file extensions or magic bytes to the logic of your
  choice.
detection:
  condition: selection1 and (selection2 or selection3)
  selection1:
    winlog.event_data.Image|endswith:
    - winword.exe
    - excel.exe
    - powerpnt.exe
    - outlook.exe
  selection2:
    winlog.event_data.FileName|endswith:
    - .exe
    - .dll
    - .ocx
    - .com
    - .ps1
    - .vbs
    - .sys
    - .bat
    - .scr
    - .proj
  selection3:
    FileMagicBytes|startswith:
    - 4D5A
falsepositives:
- Unknown
id: 8c6fd6fc-28fc-4597-a86a-fc1de20b039d
level: high
logsource:
  category: file_event
  product: windows
product: windows
references:
- https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware/
- https://github.com/vadim-hunter/Detection-Ideas-Rules/blob/main/Threat%20Intelligence/The%20DFIR%20Report/20210329_Sodinokibi_(aka_REvil)_Ransomware.yaml
status: experimental
tags:
- attack.t1204.002
- attack.t1047
- attack.t1218.010
- attack.execution
- attack.defense_evasion
title: File Creation by Office Applications
