author: Florian Roth
category: file_event
date: 2021/07/23
description: Detects files written by the different tools that exploit HiveNightmare
detection:
  condition: selection
  selection:
  - winlog.event_data.TargetFilename|contains:
    - \hive_sam_
    - \SAM-2021-
    - \SAM-2022-
    - \SAM-2023-
    - \SAM-haxx
    - \Sam.save
  - winlog.event_data.TargetFilename:
    - C:\windows\temp\sam
falsepositives:
- Files that accidentally contain these strings
fields:
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: 6ea858a8-ba71-4a12-b2cc-5d83312404c7
level: high
logsource:
  category: file_event
  product: windows
product: windows
references:
- https://github.com/GossiTheDog/HiveNightmare
- https://github.com/FireFart/hivenightmare/
- https://github.com/WiredPulse/Invoke-HiveNightmare
- https://twitter.com/cube0x0/status/1418920190759378944
status: experimental
tags:
- attack.credential_access
- attack.t1552.001
- cve.2021.36934
title: Typical HiveNightmare SAM File Export
