author: '@sam0x90'
category: file_event
date: 2022/07/30
description: Detects the creation of a ISO file in the Outlook temp folder or in the
  Appdata temp folder. Typical of Qakbot TTP from end-July 2022.
detection:
  condition: 1 of selection*
  selection_1:
    winlog.event_data.TargetFilename|contains|all:
    - \AppData\Local\Temp\
    - .zip\
    winlog.event_data.TargetFilename|endswith: .iso
  selection_2:
    winlog.event_data.TargetFilename|contains: \AppData\Local\Microsoft\Windows\INetCache\Content.Outlook\
    winlog.event_data.TargetFilename|endswith: .iso
falsepositives:
- Potential FP by sysadmin opening a zip file containing a legitimate ISO file
fields:
- TargetFileName
- winlog.event_data.Image
- winlog.ComputerName
id: 2f9356ae-bf43-41b8-b858-4496d83b2acb
level: high
logsource:
  category: file_event
  product: windows
product: windows
references:
- https://twitter.com/Sam0x90/status/1552011547974696960
- https://securityaffairs.co/wordpress/133680/malware/dll-sideloading-spread-qakbot.html
status: experimental
tags:
- attack.initial_access
- attack.t1566.001
title: ISO File Created Within Temp Folders
