author: Florian Roth
category: file_event
date: 2021/11/29
description: Detects the use of NPPSpy hacktool that stores cleartext passwords of
  users that logged in to a local file
detection:
  condition: selection
  selection:
    winlog.event_data.TargetFilename|endswith:
    - \NPPSpy.txt
    - \NPPSpy.dll
falsepositives:
- Unknown
id: cad1fe90-2406-44dc-bd03-59d0b58fe722
level: high
logsource:
  category: file_event
  product: windows
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1003/T1003.md#atomic-test-2---credential-dumping-with-nppspy
- https://twitter.com/0gtweet/status/1465282548494487554
status: experimental
tags:
- attack.credential_access
title: NPPSpy Hacktool Usage
