author: Tim Shelton
category: file_event
date: 2022/01/10
description: Detects a file ending in jse, vbe, js, vba, vbs written by cscript.exe
  or wscript.exe
detection:
  condition: selection
  selection:
    winlog.event_data.Image|endswith:
    - \wscript.exe
    - \cscript.exe
    winlog.event_data.TargetFilename|endswith:
    - .jse
    - .vbe
    - .js
    - .vba
    - .vbs
    winlog.event_data.TargetFilename|startswith:
    - C:\Users\
    - C:\ProgramData
falsepositives:
- Unknown
fields:
- winlog.event_data.Image
- winlog.event_data.TargetFilename
id: 002bdb95-0cf1-46a6-9e08-d38c128a6127
level: high
logsource:
  category: file_event
  product: windows
modified: 2022/01/11
product: windows
references:
- WScript or CScript Dropper (cea72823-df4d-4567-950c-0b579eaf0846)
related:
- id: cea72823-df4d-4567-950c-0b579eaf0846
  type: derived
status: experimental
title: WScript or CScript Dropper
