author: frack113
category: file_event
date: 2022/01/23
description: A office file with macro is created from a commandline or a script
detection:
  condition: all of selection_*
  selection_cmd:
  - winlog.event_data.Image|endswith:
    - \cmd.exe
    - \powershell.exe
    - \pwsh.exe
  - winlog.event_data.ParentImage|endswith:
    - \cmd.exe
    - \powershell.exe
    - \pwsh.exe
  selection_ext:
    winlog.event_data.TargetFilename|endswith:
    - .docm
    - .dotm
    - .xlsm
    - .xltm
    - .potm
    - .pptm
    - .pptx
falsepositives:
- Unknown
id: b1c50487-1967-4315-a026-6491686d860e
level: medium
logsource:
  category: file_event
  product: windows
modified: 2022/07/14
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1566.001/T1566.001.md
- https://docs.microsoft.com/en-us/deployoffice/compat/office-file-format-reference
status: experimental
tags:
- attack.initial_access
- attack.t1566.001
title: Dump Office Macro Files from Commandline
