author: Aaron Greetham (@beardofbinary) - NCC Group
category: file_event
date: 2021/05/26
description: Detects Rclone config file being created
detection:
  condition: selection
  selection:
    winlog.event_data.TargetFilename|contains|all:
    - :\Users\
    - \.config\rclone\
falsepositives:
- Legitimate Rclone usage (rare)
id: 34986307-b7f4-49be-92f3-e7a4d01ac5db
level: high
logsource:
  category: file_event
  product: windows
modified: 2021/10/04
product: windows
references:
- https://research.nccgroup.com/2021/05/27/detecting-rclone-an-effective-tool-for-exfiltration/
status: experimental
tags:
- attack.exfiltration
- attack.t1567.002
title: Rclone Config File Creation
