author: Sander Wiebing, Tim Shelton
category: file_event
date: 2020/05/26
description: Detects the creation of an executable with a system process name in a
  suspicious folder
detection:
  condition: selection and not 1 of filter*
  filter1:
    winlog.event_data.Image|endswith:
    - \Windows\System32\dism.exe
    - \TiWorker.exe
    winlog.event_data.TargetFilename|startswith:
    - C:\Windows\System32\
    - C:\Windows\SysWOW64\
    - C:\Windows\WinSxS\
    - \SystemRoot\System32\
  filter2:
    winlog.event_data.Image: C:\$WINDOWS.~BT\Sources\SetupHost.exe
    winlog.event_data.TargetFilename|startswith: C:\$WINDOWS.~BT\
  filter3:
    winlog.event_data.Image: C:\Windows\system32\wbengine.exe
    winlog.event_data.TargetFilename|endswith: \RuntimeBroker.exe
  filter4:
    winlog.event_data.Image|endswith: :\Windows\system32\svchost.exe
    winlog.event_data.TargetFilename|endswith: \spoolsv.exe
    winlog.event_data.TargetFilename|startswith: C:\Windows\SoftwareDistribution\Download\
  filter6:
    winlog.event_data.Image: C:\Windows\System32\wuauclt.exe
  selection:
    winlog.event_data.TargetFilename|endswith:
    - \svchost.exe
    - \rundll32.exe
    - \services.exe
    - \powershell.exe
    - \pwsh.exe
    - \regsvr32.exe
    - \spoolsv.exe
    - \lsass.exe
    - \smss.exe
    - \csrss.exe
    - \conhost.exe
    - \wininit.exe
    - \lsm.exe
    - \winlogon.exe
    - \explorer.exe
    - \taskhost.exe
    - \Taskmgr.exe
    - \sihost.exe
    - \RuntimeBroker.exe
    - \smartscreen.exe
    - \dllhost.exe
    - \audiodg.exe
    - \wlanext.exe
falsepositives:
- System processes copied outside their default folders for testing purposes
- Third party software naming their software with the same names as the processes
  mentioned here
fields:
- winlog.event_data.Image
id: d5866ddf-ce8f-4aea-b28e-d96485a20d3d
level: high
logsource:
  category: file_event
  product: windows
modified: 2022/09/07
product: windows
status: test
tags:
- attack.defense_evasion
- attack.t1036.005
title: File Created with System Process Name
