author: Christian Burkard
category: file_event
date: 2021/08/30
description: Detects the pattern of UAC Bypass using IEInstal.exe (UACMe 64)
detection:
  condition: selection
  selection:
    winlog.event_data.Image: C:\Program Files\Internet Explorer\IEInstal.exe
    winlog.event_data.TargetFilename|contains: \AppData\Local\Temp\
    winlog.event_data.TargetFilename|endswith: consent.exe
    winlog.event_data.TargetFilename|startswith: C:\Users\
falsepositives:
- Unknown
id: bdd8157d-8e85-4397-bb82-f06cc9c71dbb
level: high
logsource:
  category: file_event
  product: windows
product: windows
references:
- https://github.com/hfiref0x/UACME
status: experimental
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1548.002
title: UAC Bypass Using IEInstal - File
