author: Teymur Kheirkhabarov, oscd.community
category: file_event
date: 2019/10/22
description: LSASS memory dump creation using operating systems utilities. Procdump
  will use process name in output file if no name is specified
detection:
  condition: selection
  selection:
    winlog.event_data.TargetFilename|contains: lsass
    winlog.event_data.TargetFilename|endswith: dmp
falsepositives:
- Dumping lsass memory for forensic investigation purposes by legitimate incident
  responder or forensic invetigator
- Dumps of another process that contains lsass in its process name (substring)
fields:
- winlog.ComputerName
- winlog.event_data.TargetFilename
id: 5e3d3601-0662-4af0-b1d2-36a05e90c40a
level: high
logsource:
  category: file_event
  product: windows
modified: 2021/08/16
product: windows
references:
- https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
status: experimental
tags:
- attack.credential_access
- attack.t1003.001
title: LSASS Memory Dump File Creation
