author: xknow @xknow_infosec
category: file_event
date: 2019/03/24
description: Detects the usage of ADSI (LDAP) operations by tools. This may also detect
  tools like LDAPFragger.
detection:
  condition: selection_1 and not selection_2
  selection_1:
    winlog.event_data.TargetFilename|contains: \Local\Microsoft\Windows\SchCache\
    winlog.event_data.TargetFilename|endswith: .sch
  selection_2:
    winlog.event_data.Image:
    - C:\windows\system32\svchost.exe
    - C:\windows\system32\dllhost.exe
    - C:\windows\system32\mmc.exe
    - C:\windows\system32\WindowsPowerShell\v1.0\powershell.exe
    - C:\Windows\CCM\CcmExec.exe
falsepositives:
- Other legimate tools, which do ADSI (LDAP) operations, e.g. any remoting activity
  by MMC, Powershell, Windows etc.
id: 75bf09fa-1dd7-4d18-9af9-dd9e492562eb
level: high
logsource:
  category: file_event
  product: windows
modified: 2020/08/23
product: windows
references:
- https://medium.com/@ivecodoe/detecting-ldapfragger-a-newly-released-cobalt-strike-beacon-using-ldap-for-c2-communication-c274a7f00961
- https://blog.fox-it.com/2020/03/19/ldapfragger-command-and-control-over-ldap-attributes/
- https://github.com/fox-it/LDAPFragger
status: experimental
tags:
- attack.t1001.003
- attack.command_and_control
title: Suspicious ADSI-Cache Usage By Unknown Tool
