author: Roberto Rodriguez @Cyb3rWard0g, Tim Shelton
category: pipe_created
date: 2019/09/12
definition: Note that you have to configure logging for Named Pipe Events in Sysmon
  config (Event ID 17 and Event ID 18). The basic configuration is in popular sysmon
  configuration (https://github.com/SwiftOnSecurity/sysmon-config), but it is worth
  verifying. You can also use other repo, e.g. https://github.com/Neo23x0/sysmon-config,
  https://github.com/olafhartong/sysmon-modular. How to test detection? You can check
  powershell script from this site https://svch0st.medium.com/guide-to-named-pipes-and-hunting-for-cobalt-strike-pipes-dc46b2c5f575
description: Detects alternate PowerShell hosts potentially bypassing detections looking
  for powershell.exe
detection:
  condition: selection and not 1 of filter*
  filter1:
    winlog.event_data.Image|endswith:
    - \powershell.exe
    - \powershell_ise.exe
    - \WINDOWS\System32\sdiagnhost.exe
    - \WINDOWS\System32\wsmprovhost.exe
    - \Windows\system32\dsac.exe
    - \Windows\system32\wbem\wmiprvse.exe
    - \ForefrontActiveDirectoryConnector.exe
    - c:\windows\system32\inetsrv\w3wp.exe
  filter2:
    winlog.event_data.Image: null
  filter3:
    winlog.event_data.Image|contains|all:
    - :\Program Files
    - \Microsoft SQL Server\
    winlog.event_data.Image|endswith: \Tools\Binn\SQLPS.exe
  filter4:
    winlog.event_data.Image|startswith:
    - C:\Program Files\Citrix\
    - C:\Program Files\Microsoft\Exchange Server\
  filter5:
    winlog.event_data.Image: C:\Windows\system32\ServerManager.exe
  selection:
    winlog.event_data.PipeName|startswith: \PSHost
falsepositives:
- Programs using PowerShell directly without invocation of a dedicated interpreter.
fields:
- winlog.ComputerName
- winlog.event_data.User
- winlog.event_data.Image
- winlog.event_data.PipeName
id: 58cb02d5-78ce-4692-b3e1-dce850aae41a
level: medium
logsource:
  category: pipe_created
  definition: Note that you have to configure logging for Named Pipe Events in Sysmon
    config (Event ID 17 and Event ID 18). The basic configuration is in popular sysmon
    configuration (https://github.com/SwiftOnSecurity/sysmon-config), but it is worth
    verifying. You can also use other repo, e.g. https://github.com/Neo23x0/sysmon-config,
    https://github.com/olafhartong/sysmon-modular. How to test detection? You can
    check powershell script from this site https://svch0st.medium.com/guide-to-named-pipes-and-hunting-for-cobalt-strike-pipes-dc46b2c5f575
  product: windows
modified: 2022/04/21
product: windows
references:
- https://threathunterplaybook.com/notebooks/windows/02_execution/WIN-190815181010.html
status: test
tags:
- attack.execution
- attack.t1059.001
title: Alternate PowerShell Hosts Pipe
