author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
category: pipe_created
date: 2019/09/12
definition: Note that you have to configure logging for Named Pipe Events in Sysmon
  config (Event ID 17 and Event ID 18). The basic configuration is in popular sysmon
  configuration (https://github.com/SwiftOnSecurity/sysmon-config), but it is worth
  verifying. You can also use other repo, e.g. https://github.com/Neo23x0/sysmon-config,
  https://github.com/olafhartong/sysmon-modular. How to test detection? You can check
  powershell script from this site https://svch0st.medium.com/guide-to-named-pipes-and-hunting-for-cobalt-strike-pipes-dc46b2c5f575
description: Detects execution of PowerShell via creation of named pipe starting with
  PSHost
detection:
  condition: selection
  selection:
    winlog.event_data.PipeName|startswith: \PSHost
falsepositives:
- Unknown
id: ac7102b4-9e1e-4802-9b4f-17c5524c015c
level: informational
logsource:
  category: pipe_created
  definition: Note that you have to configure logging for Named Pipe Events in Sysmon
    config (Event ID 17 and Event ID 18). The basic configuration is in popular sysmon
    configuration (https://github.com/SwiftOnSecurity/sysmon-config), but it is worth
    verifying. You can also use other repo, e.g. https://github.com/Neo23x0/sysmon-config,
    https://github.com/olafhartong/sysmon-modular. How to test detection? You can
    check powershell script from this site https://svch0st.medium.com/guide-to-named-pipes-and-hunting-for-cobalt-strike-pipes-dc46b2c5f575
  product: windows
modified: 2022/08/04
product: windows
references:
- https://threathunterplaybook.com/notebooks/windows/02_execution/WIN-190410151110.html
status: test
tags:
- attack.execution
- attack.t1059.001
title: PowerShell Execution Via Named Pipe
