author: Florian Roth
category: pipe_created
date: 2021/08/23
definition: Note that you have to configure logging for Named Pipe Events in Sysmon
  config (Event ID 17 and Event ID 18). The basic configuration is in popular sysmon
  configuration (https://github.com/SwiftOnSecurity/sysmon-config), but it is worth
  verifying. You can also use other repo, e.g. https://github.com/Neo23x0/sysmon-config,
  https://github.com/olafhartong/sysmon-modular. How to test detection? You can check
  powershell script from this site https://svch0st.medium.com/guide-to-named-pipes-and-hunting-for-cobalt-strike-pipes-dc46b2c5f575
description: Detects the pattern of a pipe name as used by the tool EfsPotato
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.PipeName|contains: \CtxShare
  selection:
    winlog.event_data.PipeName|contains:
    - \pipe\
    - \pipe\srvsvc
falsepositives:
- Unknown
id: 637f689e-b4a5-4a86-be0e-0100a0a33ba2
level: high
logsource:
  category: pipe_created
  definition: Note that you have to configure logging for Named Pipe Events in Sysmon
    config (Event ID 17 and Event ID 18). The basic configuration is in popular sysmon
    configuration (https://github.com/SwiftOnSecurity/sysmon-config), but it is worth
    verifying. You can also use other repo, e.g. https://github.com/Neo23x0/sysmon-config,
    https://github.com/olafhartong/sysmon-modular. How to test detection? You can
    check powershell script from this site https://svch0st.medium.com/guide-to-named-pipes-and-hunting-for-cobalt-strike-pipes-dc46b2c5f575
  product: windows
modified: 2022/06/20
product: windows
references:
- https://twitter.com/SBousseaden/status/1429530155291193354?s=20
- https://github.com/zcgonvh/EfsPotato
status: experimental
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1055
title: EfsPotato Named Pipe
