author: Roberto Rodriguez @Cyb3rWard0g
category: pipe_created
date: 2021/10/08
definition: Note that you have to configure logging for Named Pipe Events in Sysmon
  config (Event ID 17 and Event ID 18). The basic configuration is in popular sysmon
  configuration (https://github.com/SwiftOnSecurity/sysmon-config), but it is worth
  verifying. You can also use other repo, e.g. https://github.com/Neo23x0/sysmon-config,
  https://github.com/olafhartong/sysmon-modular. How to test detection? You can check
  powershell script from this site https://svch0st.medium.com/guide-to-named-pipes-and-hunting-for-cobalt-strike-pipes-dc46b2c5f575
description: Detects suspicious local connections via a named pipe to the AD FS configuration
  database (Windows Internal Database). Used to access information such as the AD
  FS configuration settings which contains sensitive information used to sign SAML
  tokens.
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.Image|endswith:
    - \Microsoft.IdentityServer.ServiceHost.exe
    - \Microsoft.Identity.Health.Adfs.PshSurrogate.exe
    - \AzureADConnect.exe
    - \Microsoft.Tri.Sensor.exe
    - \wsmprovhost.exe
    - \mmc.exe
    - \sqlservr.exe
    - \tssdis.exe
  selection:
    winlog.event_data.PipeName: \MICROSOFT##WID\tsql\query
falsepositives:
- Processes in the filter condition
id: 1ea13e8c-03ea-409b-877d-ce5c3d2c1cb3
level: high
logsource:
  category: pipe_created
  definition: Note that you have to configure logging for Named Pipe Events in Sysmon
    config (Event ID 17 and Event ID 18). The basic configuration is in popular sysmon
    configuration (https://github.com/SwiftOnSecurity/sysmon-config), but it is worth
    verifying. You can also use other repo, e.g. https://github.com/Neo23x0/sysmon-config,
    https://github.com/olafhartong/sysmon-modular. How to test detection? You can
    check powershell script from this site https://svch0st.medium.com/guide-to-named-pipes-and-hunting-for-cobalt-strike-pipes-dc46b2c5f575
  product: windows
modified: 2022/02/16
product: windows
references:
- https://github.com/Azure/Azure-Sentinel/blob/f99542b94afe0ad2f19a82cc08262e7ac8e1428e/Detections/SecurityEvent/ADFSDBNamedPipeConnection.yaml
- https://o365blog.com/post/adfs/
- https://github.com/Azure/SimuLand
status: experimental
tags:
- attack.collection
- attack.t1005
title: ADFS Database Named Pipe Connection
