author: Florian Roth
category: pipe_created
date: 2021/09/01
definition: Note that you have to configure logging for Named Pipe Events in Sysmon
  config (Event ID 17 and Event ID 18). The basic configuration is in popular sysmon
  configuration (https://github.com/SwiftOnSecurity/sysmon-config), but it is worth
  verifying. You can also use other repo, e.g. https://github.com/Neo23x0/sysmon-config,
  https://github.com/olafhartong/sysmon-modular. How to test detection? You can check
  powershell script from this site https://svch0st.medium.com/guide-to-named-pipes-and-hunting-for-cobalt-strike-pipes-dc46b2c5f575
description: Detects the WMI Event Consumer service scrcons.exe creating a named pipe
detection:
  condition: selection
  selection:
    winlog.event_data.Image|endswith: \scrcons.exe
falsepositives:
- Unknown
id: 493fb4ab-cdcc-4c4f-818c-0e363bd1e4bb
level: high
logsource:
  category: pipe_created
  definition: Note that you have to configure logging for Named Pipe Events in Sysmon
    config (Event ID 17 and Event ID 18). The basic configuration is in popular sysmon
    configuration (https://github.com/SwiftOnSecurity/sysmon-config), but it is worth
    verifying. You can also use other repo, e.g. https://github.com/Neo23x0/sysmon-config,
    https://github.com/olafhartong/sysmon-modular. How to test detection? You can
    check powershell script from this site https://svch0st.medium.com/guide-to-named-pipes-and-hunting-for-cobalt-strike-pipes-dc46b2c5f575
  product: windows
product: windows
references:
- https://github.com/RiccardoAncarani/LiquidSnake
status: experimental
title: WMI Event Consumer Created Named Pipe
