author: Florian Roth, Christian Burkard
category: pipe_created
date: 2021/07/30
definition: Note that you have to configure logging for Named Pipe Events in Sysmon
  config (Event ID 17 and Event ID 18). The basic configuration is in popular sysmon
  configuration (https://github.com/SwiftOnSecurity/sysmon-config), but it is worth
  verifying. You can also use other repo, e.g. https://github.com/Neo23x0/sysmon-config,
  https://github.com/olafhartong/sysmon-modular You can also use other repo, e.g.
  https://github.com/Neo23x0/sysmon-config, https://github.com/olafhartong/sysmon-modular.
  How to test detection? You can always use Cobalt Strike, but also you can check
  powershell script from this site https://svch0st.medium.com/guide-to-named-pipes-and-hunting-for-cobalt-strike-pipes-dc46b2c5f575
description: Detects the creation of a named pipe with a pattern found in CobaltStrike
  malleable C2 profiles
detection:
  condition: 1 of selection_malleable_profile* and not filter
  filter:
    winlog.event_data.PipeName:
    - \wkssvc
    - \spoolss
    - \scerpc
    - \ntsvcs
    - \SearchTextHarvester
    - \PGMessagePipe
    - \MsFteWds
  selection_malleable_profile_CatalogChangeListener:
    winlog.event_data.PipeName|endswith: -0,
    winlog.event_data.PipeName|startswith: \Winsock2\CatalogChangeListener-
  selection_malleable_profiles:
  - winlog.event_data.PipeName|startswith:
    - \mojo.5688.8052.183894939787088877
    - \mojo.5688.8052.35780273329370473
    - \mypipe-f
    - \mypipe-h
    - \ntsvcs
    - \scerpc
    - \win_svc
    - \spoolss
    - \msrpc_
    - \win\msrpc_
    - \wkssvc
    - \f53f
    - \windows.update.manager
    - \SearchTextHarvester
    - \DserNamePipe
    - \PGMessagePipe
    - \MsFteWds
    - \f4c3
    - \fullduplex_
    - \rpc_
  - winlog.event_data.PipeName:
    - \demoagent_11
    - \demoagent_22
falsepositives:
- Chrome instances using the exactly same name pipe named mojo.something
id: 85adeb13-4fc9-4e68-8a4a-c7cb2c336eb7
level: high
logsource:
  category: pipe_created
  definition: Note that you have to configure logging for Named Pipe Events in Sysmon
    config (Event ID 17 and Event ID 18). The basic configuration is in popular sysmon
    configuration (https://github.com/SwiftOnSecurity/sysmon-config), but it is worth
    verifying. You can also use other repo, e.g. https://github.com/Neo23x0/sysmon-config,
    https://github.com/olafhartong/sysmon-modular You can also use other repo, e.g.
    https://github.com/Neo23x0/sysmon-config, https://github.com/olafhartong/sysmon-modular.
    How to test detection? You can always use Cobalt Strike, but also you can check
    powershell script from this site https://svch0st.medium.com/guide-to-named-pipes-and-hunting-for-cobalt-strike-pipes-dc46b2c5f575
  product: windows
modified: 2021/08/26
product: windows
references:
- https://svch0st.medium.com/guide-to-named-pipes-and-hunting-for-cobalt-strike-pipes-dc46b2c5f575
- https://gist.github.com/MHaggis/6c600e524045a6d49c35291a21e10752
status: experimental
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1055
title: CobaltStrike Named Pipe Patterns
