author: Markus Neis
date: 2018/08/26
definition: 'Requirements:Enabled Block credential stealing from the Windows local
  security authority subsystem (lsass.exe) from Attack Surface Reduction (GUID: 9e6c4e1f-7d60-472f-ba1a-a39ef669e4b2)'
description: Detects Access to LSASS Process
detection:
  condition: selection and not 1 of filter_*
  filter_begins:
    winlog.event_data.ProcessName|startswith:
    - C:\Windows\System32\DriverStore\
    - C:\WINDOWS\Installer\
    - C:\Program Files\
    - C:\Program Files (x86)\
  filter_exact:
    winlog.event_data.ProcessName:
    - C:\Windows\System32\atiesrxx.exe
    - C:\Windows\System32\CompatTelRunner.exe
    - C:\Windows\System32\msiexec.exe
    - C:\Windows\System32\nvwmi64.exe
    - C:\Windows\System32\svchost.exe
    - C:\Windows\System32\Taskmgr.exe
    - C:\Windows\System32\wbem\WmiPrvSE.exe
    - C:\Windows\SysWOW64\msiexec.exe
  filter_thor:
    winlog.event_data.ProcessName|endswith:
    - \thor64.exe
    - \thor.exe
    winlog.event_data.ProcessName|startswith: C:\Windows\Temp\asgard2-agent\
  selection:
    winlog.event_data.Path|endswith: \lsass.exe
    winlog.event_id: 1121
falsepositives:
- Google Chrome GoogleUpdate.exe
- Some Taskmgr.exe related activity
id: a0a278fe-2c0e-4de2-ac3c-c68b08a9ba98
level: high
logsource:
  definition: 'Requirements:Enabled Block credential stealing from the Windows local
    security authority subsystem (lsass.exe) from Attack Surface Reduction (GUID:
    9e6c4e1f-7d60-472f-ba1a-a39ef669e4b2)'
  product: windows
  service: windefend
modified: 2022/08/13
product: windows
references:
- https://docs.microsoft.com/en-us/windows/security/threat-protection/windows-defender-exploit-guard/attack-surface-reduction-exploit-guard?WT.mc_id=twitter
service: windefend
status: experimental
tags:
- attack.credential_access
- attack.t1003.001
title: LSASS Access Detected via Attack Surface Reduction
