author: "J\xE1n Tren\u010Dansk\xFD"
date: 2020/07/28
description: Detects all actions taken by Windows Defender malware detection engines
detection:
  condition: selection
  selection:
    winlog.event_id:
    - 1006
    - 1116
    - 1015
    - 1117
falsepositives:
- Unlikely
id: 57b649ef-ff42-4fb0-8bf6-62da243a1708
level: high
logsource:
  product: windows
  service: windefend
product: windows
references:
- https://docs.microsoft.com/en-us/windows/security/threat-protection/windows-defender-antivirus/troubleshoot-windows-defender-antivirus
service: windefend
status: stable
tags:
- attack.execution
- attack.t1059
title: Windows Defender Threat Detected
