author: Christian Burkard
category: file_event
date: 2021/08/30
description: Detects the pattern of UAC bypass using cleanmgr.exe to create temporary
  files (UACMe 63)
detection:
  condition: selection
  selection:
    winlog.event_data.Image: C:\Windows\system32\cleanmgr.exe
    winlog.event_data.TargetFilename|contains: \AppData\Local\Temp\
    winlog.event_data.TargetFilename|endswith: .dll
    winlog.event_data.TargetFilename|startswith: C:\Users\
falsepositives:
- Unknown
id: 6a8a8a65-15ac-4722-adb7-c93c213c180a
level: high
logsource:
  category: file_event
  product: windows
product: windows
references:
- https://github.com/hfiref0x/UACME
status: experimental
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1548.002
title: UAC Bypass Using Cleanmgr Temp File Creation
