author: Florian Roth
category: file_event
date: 2018/02/10
description: Detects a dump file written by QuarksPwDump password dumper
detection:
  condition: selection
  selection:
    winlog.event_data.TargetFilename|contains|all:
    - \AppData\Local\Temp\SAM-
    - .dmp
falsepositives:
- Unknown
id: 847def9e-924d-4e90-b7c4-5f581395a2b4
level: critical
logsource:
  category: file_event
  product: windows
modified: 2020/08/23
product: windows
references:
- https://jpcertcc.github.io/ToolAnalysisResultSheet/details/QuarksPWDump.htm
status: experimental
tags:
- attack.credential_access
- attack.t1003.002
title: QuarksPwDump Dump File
