author: Christian Burkard
category: file_event
date: 2021/08/23
description: Detects the pattern of UAC Bypass using Windows Media Player osksupport.dll
  (UACMe 32)
detection:
  condition: 1 of selection*
  selection1:
    winlog.event_data.TargetFilename|endswith: \AppData\Local\Temp\OskSupport.dll
    winlog.event_data.TargetFilename|startswith: C:\Users\
  selection2:
    winlog.event_data.Image: C:\Windows\system32\DllHost.exe
    winlog.event_data.TargetFilename: C:\Program Files\Windows Media Player\osk.exe
falsepositives:
- Unknown
id: 68578b43-65df-4f81-9a9b-92f32711a951
level: high
logsource:
  category: file_event
  product: windows
product: windows
references:
- https://github.com/hfiref0x/UACME
status: experimental
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1548.002
title: UAC Bypass Using Windows Media Player - File
