author: omkar72, oscd.community
category: file_event
date: 2020/10/12
description: Detects suspicious .NET assembly executions
detection:
  condition: selection
  selection:
    winlog.event_data.TargetFilename|contains:
    - mshta
    - cscript
    - wscript
    - regsvr32
    - wmic
    winlog.event_data.TargetFilename|contains|all:
    - \AppData\Local\Microsoft\CLR
    - \UsageLogs\
falsepositives:
- Unknown
id: e4b63079-6198-405c-abd7-3fe8b0ce3263
level: high
logsource:
  category: file_event
  product: windows
product: windows
references:
- https://blog.menasec.net/2019/07/interesting-difr-traces-of-net-clr.html
status: experimental
tags:
- attack.execution
- attack.t1059.001
title: Suspcious CLR Logs Creation
