author: Teymur Kheirkhabarov (idea), Ryan Plas (rule), oscd.community
category: file_event
date: 2020/10/17
description: Search for dropping of files to Windows/Program Files fodlers by non-priviledged
  processes
detection:
  condition: integrity and (program_files or windows and not temp)
  integrity:
    winlog.event_data.IntegrityLevel: Medium
  program_files:
    winlog.event_data.TargetFilename|contains:
    - \Program Files\
    - \Program Files (x86)\
  temp:
    winlog.event_data.TargetFilename|contains: temp
  windows:
    winlog.event_data.TargetFilename|startswith: \Windows\
falsepositives:
- Unknown
id: d6d9f4fb-4c1c-4f53-b306-62a22c7c61e1
level: medium
logsource:
  category: file_event
  product: windows
modified: 2021/08/14
product: windows
references:
- https://image.slidesharecdn.com/kheirkhabarovoffzonefinal-181117201458/95/hunting-for-privilege-escalation-in-windows-environment-37-638.jpg
status: experimental
tags:
- attack.persistence
- attack.defense_evasion
- attack.t1574
- attack.t1574.010
title: Files Dropped to Program Files by Non-Priviledged Process
