author: Sander Wiebing
category: file_event
date: 2020/05/26
description: Detects the creation of a executable with a system process name in a
  suspicious folder
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.Image|endswith:
    - \Windows\System32\dism.exe
    winlog.event_data.TargetFilename|startswith:
    - C:\Windows\System32\
    - C:\Windows\system32\
    - C:\Windows\SysWow64\
    - C:\Windows\SysWOW64\
    - C:\Windows\winsxs\
    - C:\Windows\WinSxS\
    - \SystemRoot\System32\
  selection:
    winlog.event_data.TargetFilename|endswith:
    - \svchost.exe
    - \rundll32.exe
    - \services.exe
    - \powershell.exe
    - \regsvr32.exe
    - \spoolsv.exe
    - \lsass.exe
    - \smss.exe
    - \csrss.exe
    - \conhost.exe
    - \wininit.exe
    - \lsm.exe
    - \winlogon.exe
    - \explorer.exe
    - \taskhost.exe
    - \Taskmgr.exe
    - \taskmgr.exe
    - \sihost.exe
    - \RuntimeBroker.exe
    - \runtimebroker.exe
    - \smartscreen.exe
    - \dllhost.exe
    - \audiodg.exe
    - \wlanext.exe
falsepositives:
- System processes copied outside the default folder
fields:
- winlog.event_data.Image
id: d5866ddf-ce8f-4aea-b28e-d96485a20d3d
level: high
logsource:
  category: file_event
  product: windows
modified: 2021/05/16
product: windows
status: experimental
tags:
- attack.defense_evasion
- attack.t1036.005
title: File Created with System Process Name
