author: Mauno Pihelgas
category: webserver
date: 2020/01/14
description: Detects access to a webserver using well-known attack tools or scanners
  with default user-agent string
detection:
  condition: selection
  selection:
    http.http_user_agent:
    - owasp
    - nikto
    - badtunnel
    - nmap
    - gobuster
    - SPOOFED
falsepositives:
- Unknown
fields:
- src_ip
- http.url
- http.http_user_agent
id: fbe637a0-250a-47a2-a1a4-aae77437049e
level: high
logsource:
  category: webserver
  product: suricata
  service: http
product: suricata
references:
- https://github.com/ccdcoe/frankenstack
service: http
status: experimental
tags:
- attack.t1190
- attack.t1046
- attack.initial_access
- attack.discovery
- attack.t1518.001
title: Malicious or Suspicious User-Agent String
