author: Mauno Pihelgas
category: webserver
date: 2020/01/14
description: Detects access to a webserver with an empty user-agent string
detection:
  condition: selection
  selection:
    http.http_user_agent: '-'
falsepositives:
- Unknown
fields:
- src_ip
- http.url
- http.http_user_agent
id: 6441c598-1e52-4cde-810d-c76d38c79f06
level: high
logsource:
  category: webserver
  product: suricata
  service: http
product: suricata
references:
- https://github.com/ccdcoe/frankenstack
service: http
status: experimental
tags:
- attack.defense_evasion
- attack.t1027.005
title: Missing User-Agent String
