author: megan201296
category: registry_add
date: 2019/02/13
description: Detects new registry key created by Ursnif malware.
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.TargetObject|contains:
    - \SOFTWARE\AppDataLow\Software\Microsoft\Internet Explorer\
    - \SOFTWARE\AppDataLow\Software\Microsoft\RepService\
    - \SOFTWARE\AppDataLow\Software\Microsoft\IME\
    - \SOFTWARE\AppDataLow\Software\Microsoft\Edge\
  selection:
    winlog.event_data.EventType: CreateKey
    winlog.event_data.TargetObject|contains: \Software\AppDataLow\Software\Microsoft\
falsepositives:
- Unknown
id: 21f17060-b282-4249-ade0-589ea3591558
level: high
logsource:
  category: registry_add
  product: windows
modified: 2021/06/26
product: windows
references:
- https://blog.yoroi.company/research/ursnif-long-live-the-steganography/
- https://blog.trendmicro.com/trendlabs-security-intelligence/phishing-campaign-uses-hijacked-emails-to-deliver-ursnif-by-replying-to-ongoing-threads/
status: experimental
tags:
- attack.execution
- attack.t1112
title: Ursnif
