author: Markus Neis
category: registry_add
date: 2017/08/28
description: Detects the usage of Sysinternals Tools due to accepteula key being added
  to Registry
detection:
  condition: selection
  selection:
    winlog.event_data.EventType: CreateKey
    winlog.event_data.TargetObject|endswith: \EulaAccepted
falsepositives:
- Legitimate use of SysInternals tools
- Programs that use the same Registry Key
id: 25ffa65d-76d8-4da5-a832-3f2b0136e133
level: low
logsource:
  category: registry_add
  product: windows
modified: 2022/06/26
product: windows
references:
- https://twitter.com/Moti_B/status/1008587936735035392
status: experimental
tags:
- attack.resource_development
- attack.t1588.002
title: Usage of Sysinternals Tools
