author: Nasreddine Bencherchali
category: registry_add
date: 2022/08/24
description: Detects the usage of Suspicious Sysinternals Tools such as PsExec, Procdump...etc
  via the "accepteula" key being added to Registry
detection:
  condition: selection
  selection:
    winlog.event_data.EventType: CreateKey
    winlog.event_data.TargetObject|contains:
    - \PsExec
    - \ProcDump
    - \Handle
    - \LiveKd
    - \Process Explorer
    - \PsLoglist
    - \PsPasswd
    - \Active Directory Explorer
    - \Sysinternals
    winlog.event_data.TargetObject|endswith: \EulaAccepted
falsepositives:
- Legitimate use of SysInternals tools
id: c7da8edc-49ae-45a2-9e61-9fd860e4e73d
level: medium
logsource:
  category: registry_add
  product: windows
product: windows
references:
- https://twitter.com/Moti_B/status/1008587936735035392
related:
- id: 25ffa65d-76d8-4da5-a832-3f2b0136e133
  type: derived
status: experimental
tags:
- attack.resource_development
- attack.t1588.002
title: Usage of Suspicious Sysinternals Tools
