author: Florian Roth (rule), Jonhnathan Ribeiro
date: 2017/03/05
definition: Script block logging must be enabled for 4104, Module Logging must be
  enabled for 4103
description: Detects suspicious PowerShell invocation command parameters
detection:
  condition: all of convert_b64 or all of iex_selection or all of enc_selection or
    all of reg_selection or all of webclient_selection or all of iex_webclient
  convert_b64:
  - -nop
  - ' -w '
  - hidden
  - ' -c '
  - '[Convert]::FromBase64String'
  enc_selection:
  - ' -w '
  - hidden
  - -ep
  - bypass
  - -Enc
  iex_selection:
  - ' -w '
  - hidden
  - -noni
  - -nop
  - ' -c '
  - iex
  - New-Object
  iex_webclient:
  - iex
  - New-Object
  - Net.WebClient
  - .Download
  reg_selection:
  - powershell
  - reg
  - add
  - HKCU\software\microsoft\windows\currentversion\run
  webclient_selection:
  - bypass
  - -noprofile
  - -windowstyle
  - hidden
  - new-object
  - system.net.webclient
  - .download
falsepositives:
- Penetration tests
id: fce5f582-cc00-41e1-941a-c6fabf0fdb8c
level: high
logsource:
  definition: Script block logging must be enabled for 4104, Module Logging must be
    enabled for 4103
  product: windows
  service: powershell
product: windows
service: powershell
status: deprecated
tags:
- attack.execution
- attack.t1059.001
title: Suspicious PowerShell Invocations - Specific
