author: Florian Roth
date: 2017/03/05
description: Detects suspicious PowerShell download command
detection:
  condition: webclient and download
  download:
  - .DownloadFile(
  - .DownloadString(
  webclient:
  - System.Net.WebClient
falsepositives:
- PowerShell scripts that download content from the Internet
id: 65531a81-a694-4e31-ae04-f8ba5bc33759
level: medium
logsource:
  product: windows
  service: powershell
modified: 2021/09/21
product: windows
service: powershell
status: deprecated
tags:
- attack.execution
- attack.t1059.001
title: Suspicious PowerShell Download
