author: Florian Roth
date: 2017/03/14
description: Detects shellshock expressions in log files
detection:
  condition: keywords
  keywords:
  - (){:;};
  - () {:;};
  - () { :;};
  - () { :; };
falsepositives:
- Unknown
id: c67e0c98-4d39-46ee-8f6b-437ebf6b950e
level: high
logsource:
  product: linux
modified: 2021/04/28
product: linux
references:
- https://owasp.org/www-pdf-archive/Shellshock_-_Tudor_Enache.pdf
status: experimental
tags:
- attack.persistence
- attack.t1505.003
title: Shellshock Expression
