author: Sreeman
date: 2022/01/26
description: Detects potential PwnKit exploitation CVE-2021-4034 in auth logs
detection:
  condition: all of keyword
  keyword:
  - pkexec
  - The value for environment variable XAUTHORITY contains suscipious content
  - '[USER=root] [TTY=/dev/pts/0]'
falsepositives:
- Unknown
id: 0506a799-698b-43b4-85a1-ac4c84c720e9
level: high
logsource:
  product: linux
  service: auth
product: linux
references:
- https://twitter.com/wdormann/status/1486161836961579020
service: auth
status: experimental
tags:
- attack.privilege_escalation
- attack.t1548.001
title: PwnKit Local Privilege Escalation
