author: "\xD6mer G\xFCnal"
date: 2020/06/17
description: Detects setting proxy
detection:
  condition: keywords
  keywords:
  - http_proxy=*
  - https_proxy=*
falsepositives:
- Legitimate administration activities
id: 72f4ab3f-787d-495d-a55d-68c2ff46cf4c
level: low
logsource:
  product: linux
modified: 2021/11/27
product: linux
references:
- https://attack.mitre.org/techniques/T1090/
status: test
tags:
- attack.defense_evasion
title: Connection Proxy
