author: Nasreddine Bencherchali
category: registry_set
date: 2022/07/21
description: "Detects when an attacker modifies values of the Disk Cleanup Handler\
  \ in the registry to achieve persistence via autorun.\nThe disk cleanup manager\
  \ is part of the operating system. It displays the dialog box [\u2026] The user\
  \ has the option of enabling or disabling individual handlers by selecting or clearing\
  \ their check box in the disk cleanup manager's UI. Although Windows comes with\
  \ a number of disk cleanup handlers, they aren't designed to handle files produced\
  \ by other applications. Instead, the disk cleanup manager is designed to be flexible\
  \ and extensible by enabling any developer to implement and register their own disk\
  \ cleanup handler. Any developer can extend the available disk cleanup services\
  \ by implementing and registering a disk cleanup handler.\n"
detection:
  condition: root and 1 of selection_*
  root:
    winlog.event_data.EventType: SetValue
    winlog.event_data.TargetObject|contains: \SOFTWARE\Microsoft\Windows\CurrentVersion\Explorer\VolumeCaches\
  selection_autorun:
    winlog.event_data.Details: DWORD (0x00000001)
    winlog.event_data.TargetObject|contains: \Autorun
  selection_pre_after:
    Targetobject|contains:
    - \CleanupString
    - \PreCleanupString
    winlog.event_data.Details|contains:
    - cmd
    - powershell
    - rundll32
    - mshta
    - cscript
    - wscript
    - wsl
    - \Users\Public\
    - \Windows\TEMP\
    - \Microsoft\Windows\Start Menu\Programs\Startup\
falsepositives:
- Unknown
id: d4e2745c-f0c6-4bde-a3ab-b553b3f693cc
level: medium
logsource:
  category: registry_set
  product: windows
product: windows
references:
- https://persistence-info.github.io/Data/diskcleanuphandler.html
- https://www.hexacorn.com/blog/2018/09/02/beyond-good-ol-run-key-part-86/
status: experimental
tags:
- attack.persistence
title: Persistence Via Disk Cleanup Handler - Autorun
