author: frack113
category: registry_set
date: 2022/03/18
description: Detects registry modifications that disable internal tools or functions
  in explorer (malware like Agent Tesla uses this technique)
detection:
  condition: selection_set_1
  selection_set_1:
    winlog.event_data.Details: DWORD (0x00000001)
    winlog.event_data.EventType: SetValue
    winlog.event_data.TargetObject|endswith:
    - SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\NoLogOff
    - SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\NoDesktop
    - SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\NoRun
    - SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\NoFind
    - SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\NoControlPanel
    - SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\NoFileMenu
    - SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\NoClose
    - SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\NoSetTaskbar
    - SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\NoPropertiesMyDocuments
    - SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\NoTrayContextMenu
falsepositives:
- Legitimate admin script
id: 1c3121ed-041b-4d97-a075-07f54f20fb4a
level: medium
logsource:
  category: registry_set
  product: windows
modified: 2022/03/26
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1112/T1112.md
status: experimental
tags:
- attack.defense_evasion
- attack.t1112
title: Registry Explorer Policy Modification
