author: frack113
category: registry_set
date: 2022/01/06
description: There is an auto-elevated task called SilentCleanup located in %windir%\system32\cleanmgr.exe
  This can be abused to elevate any file with Administrator privileges without prompting
  UAC
detection:
  condition: selection
  selection:
    winlog.event_data.Details|contains: '&REM'
    winlog.event_data.EventType: SetValue
    winlog.event_data.TargetObject|endswith: \Environment\windir
falsepositives:
- Unknown
id: 724ea201-6514-4f38-9739-e5973c34f49a
level: high
logsource:
  category: registry_set
  product: windows
modified: 2022/03/26
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1548.002/T1548.002.md#atomic-test-9---bypass-uac-using-silentcleanup-task
- https://www.reddit.com/r/hacking/comments/ajtrws/bypassing_highest_uac_level_windows_810/
status: experimental
tags:
- attack.privilege_escalation
- attack.defense_evasion
- attack.t1548.002
title: Bypass UAC Using SilentCleanup Task
