author: frack113
category: registry_set
date: 2022/01/22
description: Hides the file extension through modification of the registry
detection:
  condition: selection_domains and not filter
  filter:
    winlog.event_data.Details:
    - DWORD (0x00000000)
    - DWORD (0x00000001)
    - (Empty)
  selection_domains:
    winlog.event_data.EventType: SetValue
    winlog.event_data.TargetObject|contains: \SOFTWARE\Microsoft\Windows\CurrentVersion\Internet
      Settings\ZoneMap\Domains\
falsepositives:
- Administrative scripts
id: 45e112d0-7759-4c2a-aa36-9f8fb79d3393
level: medium
logsource:
  category: registry_set
  product: windows
modified: 2022/04/04
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1112/T1112.md#atomic-test-4---add-domain-to-trusted-sites-zone
- https://docs.microsoft.com/en-us/troubleshoot/developer/browsers/security-privacy/ie-security-zones-registry-entries
status: experimental
tags:
- attack.persistence
- attack.t1137
title: IE Change Domain Zone
