author: Omkar Gudhate
category: registry_set
date: 2020/09/27
description: Detects changes to 'HKCU\Software\Classes\Folder\shell\open\command\DelegateExecute'
detection:
  condition: selection
  selection:
    winlog.event_data.EventType: Setvalue
    winlog.event_data.TargetObject: HKCU\Software\Classes\Folder\shell\open\command\DelegateExecute
falsepositives:
- Unknown
id: 07743f65-7ec9-404a-a519-913db7118a8d
level: high
logsource:
  category: registry_set
  product: windows
modified: 2022/06/26
product: windows
references:
- http://blog.sevagas.com/?Yet-another-sdclt-UAC-bypass
- https://www.exploit-db.com/exploits/47696
status: test
tags:
- attack.privilege_escalation
- attack.t1546
- attack.t1548
title: COM Hijack via Sdclt
