author: Florian Roth
category: registry_set
date: 2022/07/04
description: Detects the disabling of the Windows Defender eventlog as seen in relation
  to Lockbit 3.0 infections
detection:
  condition: selection
  selection:
    winlog.event_data.Details: DWORD (0x00000000)
    winlog.event_data.EventType: SetValue
    winlog.event_data.TargetObject|contains: \Microsoft\Windows\CurrentVersion\WINEVT\Channels\Microsoft-Windows-Windows
      Defender/Operational\Enabled
falsepositives:
- Other Antivirus software installations could cause Windows to disable that eventlog
  (unknown)
id: fcddca7c-b9c0-4ddf-98da-e1e2d18b0157
level: high
logsource:
  category: registry_set
  product: windows
product: windows
references:
- https://twitter.com/WhichbufferArda/status/1543900539280293889/photo/2
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001
title: Disabled Windows Defender Eventlog
