author: Tobias Michalski
category: registry_set
date: 2022/02/24
description: Detects disabling the CrashDump per registry (as used by HermeticWiper)
detection:
  condition: selection
  selection:
    winlog.event_data.Details: DWORD (0x00000000)
    winlog.event_data.EventType: SetValue
    winlog.event_data.TargetObject|contains: SYSTEM\CurrentControlSet\Control\CrashControl
falsepositives:
- Legitimate disabling of crashdumps
id: 2ff692c2-4594-41ec-8fcb-46587de769e0
level: medium
logsource:
  category: registry_set
  product: windows
modified: 2022/08/23
product: windows
references:
- https://www.sentinelone.com/labs/hermetic-wiper-ukraine-under-attack/
status: experimental
tags:
- attack.t1564
- attack.t1112
title: CrashControl CrashDump Disabled
