author: Victor Sergeev, Daniil Yugoslavskiy, Gleb Sukhodolskiy, Timur Zinniatullin,
  oscd.community, Tim Shelton, frack113 (split)
category: registry_set
date: 2019/10/25
description: Detects modification of autostart extensibility point (ASEP) in registry.
detection:
  condition: all of wow_current_version_* and not 1 of filter_*
  filter_dotnet:
    winlog.event_data.Details|endswith: .exe" /burn.runonce
    winlog.event_data.Details|startswith:
    - '"C:\ProgramData\Package Cache\{7037b699-7382-448c-89a7-4765961d2537}\windowsdesktop-runtime-'
    - '"C:\ProgramData\Package Cache\{e2d1ae32-dd1d-4ad7-a298-10e42e7840fc}\windowsdesktop-runtime-'
    winlog.event_data.Image|contains: \windowsdesktop-runtime-
    winlog.event_data.TargetObject|endswith:
    - \WOW6432Node\Microsoft\Windows\CurrentVersion\RunOnce\{e2d1ae32-dd1d-4ad7-a298-10e42e7840fc}
    - \WOW6432Node\Microsoft\Windows\CurrentVersion\RunOnce\{7037b699-7382-448c-89a7-4765961d2537}
  filter_dropbox:
  - winlog.event_data.Details|endswith: -A251-47B7-93E1-CDD82E34AF8B}
  - winlog.event_data.Details: grpconv -o
  - winlog.event_data.Details|contains|all:
    - C:\Program Files
    - \Dropbox\Client\Dropbox.exe
    - ' /systemstartup'
  filter_edge:
    winlog.event_data.Image|contains|all:
    - C:\Program Files (x86)\Microsoft\EdgeUpdate\Install\{
    - \setup.exe
  filter_empty:
    winlog.event_data.Details: (Empty)
  filter_evernote:
    winlog.event_data.TargetObject|endswith: \Explorer\Browser Helper Objects\{92EF2EAD-A7CE-4424-B0DB-499CF856608E}\NoExplorer
  filter_ms_win_desktop_runtime:
    winlog.event_data.Details|startswith: '"C:\ProgramData\Package Cache\{d21a4f20-968a-4b0c-bf04-a38da5f06e41}\windowsdesktop-runtime-'
  filter_msoffice1:
    winlog.event_data.Image: C:\Program Files\Common Files\Microsoft Shared\ClickToRun\OfficeClickToRun.exe
    winlog.event_data.TargetObject|contains: \Office\ClickToRun\REGISTRY\MACHINE\Software\Wow6432Node\
  filter_msoffice2:
    winlog.event_data.Image:
    - C:\Program Files\Microsoft Office\root\integration\integrator.exe
    - C:\Program Files (x86)\Microsoft Office\root\integration\integrator.exe
    winlog.event_data.TargetObject|contains: \Explorer\Browser Helper Objects\{31D09BA0-12F5-4CCE-BE8A-2923E76605DA}\
  filter_office:
    winlog.event_data.Image|endswith: \OfficeClickToRun.exe
    winlog.event_data.Image|startswith:
    - C:\Program Files\Common Files\Microsoft Shared\ClickToRun\
    - C:\Program Files\Common Files\Microsoft Shared\ClickToRun\Updates\
  wow_current_version_base:
    winlog.event_data.EventType: SetValue
    winlog.event_data.TargetObject|contains: \SOFTWARE\Wow6432Node\Microsoft\Windows\CurrentVersion
  wow_current_version_keys:
    winlog.event_data.TargetObject|contains:
    - \ShellServiceObjectDelayLoad
    - \Run\
    - \RunOnce\
    - \RunOnceEx\
    - \RunServices\
    - \RunServicesOnce\
    - \Explorer\ShellServiceObjects
    - \Explorer\ShellIconOverlayIdentifiers
    - \Explorer\ShellExecuteHooks
    - \Explorer\SharedTaskScheduler
    - \Explorer\Browser Helper Objects
falsepositives:
- Legitimate software automatically (mostly, during installation) sets up autorun
  keys for legitimate reason
- Legitimate administrator sets up autorun keys for legitimate reason
fields:
- OldValueType
- NewValueType
- winlog.event_data.SecurityID
- winlog.event_data.ObjectName
id: b29aed60-ebd1-442b-9cb5-16a1d0324adb
level: medium
logsource:
  category: registry_set
  product: windows
modified: 2022/08/05
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1547.001/T1547.001.md
- https://docs.microsoft.com/en-us/sysinternals/downloads/autoruns
- https://gist.github.com/GlebSukhodolskiy/0fc5fa5f482903064b448890db1eaf9d
- https://oddvar.moe/2018/03/21/persistence-using-runonceex-hidden-from-autoruns-exe/
related:
- id: 17f878b8-9968-4578-b814-c4217fc5768c
  type: derived
status: experimental
tags:
- attack.persistence
- attack.t1547.001
title: Wow6432Node CurrentVersion Autorun Keys Modification
