author: Nasreddine Bencherchali
category: registry_set
date: 2022/07/21
description: Detects when an attacker adds a new "Debugger" value to the "Hangs" key
  in order to achieve persistence which will get invoked when an application crashes
detection:
  condition: selection
  selection:
    winlog.event_data.EventType: SetValue
    winlog.event_data.TargetObject|contains: \SOFTWARE\Microsoft\Windows\Windows Error
      Reporting\Hangs\Debugger
falsepositives:
- This value is not set by default but could be rarly used by administrators
id: 833ef470-fa01-4631-a79b-6f291c9ac498
level: high
logsource:
  category: registry_set
  product: windows
product: windows
references:
- https://persistence-info.github.io/Data/wer_debugger.html
- https://www.hexacorn.com/blog/2019/09/20/beyond-good-ol-run-key-part-116/
status: experimental
tags:
- attack.persistence
title: Add Debugger Entry To Hangs Key For Persistence
