author: Bhabesh Raj
category: registry_set
date: 2021/01/10
description: Detects persistence via Visual Studio Tools for Office (VSTO) add-ins
  in Office applications.
detection:
  condition: selection and not 1 of filter_*
  filter_avg:
    winlog.event_data.Image: C:\Program Files\AVG\Antivirus\RegSvr.exe
    winlog.event_data.TargetObject|contains: \Microsoft\Office\Outlook\Addins\Antivirus.AsOutExt\
  filter_image:
    winlog.event_data.Image|endswith:
    - \msiexec.exe
    - \regsvr32.exe
  filter_office:
    winlog.event_data.Image|endswith:
    - \winword.exe
    - \integrator.exe
    - \OfficeClickToRun.exe
  selection:
    winlog.event_data.EventType: SetValue
    winlog.event_data.TargetObject|contains:
    - \Software\Microsoft\Office\Outlook\Addins\
    - \Software\Microsoft\Office\Word\Addins\
    - \Software\Microsoft\Office\Excel\Addins\
    - \Software\Microsoft\Office\Powerpoint\Addins\
    - \Software\Microsoft\VSTO\Security\Inclusion\
falsepositives:
- Legitimate Addin Installation
id: 9d15044a-7cfe-4d23-8085-6ebc11df7685
level: medium
logsource:
  category: registry_set
  product: windows
modified: 2022/06/10
product: windows
references:
- https://twitter.com/_vivami/status/1347925307643355138
- https://vanmieghem.io/stealth-outlook-persistence/
status: experimental
tags:
- attack.t1137.006
- attack.persistence
title: Stealthy VSTO Persistence
