author: Nasreddine Bencherchali
category: registry_set
date: 2022/08/01
description: Detects tampering of autologger trace sessions which is a technique used
  by attackers to disable logging
detection:
  condition: all of selection*
  selection:
    winlog.event_data.TargetObject|contains: \System\CurrentControlSet\Control\WMI\Autologger\
  selection_values:
    winlog.event_data.Details: DWORD (0x00000000)
    winlog.event_data.EventType: SetValue
    winlog.event_data.TargetObject|contains:
    - \EventLog-
    - \Defender
    winlog.event_data.TargetObject|endswith:
    - \Enabled
    - \Start
falsepositives:
- Unknown
id: f37b4bce-49d0-4087-9f5b-58bffda77316
level: high
logsource:
  category: registry_set
  product: windows
product: windows
references:
- https://twitter.com/MichalKoczwara/status/1553634816016498688
- https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/
status: experimental
tags:
- attack.defense_evasion
title: AutoLogger Sessions Tamper
