author: frack113
category: registry_set
date: 2022/05/28
description: 'Detects setting a custom URL for OneDriveStandaloneUpdater.exe to download
  a file from the Internet without executing any

  anomalous executables with suspicious arguments. The downloaded file will be in
  C:\Users\redacted\AppData\Local\Microsoft\OneDrive\StandaloneUpdaterreSignInSettingsConfig.json

  '
detection:
  condition: selection
  selection:
    winlog.event_data.EventType: SetValue
    winlog.event_data.TargetObject|contains: \SOFTWARE\Microsoft\OneDrive\UpdateOfficeConfig\UpdateRingSettingURLFromOC
falsepositives:
- Unknown
id: 3aff0be0-7802-4a7e-a4fa-c60c74bc5e1d
level: high
logsource:
  category: registry_set
  product: windows
product: windows
references:
- https://lolbas-project.github.io/lolbas/Binaries/OneDriveStandaloneUpdater/
status: experimental
tags:
- attack.command_and_control
- attack.t1105
title: Lolbas OneDriveStandaloneUpdater.exe Proxy Download
