author: frack113
category: registry_set
date: 2022/04/04
description: Detects the modification of the registry to allow a driver or service
  to persist in Safe Mode.
detection:
  condition: selection and not 1 of filter_*
  filter_sophos:
    winlog.event_data.Image: C:\WINDOWS\system32\msiexec.exe
    winlog.event_data.TargetObject:
    - HKLM\System\CurrentControlSet\Control\SafeBoot\Minimal\SAVService\(Default)
    - HKLM\System\CurrentControlSet\Control\SafeBoot\Network\SAVService\(Default)
  selection:
    winlog.event_data.Details: Service
    winlog.event_data.EventType: Setvalue
    winlog.event_data.TargetObject|endswith: \(Default)
    winlog.event_data.TargetObject|startswith:
    - HKLM\SYSTEM\CurrentControlSet\Control\SafeBoot\Minimal\
    - HKLM\SYSTEM\CurrentControlSet\Control\SafeBoot\Network\
falsepositives:
- Unknown
id: 1547e27c-3974-43e2-a7d7-7f484fb928ec
level: high
logsource:
  category: registry_set
  product: windows
modified: 2022/06/26
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1112/T1112.md#atomic-test-33---windows-add-registry-value-to-load-service-in-safe-mode-without-network
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1112/T1112.md#atomic-test-34---windows-add-registry-value-to-load-service-in-safe-mode-with-network
status: experimental
tags:
- attack.defense_evasion
- attack.t1564.001
title: Registry Persitence via Service in Safe Mode
