author: Nasreddine Bencherchali
category: registry_set
date: 2022/07/21
description: Detects when an attacker register a new SIP provider for persistence
  and defense evasion
detection:
  condition: selection
  selection:
    winlog.event_data.EventType: SetValue
    winlog.event_data.TargetObject|contains: \SOFTWARE\Microsoft\Windows NT\CurrentVersion\Winlogon\mpnotify
falsepositives:
- Might trigger if a legitimate new SIP provider is registered. But this is not a
  common occurrence in an environment and should be investigated either way
id: 92772523-d9c1-4c93-9547-b0ca500baba3
level: high
logsource:
  category: registry_set
  product: windows
product: windows
references:
- https://persistence-info.github.io/Data/mpnotify.html
- https://www.youtube.com/watch?v=ggY3srD9dYs&ab_channel=GrzegorzTworek
status: experimental
tags:
- attack.persistence
title: Persistence Via Mpnotify
