author: "AlertIQ, J\xE1n Tren\u010Dansk\xFD, frack113, Nasreddine Bencherchali"
category: registry_set
date: 2022/08/01
description: Detects when attackers or tools disable Windows Defender functionalities
  via the windows registry
detection:
  condition: root and 1 of selection_*
  root:
    winlog.event_data.EventType: SetValue
    winlog.event_data.TargetObject|contains: \SOFTWARE\Microsoft\Windows Defender\
  selection_dword_0:
    winlog.event_data.Details: DWORD (0x00000000)
    winlog.event_data.TargetObject|endswith:
    - \SpyNet\SpynetReporting
    - \SpyNet\SubmitSamplesConsent
    - \MpEngine\MpEnablePus
  selection_dword_1:
    winlog.event_data.Details: DWORD (0x00000001)
    winlog.event_data.TargetObject|endswith:
    - \Real-Time Protection\DisableBehaviorMonitoring
    - \Real-Time Protection\DisableIOAVProtection
    - \Real-Time Protection\DisableOnAccessProtection
    - \Real-Time Protection\DisableRealtimeMonitoring
    - \Real-Time Protection\DisableScanOnRealtimeEnable
    - \Reporting\DisableEnhancedNotifications
    - \SpyNet\DisableBlockAtFirstSeen
    - \DisableAntiSpyware
    - \DisableAntiVirus
falsepositives:
- Administrator actions
id: 0eb46774-f1ab-4a74-8238-1155855f2263
level: high
logsource:
  category: registry_set
  product: windows
product: windows
references:
- https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/
- https://gist.github.com/anadr/7465a9fde63d41341136949f14c21105
- https://admx.help/?Category=Windows_7_2008R2&Policy=Microsoft.Policies.WindowsDefender::SpyNetReporting
- https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/ransomware-hive-conti-avoslocker
related:
- id: a64e4198-c1c8-46a5-bc9c-324c86455fd4
  type: obsoletes
- id: fd115e64-97c7-491f-951c-fc8da7e042fa
  type: obsoletes
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001
title: Disable Windows Defender Functionalities Via Registry Keys
