author: frack113, Nasreddine Bencherchali
category: registry_set
date: 2022/03/18
description: Detects registry modifications that change features of internal Windows
  tools (malware like Agent Tesla uses this technique)
detection:
  condition: 1 of selection_set_*
  selection_set_0:
    winlog.event_data.Details: DWORD (0x00000000)
    winlog.event_data.EventType: SetValue
    winlog.event_data.TargetObject|endswith:
    - SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\System\shutdownwithoutlogon
    - SOFTWARE\Microsoft\Windows\CurrentVersion\PushNotifications\ToastEnabled
    - \SYSTEM\CurrentControlSet\Control\Storage\Write Protection
    - \SYSTEM\CurrentControlSet\Control\StorageDevicePolicies\WriteProtect
  selection_set_1:
    winlog.event_data.Details: DWORD (0x00000001)
    winlog.event_data.EventType: SetValue
    winlog.event_data.TargetObject|endswith:
    - SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\System\DisableRegistryTools
    - SOFTWARE\Policies\Microsoft\Windows\System\DisableCMD
    - SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\System\DisableTaskmgr
    - SOFTWARE\Policies\Microsoft\Windows\Explorer\DisableNotificationCenter
    - SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\System\DisableChangePassword
    - SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\System\DisableLockWorkstation
    - SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\StartMenuLogOff
falsepositives:
- Legitimate admin script
id: e2482f8d-3443-4237-b906-cc145d87a076
level: medium
logsource:
  category: registry_set
  product: windows
modified: 2022/06/03
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1112/T1112.md
- https://www.mandiant.com/resources/unc2165-shifts-to-evade-sanctions
status: experimental
tags:
- attack.defense_evasion
- attack.t1112
title: Disable Internal Tools or Feature in Registry
