author: Victor Sergeev, Daniil Yugoslavskiy, Gleb Sukhodolskiy, Timur Zinniatullin,
  oscd.community, Tim Shelton, frack113 (split)
category: registry_set
date: 2019/10/25
description: Detects modification of autostart extensibility point (ASEP) in registry.
detection:
  condition: winsock_parameters_base and winsock_parameters and not filter
  filter:
  - winlog.event_data.Details: (Empty)
  - winlog.event_data.Image: C:\Windows\System32\MsiExec.exe
  - winlog.event_data.Image: C:\Windows\syswow64\MsiExec.exe
  winsock_parameters:
    winlog.event_data.TargetObject|contains:
    - \Protocol_Catalog9\Catalog_Entries
    - \NameSpace_Catalog5\Catalog_Entries
  winsock_parameters_base:
    winlog.event_data.EventType: SetValue
    winlog.event_data.TargetObject|contains: \System\CurrentControlSet\Services\WinSock2\Parameters
falsepositives:
- Legitimate software automatically (mostly, during installation) sets up autorun
  keys for legitimate reason
- Legitimate administrator sets up autorun keys for legitimate reason
fields:
- OldValueType
- NewValueType
- winlog.event_data.SecurityID
- winlog.event_data.ObjectName
id: d6c2ce7e-afb5-4337-9ca4-4b5254ed0565
level: medium
logsource:
  category: registry_set
  product: windows
modified: 2022/03/26
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1547.001/T1547.001.md
- https://docs.microsoft.com/en-us/sysinternals/downloads/autoruns
- https://gist.github.com/GlebSukhodolskiy/0fc5fa5f482903064b448890db1eaf9d
related:
- id: 17f878b8-9968-4578-b814-c4217fc5768c
  type: derived
status: experimental
tags:
- attack.persistence
- attack.t1547.001
title: WinSock2 Autorun Keys Modification
