author: Nasreddine Bencherchali
category: registry_set
date: 2022/08/09
description: Detects modification to the "Default" value of the "MyComputer" key and
  subkeys to point to a custom binary that will be launched whenever the associated
  action is executed (see reference section for example)
detection:
  condition: selection
  selection:
    winlog.event_data.EventType: SetValue
    winlog.event_data.TargetObject|contains: \SOFTWARE\Microsoft\Windows\CurrentVersion\Explorer\MyComputer
    winlog.event_data.TargetObject|endswith: (Default)
falsepositives:
- Unlikely but if you experience FPs add specific processes and locations you would
  like to monitor for
id: 8fbe98a8-8f9d-44f8-aa71-8c572e29ef06
level: high
logsource:
  category: registry_set
  product: windows
product: windows
references:
- https://www.hexacorn.com/blog/2017/01/18/beyond-good-ol-run-key-part-55/
status: experimental
tags:
- attack.persistence
title: Persistence Via MyComputer Key and SubKeys
