author: Florian Roth, frack113
category: registry_set
date: 2022/05/02
description: Detect the creation of a service with a service binary located in a suspicious
  directory
detection:
  condition: 1 of selection_*
  selection_1:
    winlog.event_data.Details:
    - DWORD (0x00000000)
    - DWORD (0x00000001)
    - DWORD (0x00000002)
    winlog.event_data.EventType: SetValue
    winlog.event_data.Image|contains:
    - \Users\Public\
    - \Perflogs\
    - \ADMIN$\
    - \Temp\
    winlog.event_data.TargetObject|endswith: \Start
    winlog.event_data.TargetObject|startswith: HKLM\System\CurrentControlSet\Services\
  selection_2:
    winlog.event_data.Details|contains:
    - \Users\Public\
    - \Perflogs\
    - \ADMIN$\
    - \Temp\
    winlog.event_data.EventType: SetValue
    winlog.event_data.TargetObject|endswith: \ImagePath
    winlog.event_data.TargetObject|startswith: HKLM\System\CurrentControlSet\Services\
falsepositives:
- Unknown
id: a07f0359-4c90-4dc4-a681-8ffea40b4f47
level: high
logsource:
  category: registry_set
  product: windows
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md
related:
- id: c0abc838-36b0-47c9-b3b3-a90c39455382
  type: obsoletes
status: experimental
tags:
- attack.defense_evasion
- attack.t1112
title: Service Binary in Suspicious Folder
