author: frack113
category: registry_set
date: 2022/08/07
description: Detects when an attacker adds a new "Debugger" value to the "DbgManagedDebugger"
  key in order to achieve persistence which will get invoked when an application crashes
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.Details: '"C:\Windows\system32\vsjitdebugger.exe" PID %d APPDOM
      %d EXTEXT "%s" EVTHDL %d'
  selection:
    winlog.event_data.EventType: SetValue
    winlog.event_data.TargetObject|endswith: \Microsoft\.NETFramework\DbgManagedDebugger
falsepositives:
- Legitimate use of the key to setup a debugger. Which is often the case on developers
  machines
id: 9827ae57-3802-418f-994b-d5ecf5cd974b
level: medium
logsource:
  category: registry_set
  product: windows
product: windows
references:
- https://www.hexacorn.com/blog/2013/09/19/beyond-good-ol-run-key-part-4/
- https://github.com/last-byte/PersistenceSniper
status: experimental
tags:
- attack.persistence
- attack.t1574
title: Add Debugger Entry To DbgManagedDebugger For Persistence
