author: frack113
category: registry_set
date: 2022/08/19
description: Detect set EnableFirewall to 0 to disable the windows firewall
detection:
  condition: selection
  selection:
    winlog.event_data.Details: DWORD (0x00000000)
    winlog.event_data.EventType: SetValue
    winlog.event_data.TargetObject|endswith:
    - \SOFTWARE\Policies\Microsoft\WindowsFirewall\StandardProfile\EnableFirewall
    - \SOFTWARE\Policies\Microsoft\WindowsFirewall\DomainProfile\EnableFirewall
falsepositives:
- Unknown
id: e78c408a-e2ea-43cd-b5ea-51975cf358c0
level: medium
logsource:
  category: registry_set
  product: windows
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1562.004/T1562.004.md
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.004
title: Disable Windows Firewall by Registry
