author: EagleEye Team, Florian Roth, NVISO
category: registry_set
date: 2020/05/13
description: Detects a new and suspicious printer port creation in Registry that could
  be an attempt to exploit CVE-2020-1048
detection:
  condition: selection
  selection:
    winlog.event_data.Details|contains:
    - .dll
    - .exe
    - .bat
    - .com
    - 'C:'
    winlog.event_data.EventType: SetValue
    winlog.event_data.TargetObject|startswith: HKLM\SOFTWARE\Microsoft\Windows NT\CurrentVersion\Ports
falsepositives:
- New printer port install on host
id: 7ec912f2-5175-4868-b811-ec13ad0f8567
level: high
logsource:
  category: registry_set
  product: windows
modified: 2022/01/13
product: windows
references:
- https://windows-internals.com/printdemon-cve-2020-1048/
status: test
tags:
- attack.persistence
- attack.execution
- attack.defense_evasion
- attack.t1112
title: Suspicious New Printer Ports in Registry (CVE-2020-1048)
