author: "Maxime Thiebaut (@0xThiebaut), oscd.community, C\xE9dric Hien"
category: registry_set
date: 2020/04/14
description: Detects potential COM object hijacking leveraging the COM Search Order
detection:
  condition: selection and not 1 of filter*
  filter1:
    winlog.event_data.Details|contains:
    - '%%systemroot%%\system32\'
    - '%%systemroot%%\SysWow64\'
  filter2:
    winlog.event_data.Details|contains|all:
    - \AppData\Local\Microsoft\TeamsMeetingAddin\
    - \Microsoft.Teams.AddinLoader.dll
  filter3:
    winlog.event_data.Details|contains|all:
    - \AppData\Roaming\Dropbox\
    - \DropboxExt64.*.dll
  filter4:
    winlog.event_data.Details|endswith: TmopIEPlg.dll
  filter5:
    winlog.event_data.Image:
    - C:\WINDOWS\system32\wuauclt.exe
    - C:\WINDOWS\system32\svchost.exe
  filterOneDrive:
    winlog.event_data.Details|contains:
    - \AppData\Local\Microsoft\OneDrive\
    - \FileCoAuthLib64.dll
    - \FileSyncShell64.dll
    - \FileSyncApi64.dll
  filter_bonjourlib:
    winlog.event_data.Details:
    - C:\Windows\system32\dnssdX.dll
    - C:\Windows\SysWOW64\dnssdX.dll
  filter_defender:
    winlog.event_data.Image|endswith: \MsMpEng.exe
    winlog.event_data.Image|startswith:
    - C:\ProgramData\Microsoft\Windows Defender\Platform\
    - C:\Program Files\Windows Defender\
  filter_dx:
    winlog.event_data.Image: C:\WINDOWS\SYSTEM32\dxdiag.exe
  filter_edge:
    winlog.event_data.Image|endswith: \MicrosoftEdgeUpdateComRegisterShell64.exe
  filter_gameservice:
    winlog.event_data.Details|contains: C:\WINDOWS\system32\GamingServicesProxy.dll
  filter_health_service:
    winlog.event_data.Image: C:\WINDOWS\system32\SecurityHealthService.exe
  filter_nvidia:
    winlog.event_data.Details|contains: \FileRepository\nvmdi.inf
  filter_poqexec:
    winlog.event_data.Details|contains: C:\Windows\System32\Autopilot.dll
    winlog.event_data.Image: C:\Windows\System32\poqexec.exe
  filter_printextensionmanager:
    winlog.event_data.Details: C:\Windows\system32\spool\drivers\x64\3\PrintConfig.dll
  filter_programdata:
    winlog.event_data.Details|startswith: C:\ProgramData\Microsoft\
  filter_programfiles:
    winlog.event_data.Details|startswith:
    - C:\Program Files\
    - C:\Program Files (x86)\
  filter_python:
    winlog.event_data.Details:
    - C:\Windows\pyshellext.amd64.dll
    - C:\Windows\pyshellext.dll
  filter_sec_health_svc:
    winlog.event_data.Details|contains: C:\Windows\System32\SecurityHealth
    winlog.event_data.Image: C:\Windows\system32\SecurityHealthService.exe
  selection:
    winlog.event_data.EventType: SetValue
    winlog.event_data.TargetObject|endswith: \InprocServer32\(Default)
    winlog.event_data.TargetObject|startswith:
    - HKCR\CLSID\
    - HKCU\Software\Classes\CLSID\
falsepositives:
- Some installed utilities (i.e. OneDrive) may serve new COM objects at user-level
id: a0ff33d8-79e4-4cef-b4f3-9dc4133ccd12
level: medium
logsource:
  category: registry_set
  product: windows
modified: 2022/09/02
product: windows
references:
- https://www.cyberbit.com/blog/endpoint-security/com-hijacking-windows-overlooked-security-vulnerability/
- https://attack.mitre.org/techniques/T1546/015/
status: experimental
tags:
- attack.persistence
- attack.t1546.015
title: Windows Registry Persistence COM Search Order Hijacking
