author: Jose Rodriguez (@Cyb3rPandaH), OTR (Open Threat Research)
category: registry_set
date: 2020/09/10
description: This rule detects cor_enable_profiling and cor_profiler environment variables
  being set and configured.
detection:
  condition: selection
  selection:
    winlog.event_data.EventType: Setvalue
    winlog.event_data.TargetObject|endswith:
    - \COR_ENABLE_PROFILING
    - \COR_PROFILER
id: ad89044a-8f49-4673-9a55-cbd88a1b374f
level: high
logsource:
  category: registry_set
  product: windows
modified: 2022/06/26
product: windows
references:
- https://twitter.com/jamieantisocial/status/1304520651248668673
- https://www.slideshare.net/JamieWilliams130/started-from-the-bottom-exploiting-data-sources-to-uncover-attck-behaviors
- https://www.sans.org/cyber-security-summit/archives
status: test
tags:
- attack.persistence
- attack.privilege_escalation
- attack.defense_evasion
- attack.t1574.012
title: Enabling COR Profiler Environment Variables
