author: frack113
category: registry_set
date: 2022/04/02
description: Detects the modification of the registry of the currently logged in user
  to disable PowerShell module logging, script block logging or transcription and
  script execution logging
detection:
  condition: selection
  selection:
    winlog.event_data.Details: DWORD (0x00000000)
    winlog.event_data.EventType: SetValue
    winlog.event_data.TargetObject|endswith:
    - SOFTWARE\Policies\Microsoft\Windows\PowerShell\ModuleLogging\EnableModuleLogging
    - SOFTWARE\Policies\Microsoft\Windows\PowerShell\ScriptBlockLogging\EnableScriptBlockLogging
    - SOFTWARE\Policies\Microsoft\Windows\PowerShell\Transcription\EnableTranscripting
    - SOFTWARE\Policies\Microsoft\Windows\PowerShell\EnableScripts
falsepositives:
- Unknown
id: fecfd1a1-cc78-4313-a1ea-2ee2e8ec27a7
level: medium
logsource:
  category: registry_set
  product: windows
modified: 2022/06/26
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1112/T1112.md#atomic-test-32---windows-powershell-logging-disabled
status: experimental
tags:
- attack.defense_evasion
- attack.t1564.001
title: PowerShell Logging Disabled
