author: Nasreddine Bencherchali
category: registry_set
date: 2022/07/21
description: Detects when an attacker modifies the registry value of the "hhctrl"
  to point to a custom binary
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.Details: C:\Windows\System32\hhctrl.ocx
  selection:
    winlog.event_data.EventType: SetValue
    winlog.event_data.TargetObject|contains: \CLSID\{52A2AAAE-085D-4187-97EA-8C30DB990436}\InprocServer32\(Default)
falsepositives:
- Unlikely
id: f10ed525-97fe-4fed-be7c-2feecca941b1
level: high
logsource:
  category: registry_set
  product: windows
product: windows
references:
- https://persistence-info.github.io/Data/hhctrl.html
- https://www.hexacorn.com/blog/2018/04/23/beyond-good-ol-run-key-part-77/
status: experimental
tags:
- attack.persistence
title: Persistence Via Hhctrl.ocx
