author: frack113
category: registry_set
date: 2022/06/19
description: 'Detects processes setting a new DLL in DllName in under HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Services\W32Time\TimeProvider.
  Adversaries may abuse time providers to execute DLLs when the system boots. The
  Windows Time service (W32Time) enables time synchronization across and within domains.

  '
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.Details: C:\Windows\SYSTEM32\w32time.DLL
  selection:
    winlog.event_data.EventType: SetValue
    winlog.event_data.TargetObject|endswith: DllName
    winlog.event_data.TargetObject|startswith: HKLM\System\CurrentControlSet\Services\W32Time\TimeProviders
falsepositives:
- Unknown
id: e88a6ddc-74f7-463b-9b26-f69fc0d2ce85
level: high
logsource:
  category: registry_set
  product: windows
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1547.003/T1547.003.md
status: experimental
tags:
- attack.persistence
- attack.privilege_escalation
- attack.t1547.003
title: Set TimeProviders DllName
