author: Trent Liffick (@tliffick)
category: registry_set
date: 2020/05/14
description: Attempts to detect system changes made by Blue Mockingbird
detection:
  condition: selection
  selection:
    winlog.event_data.EventType: Setvalue
    winlog.event_data.TargetObject|endswith: \CurrentControlSet\Services\wercplsupport\Parameters\ServiceDll
falsepositives:
- Unknown
id: 92b0b372-a939-44ed-a11b-5136cf680e27
level: high
logsource:
  category: registry_set
  product: windows
modified: 2022/06/26
product: windows
references:
- https://redcanary.com/blog/blue-mockingbird-cryptominer/
related:
- id: c3198a27-23a0-4c2c-af19-e5328d49680e
  type: derived
status: experimental
tags:
- attack.execution
- attack.t1112
- attack.t1047
title: Blue Mockingbird
