author: frack113
category: registry_set
date: 2022/01/05
description: Bypasses User Account Control using Event Viewer and a relevant Windows
  Registry modification
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.Details: '%SystemRoot%\system32\mmc.exe "%1" %*'
  selection:
    winlog.event_data.EventType: SetValue
    winlog.event_data.TargetObject|endswith: _Classes\mscfile\shell\open\command\(Default)
falsepositives:
- Unknown
id: 674202d0-b22a-4af4-ae5f-2eda1f3da1af
level: high
logsource:
  category: registry_set
  product: windows
modified: 2022/03/26
product: windows
references:
- https://enigma0x3.net/2016/08/15/fileless-uac-bypass-using-eventvwr-exe-and-registry-hijacking/
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1548.002/T1548.002.md#atomic-test-1---bypass-uac-using-event-viewer-cmd
status: experimental
tags:
- attack.persistence
- attack.t1547.010
title: Bypass UAC Using Event Viewer
