author: frack113
category: registry_set
date: 2021/12/30
description: 'Adversaries may establish persistence and/or elevate privileges by executing
  malicious content triggered by application shims.

  The Microsoft Windows Application Compatibility Infrastructure/Framework (Application
  Shim) was created to allow for backward compatibility of software as the operating
  system codebase changes over time

  '
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.Details: ''
  selection:
    winlog.event_data.EventType: SetValue
    winlog.event_data.TargetObject|startswith:
    - HKLM\SOFTWARE\Microsoft\Windows NT\CurrentVersion\AppCompatFlags\InstalledSDB\
    - HKLM\SOFTWARE\Microsoft\Windows NT\CurrentVersion\AppCompatFlags\Custom\
falsepositives:
- Unknown
id: dfb5b4e8-91d0-4291-b40a-e3b0d3942c45
level: medium
logsource:
  category: registry_set
  product: windows
modified: 2022/03/26
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1546.011/T1546.011.md#atomic-test-3---registry-key-creation-andor-modification-events-for-sdb
- https://www.fireeye.com/blog/threat-research/2017/05/fin7-shim-databases-persistence.html
status: experimental
tags:
- attack.persistence
- attack.t1546.011
title: Registry Key Creation or Modification for Shim DataBase
