author: Nasreddine Bencherchali
category: registry_set
date: 2022/07/21
description: Detects when an attacker modifies the registry key "HtmlHelp Author"
  to achieve persistence
detection:
  condition: selection
  selection:
    winlog.event_data.EventType: SetValue
    winlog.event_data.TargetObject|contains:
    - \Software\Microsoft\HtmlHelp Author\Location
    - \Software\WOW6432Node\Microsoft\HtmlHelp Author\Location
falsepositives:
- Unknown
id: 976dd1f2-a484-45ec-aa1d-0e87e882262b
level: high
logsource:
  category: registry_set
  product: windows
product: windows
references:
- https://persistence-info.github.io/Data/htmlhelpauthor.html
- https://www.hexacorn.com/blog/2018/04/22/beyond-good-ol-run-key-part-76/
status: experimental
tags:
- attack.persistence
title: CHM Helper DLL Persistence
