author: Nasreddine Bencherchali
category: registry_set
date: 2022/08/10
description: Detects change the the "AutodialDLL" key which could be used as a persistence
  method to load custom DLL via the "ws2_32" library
detection:
  condition: selection
  selection:
    winlog.event_data.EventType: SetValue
    winlog.event_data.TargetObject|contains: \Services\WinSock2\Parameters\AutodialDLL
falsepositives:
- Unlikely
id: e6fe26ee-d063-4f5b-b007-39e90aaf50e3
level: high
logsource:
  category: registry_set
  product: windows
product: windows
references:
- https://www.hexacorn.com/blog/2015/01/13/beyond-good-ol-run-key-part-24/
- https://persistence-info.github.io/Data/autodialdll.html
status: experimental
tags:
- attack.persistence
title: Persistence Via AutodialDLL
