author: Sittikorn S
category: registry_set
date: 2020/05/31
description: Detects set value ms-msdt MSProtocol URI scheme in Registry that could
  be an attempt to exploit CVE-2022-30190.
detection:
  condition: selection
  selection:
    winlog.event_data.EventType: SetValue
    winlog.event_data.TargetObject|startswith: HKCR\ms-msdt\
falsepositives:
- Unknown
id: 2d9403d5-7927-46b7-8216-37ab7c9ec5e3
level: medium
logsource:
  category: registry_set
  product: windows
product: windows
references:
- https://msrc.microsoft.com/update-guide/vulnerability/CVE-2022-30190
- https://msrc-blog.microsoft.com/2022/05/30/guidance-for-cve-2022-30190-microsoft-support-diagnostic-tool-vulnerability/
status: experimental
tags:
- attack.defense_evasion
- attack.t1221
title: Suspicious Set Value of MSDT in Registry (CVE-2022-30190)
