author: Victor Sergeev, Daniil Yugoslavskiy, Gleb Sukhodolskiy, Timur Zinniatullin,
  oscd.community, Tim Shelton, frack113 (split)
category: registry_set
date: 2019/10/25
description: Detects modification of autostart extensibility point (ASEP) in registry.
detection:
  condition: office and office_details and not 1 of filter_*
  filter_avg:
    winlog.event_data.Image: C:\Program Files\AVG\Antivirus\RegSvr.exe
    winlog.event_data.TargetObject|contains: \Microsoft\Office\Outlook\Addins\Antivirus.AsOutExt\
  filter_empty:
    winlog.event_data.Details: (Empty)
  filter_excel:
    winlog.event_data.TargetObject|contains:
    - \Excel\Addins\AdHocReportingExcelClientLib.AdHocReportingExcelClientAddIn.1\
    - \Excel\Addins\ExcelPlugInShell.PowerMapConnect\
    - \Excel\Addins\NativeShim\
    - \Excel\Addins\NativeShim.InquireConnector.1\
    - \Excel\Addins\PowerPivotExcelClientAddIn.NativeEntry.1\
  filter_officeclicktorun:
    winlog.event_data.Image|endswith: \OfficeClickToRun.exe
    winlog.event_data.Image|startswith:
    - C:\Program Files\Common Files\Microsoft Shared\ClickToRun\
    - C:\Program Files\Common Files\Microsoft Shared\ClickToRun\Updates\
  filter_outlook:
    winlog.event_data.TargetObject|contains:
    - \Outlook\AddIns\AccessAddin.DC\
    - \Outlook\AddIns\ColleagueImport.ColleagueImportAddin\
    - \Outlook\AddIns\EvernoteCC.EvernoteContactConnector\
    - \Outlook\AddIns\EvernoteOLRD.Connect\
    - \Outlook\Addins\Microsoft.VbaAddinForOutlook.1\
    - \Outlook\Addins\OcOffice.OcForms\
    - \Outlook\Addins\OscAddin.Connect\
    - \Outlook\Addins\OutlookChangeNotifier.Connect\
    - \Outlook\Addins\UCAddin.LyncAddin.1
    - \Outlook\Addins\UCAddin.UCAddin.1
    - \Outlook\Addins\UmOutlookAddin.FormRegionAddin\
  office:
    winlog.event_data.EventType: SetValue
    winlog.event_data.TargetObject|contains:
    - \Software\Wow6432Node\Microsoft\Office
    - \Software\Microsoft\Office
  office_details:
    winlog.event_data.TargetObject|contains:
    - \Word\Addins
    - \PowerPoint\Addins
    - \Outlook\Addins
    - \Onenote\Addins
    - \Excel\Addins
    - \Access\Addins
    - test\Special\Perf
falsepositives:
- Legitimate software automatically (mostly, during installation) sets up autorun
  keys for legitimate reason
- Legitimate administrator sets up autorun keys for legitimate reason
fields:
- OldValueType
- NewValueType
- winlog.event_data.SecurityID
- winlog.event_data.ObjectName
id: baecf8fb-edbf-429f-9ade-31fc3f22b970
level: medium
logsource:
  category: registry_set
  product: windows
modified: 2022/06/10
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1547.001/T1547.001.md
- https://docs.microsoft.com/en-us/sysinternals/downloads/autoruns
- https://gist.github.com/GlebSukhodolskiy/0fc5fa5f482903064b448890db1eaf9d
related:
- id: 17f878b8-9968-4578-b814-c4217fc5768c
  type: derived
status: experimental
tags:
- attack.persistence
- attack.t1547.001
title: Office Autorun Keys Modification
