author: frack113
category: registry_set
date: 2022/04/04
description: Detects the addition of new root, CA or AuthRoot certificates to the
  Windows registry
detection:
  condition: selection
  selection:
    winlog.event_data.Details: Binary Data
    winlog.event_data.EventType: Setvalue
    winlog.event_data.TargetObject|contains:
    - \SOFTWARE\Microsoft\SystemCertificates\Root\Certificates\
    - \SOFTWARE\Policies\Microsoft\SystemCertificates\Root\Certificates\
    - \SOFTWARE\Microsoft\EnterpriseCertificates\Root\Certificates\
    - \SOFTWARE\Microsoft\SystemCertificates\CA\Certificates\
    - \SOFTWARE\Policies\Microsoft\SystemCertificates\CA\Certificates\
    - \SOFTWARE\Microsoft\EnterpriseCertificates\CA\Certificates\
    - \Software\Microsoft\SystemCertificates\AuthRoot\Certificates\
    - \SOFTWARE\Policies\Microsoft\SystemCertificates\AuthRoot\Certificates\
    - \SOFTWARE\Microsoft\EnterpriseCertificates\AuthRoot\Certificates\
    winlog.event_data.TargetObject|endswith: \Blob
falsepositives:
- Unknown
id: d223b46b-5621-4037-88fe-fda32eead684
level: medium
logsource:
  category: registry_set
  product: windows
modified: 2022/06/26
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1553.004/T1553.004.md#atomic-test-6---add-root-certificate-to-currentuser-certificate-store
- https://posts.specterops.io/code-signing-certificate-cloning-attacks-and-defenses-6f98657fc6ec
status: experimental
tags:
- attack.impact
- attack.t1490
title: New Root or CA or AuthRoot Certificate to Store
