author: Christian Burkard
category: registry_set
date: 2021/07/06
description: Detects the Setting of Windows Defender Exclusions
detection:
  condition: selection2
  selection2:
    winlog.event_data.EventType: SetValue
    winlog.event_data.TargetObject|contains: \Microsoft\Windows Defender\Exclusions
falsepositives:
- Administrator actions
id: a982fc9c-6333-4ffb-a51d-addb04e8b529
level: medium
logsource:
  category: registry_set
  product: windows
modified: 2022/03/26
product: windows
references:
- https://twitter.com/_nullbind/status/1204923340810543109
related:
- id: 1321dc4e-a1fe-481d-a016-52c45f0c8b4f
  type: derived
status: test
tags:
- attack.defense_evasion
- attack.t1562.001
title: Windows Defender Exclusions Added
