author: frack113
category: registry_set
date: 2022/01/01
description: 'Remote desktop is a common feature in operating systems.

  It allows a user to log into an interactive session with a system desktop graphical
  user interface on a remote system.

  Microsoft refers to its implementation of the Remote Desktop Protocol (RDP) as Remote
  Desktop Services (RDS).

  '
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.Details: DWORD (0x00000d3d)
  selection:
    winlog.event_data.EventType: SetValue
    winlog.event_data.TargetObject: HKLM\System\CurrentControlSet\Control\Terminal
      Server\WinStations\RDP-Tcp\PortNumber
falsepositives:
- Unknown
id: 509e84b9-a71a-40e0-834f-05470369bd1e
level: high
logsource:
  category: registry_set
  product: windows
modified: 2022/03/26
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1021.001/T1021.001.md#atomic-test-1---rdp-to-domaincontroller
status: experimental
tags:
- attack.persistence
- attack.t1547.010
title: Changing RDP Port to Non Standard Number
