author: frack113
category: registry_set
date: 2022/01/24
description: BlackByte set three different registry values to escalate privileges
  and begin setting the stage for lateral movement and encryption
detection:
  condition: selection
  selection:
    winlog.event_data.Details: DWORD (0x00000001)
    winlog.event_data.EventType: SetValue
    winlog.event_data.TargetObject:
    - HKLM\SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\System\LocalAccountTokenFilterPolicy
    - HKLM\SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\System\EnableLinkedConnections
    - HKLM\SYSTEM\CurrentControlSet\Control\FileSystem\LongPathsEnabled
falsepositives:
- Unknown
id: 83314318-052a-4c90-a1ad-660ece38d276
level: high
logsource:
  category: registry_set
  product: windows
modified: 2022/03/26
product: windows
references:
- https://redcanary.com/blog/blackbyte-ransomware/?utm_source=twitter&utm_medium=social
- https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/blackbyte-ransomware-pt-1-in-depth-analysis/
status: experimental
tags:
- attack.defense_evasion
- attack.t1112
title: Blackbyte Ransomware Registry
