author: Nasreddine Bencherchali
category: registry_set
date: 2022/08/23
description: Detects when an attacker tries to add a new network provider in order
  to dump clear text credentials, similar to how the NPPSpy tool does it
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.TargetObject|contains:
    - \System\CurrentControlSet\Services\WebClient\NetworkProvider
    - \System\CurrentControlSet\Services\LanmanWorkstation\NetworkProvider
    - \System\CurrentControlSet\Services\RDPNP\NetworkProvider
  selection:
    winlog.event_data.EventType: SetValue
    winlog.event_data.TargetObject|contains|all:
    - \System\CurrentControlSet\Services\
    - \NetworkProvider
falsepositives:
- Other legitimate network providers used and not filtred in this rule
id: 0442defa-b4a2-41c9-ae2c-ea7042fc4701
level: high
logsource:
  category: registry_set
  product: windows
product: windows
references:
- https://docs.microsoft.com/en-us/troubleshoot/windows-client/deployment/network-provider-settings-removed-in-place-upgrade
- https://github.com/gtworek/PSBits/tree/master/PasswordStealing/NPPSpy
related:
- id: baef1ec6-2ca9-47a3-97cc-4cf2bda10b77
  type: similar
status: experimental
tags:
- attack.credential_access
- attack.t1003
title: New Network Provider - Registry
