author: Sreeman
category: registry_set
date: 2020/09/29
description: Windows telemetry makes use of the binary CompatTelRunner.exe to run
  a variety of commands and perform the actual telemetry collections. This binary
  was created to be easily extensible, and to that end, it relies on the registry
  to instruct on which commands to run. The problem is, it will run any arbitrary
  command without restriction of location or type.
detection:
  condition: selection
  selection:
    winlog.event_data.Details|endswith:
    - .sh
    - .exe
    - .dll
    - .bin
    - .bat
    - .cmd
    - .js
    - .ps
    - .vb
    - .jar
    - .hta
    - .msi
    - .vbs
    winlog.event_data.EventType: SetValue
    winlog.event_data.TargetObject|contains: HKLM\SOFTWARE\Microsoft\Windows NT\CurrentVersion\AppCompatFlags\TelemetryController\
falsepositives:
- Unknown
fields:
- winlog.event_id
- winlog.event_data.CommandLine
- winlog.event_data.TargetObject
- winlog.event_data.Details
id: 4e8d5fd3-c959-441f-a941-f73d0cdcdca5
level: high
logsource:
  category: registry_set
  product: windows
modified: 2022/03/26
product: windows
references:
- https://www.trustedsec.com/blog/abusing-windows-telemetry-for-persistence/
status: experimental
tags:
- attack.defense_evasion
- attack.persistence
- attack.t1112
- attack.t1053
title: Abusing Windows Telemetry For Persistence
