author: Karneades, Jonhnathan Ribeiro
category: registry_set
date: 2018/04/11
description: Detects persistence using GlobalFlags in image file execution options
detection:
  condition: all of selection_*
  selection_reg1:
    winlog.event_data.TargetObject|contains: \Microsoft\Windows NT\CurrentVersion\
  selection_reg2:
  - winlog.event_data.TargetObject|contains|all:
    - \Image File Execution Options\
    - \GlobalFlag
  - winlog.event_data.TargetObject|contains|all:
    - SilentProcessExit\
    - \ReportingMode
  - winlog.event_data.TargetObject|contains|all:
    - SilentProcessExit\
    - \MonitorProcess
falsepositives:
- Unknown
id: 36803969-5421-41ec-b92f-8500f79c23b0
level: high
logsource:
  category: registry_set
  product: windows
modified: 2022/09/07
product: windows
references:
- https://oddvar.moe/2018/04/10/persistence-using-globalflags-in-image-file-execution-options-hidden-from-autoruns-exe/
status: test
tags:
- attack.privilege_escalation
- attack.persistence
- attack.defense_evasion
- attack.t1546.012
- car.2013-01-002
title: GlobalFlags Registry Persistence Mechanisms
