author: Florian Roth
category: registry_set
date: 2021/03/05
description: Detects VBScript content stored into registry keys as seen being used
  by UNC2452 group
detection:
  condition: selection and not 1 of filter*
  filter:
    winlog.event_data.TargetObject|contains: Software\Microsoft\Windows\CurrentVersion\Run
  filter_dotnet:
    winlog.event_data.Details|contains:
    - \Microsoft.NET\Primary Interop Assemblies\Microsoft.mshtml.dll
    - <\Microsoft.mshtml,fileVersion=
    - FL_Microsoft_mshtml_dll_____X86.
    - Microsoft_mshtml_dll_1_____X86.
    - <\Microsoft.mshtml,culture=
    winlog.event_data.Image|endswith: \msiexec.exe
    winlog.event_data.TargetObject|contains: \SOFTWARE\Microsoft\Windows\CurrentVersion\Installer\UserData\
  selection:
    winlog.event_data.Details|contains:
    - vbscript
    - jscript
    - mshtml
    - RunHTMLApplication
    - Execute(
    - CreateObject
    - RegRead
    - window.close
    winlog.event_data.EventType: SetValue
    winlog.event_data.TargetObject|contains: Software\Microsoft\Windows\CurrentVersion
falsepositives:
- Unknown
id: 46490193-1b22-4c29-bdd6-5bf63907216f
level: high
logsource:
  category: registry_set
  product: windows
modified: 2022/03/26
product: windows
references:
- https://www.microsoft.com/security/blog/2021/03/04/goldmax-goldfinder-sibot-analyzing-nobelium-malware/
status: experimental
tags:
- attack.persistence
- attack.t1547.001
title: VBScript Payload Stored in Registry
