author: frack113
category: registry_set
date: 2022/01/05
description: Detects when an attacker tries to disable User Account Control (UAC)
  by changing its registry key HKLM\SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\System\EnableLUA
  from 1 to 0
detection:
  condition: selection
  selection:
    winlog.event_data.Details: DWORD (0x00000000)
    winlog.event_data.EventType: SetValue
    winlog.event_data.TargetObject|contains: SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\System\EnableLUA
falsepositives:
- Unknown
id: 48437c39-9e5f-47fb-af95-3d663c3f2919
level: medium
logsource:
  category: registry_set
  product: windows
modified: 2022/08/06
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1548.002/T1548.002.md#atomic-test-8---disable-uac-using-regexe
status: experimental
tags:
- attack.privilege_escalation
- attack.defense_evasion
- attack.t1548.002
title: Disable UAC Using Registry
