author: Nasreddine Bencherchali
category: registry_set
date: 2022/07/12
description: Detects when an attacker set the registry key "HKLM\Software\Microsoft\Windows
  NT\CurrentVersion\Winlogon\SpecialAccounts\Userlist" to "0" in order to hide user
  account.
detection:
  condition: selection
  selection:
    winlog.event_data.Details: DWORD (0x00000000)
    winlog.event_data.EventType: SetValue
    winlog.event_data.TargetObject|contains: \SOFTWARE\Microsoft\Windows NT\CurrentVersion\Winlogon\SpecialAccounts\UserList
falsepositives:
- Unknown
id: f8aebc67-a56d-4ec9-9fbe-7b0e8b7b4efd
level: high
logsource:
  category: registry_set
  product: windows
product: windows
references:
- https://thedfirreport.com/2022/07/11/select-xmrig-from-sqlserver/
status: experimental
tags:
- attack.defense_evasion
- attack.t1564.002
title: Hide User Account Via Special Accounts Reg Key
