author: Trent Liffick (@tliffick)
category: registry_set
date: 2020/05/22
description: Detects registry changes to Office macro settings. The TrustRecords contain
  information on executed macro-enabled documents. (see references)
detection:
  condition: selection
  selection:
    winlog.event_data.EventType: Setvalue
    winlog.event_data.TargetObject|endswith:
    - \Security\Trusted Documents\TrustRecords
    - \Security\AccessVBOM
    - \Security\VBAWarnings
falsepositives:
- Valid Macros and/or internal documents
id: a166f74e-bf44-409d-b9ba-ea4b2dd8b3cd
level: high
logsource:
  category: registry_set
  product: windows
modified: 2022/06/26
product: windows
references:
- https://twitter.com/inversecos/status/1494174785621819397
- https://www.mcafee.com/blogs/other-blogs/mcafee-labs/zloader-with-a-new-infection-technique/
- https://securelist.com/scarcruft-surveilling-north-korean-defectors-and-human-rights-activists/105074/
status: experimental
tags:
- attack.defense_evasion
- attack.t1112
title: Office Security Settings Changed
