author: frack113
category: registry_set
date: 2022/08/20
description: Detect use of scrobj.dll as this DLL looks for the ScriptletURL key to
  get the location of the script to execute
detection:
  condition: selection
  selection:
    winlog.event_data.Details: C:\WINDOWS\system32\scrobj.dll
    winlog.event_data.EventType: SetValue
    winlog.event_data.TargetObject|endswith: InprocServer32\(Default)
falsepositives:
- Legitimate use of the dll.
id: fe20dda1-6f37-4379-bbe0-a98d400cae90
level: medium
logsource:
  category: registry_set
  product: windows
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1546.015/T1546.015.md
status: experimental
tags:
- attack.persistence
- attack.t1546.015
title: Scrobj.dll COM Hijacking
