author: Nasreddine Bencherchali
category: registry_set
date: 2022/08/10
description: 'Detects changes to the "Default" property for keys located in the \Software\Microsoft\Windows\CurrentVersion\App
  Paths\ registry. Which might be used as a method of persistence

  The entries found under App Paths are used primarily for the following purposes.

  First, to map an application''s executable file name to that file''s fully qualified
  path.

  Second, to pre-pend information to the PATH environment variable on a per-application,
  per-process basis.

  '
detection:
  condition: selection
  selection:
    winlog.event_data.Details|contains:
    - \Users\Public
    - \AppData\Local\Temp\
    - \Windows\Temp\
    - \Desktop\
    - \Downloads\
    - '%temp%'
    - iex
    - Invoke-
    - rundll32
    - regsvr32
    - mshta
    - cscript
    - wscript
    - .bat
    - .hta
    - .dll
    - .ps1
    winlog.event_data.EventType: SetValue
    winlog.event_data.TargetObject|contains: \SOFTWARE\Microsoft\Windows\CurrentVersion\App
      Paths
    winlog.event_data.TargetObject|endswith:
    - (Default)
    - winlog.event_data.Path
falsepositives:
- Legitimate applications registering their binary from on of the suspicious locations
  mentioned above (tune it)
id: 707e097c-e20f-4f67-8807-1f72ff4500d6
level: high
logsource:
  category: registry_set
  product: windows
product: windows
references:
- https://www.hexacorn.com/blog/2013/01/19/beyond-good-ol-run-key-part-3/
- https://docs.microsoft.com/en-us/windows/win32/shell/app-registration?redirectedfrom=MSDN
status: experimental
tags:
- attack.persistence
- attack.t1546.012
title: Suspicious Values In App Paths Default Property
