author: frack113
category: registry_set
date: 2022/02/04
description: Detects changes to the "ServiceDLL" value related to a service in the
  registry. This is often used as a method of persistence.
detection:
  condition: selection and not 1 of filter*
  filter_domain_controller:
    winlog.event_data.Details: '%%systemroot%%\system32\ntdsa.dll'
    winlog.event_data.Image: C:\Windows\system32\lsass.exe
    winlog.event_data.TargetObject|endswith: \CurrentControlSet\Services\NTDS\Parameters\ServiceDll
  filter_printextensionmanger:
    winlog.event_data.Details: C:\Windows\system32\spool\drivers\x64\3\PrintConfig.dll
  selection:
    winlog.event_data.EventType: SetValue
    winlog.event_data.TargetObject|endswith: \Parameters\ServiceDll
    winlog.event_data.TargetObject|startswith: HKLM\System\CurrentControlSet\Services\
falsepositives:
- Administrative scripts
- Installation of a service
id: 612e47e9-8a59-43a6-b404-f48683f45bd6
level: medium
logsource:
  category: registry_set
  product: windows
modified: 2022/08/10
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1543.003/T1543.003.md#atomic-test-4---tinyturla-backdoor-service-w64time
- https://www.hexacorn.com/blog/2013/09/19/beyond-good-ol-run-key-part-4/
status: experimental
tags:
- attack.persistence
- attack.privilege_escalation
- attack.t1543.003
title: ServiceDll Hijack
