author: Florian Roth
date: 2022/06/10
description: Detects a suspicious download using the BITS client from a FQDN that
  is unusual. Adversaries may abuse BITS jobs to persistently execute or clean up
  after malicious payloads.
detection:
  condition: selection and not filter
  filter:
    RemoteName|contains:
    - .com
    - .azureedge.net
    - .sfx.ms
    - download.mozilla.org
  selection:
    winlog.event_id: 16403
falsepositives:
- Other legitimate domains used by software updaters
id: 6d44fb93-e7d2-475c-9d3d-54c9c1e33427
level: medium
logsource:
  product: windows
  service: bits-client
modified: 2022/06/28
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1197/T1197.md
- https://twitter.com/malmoeb/status/1535142803075960832
service: bits-client
status: experimental
tags:
- attack.defense_evasion
- attack.persistence
- attack.t1197
title: Suspicious Download with BITS from Suspicious TLD
