author: Florian Roth (rule), Jonhnathan Ribeiro
category: ps_module
date: 2017/03/05
definition: PowerShell Module Logging must be enabled
description: Detects suspicious PowerShell invocation command parameters
detection:
  condition: 1 of selection* and not 1 of filter*
  filter_chocolatey:
    ContextInfo|contains:
    - (New-Object System.Net.WebClient).DownloadString('https://community.chocolatey.org/install.ps1
    - Write-ChocolateyWarning
  selection_convert_b64:
    ContextInfo|contains|all:
    - -nop
    - ' -w '
    - hidden
    - ' -c '
    - '[Convert]::FromBase64String'
  selection_enc:
    ContextInfo|contains|all:
    - ' -w '
    - hidden
    - -ep
    - bypass
    - -Enc
  selection_iex:
    ContextInfo|contains|all:
    - ' -w '
    - hidden
    - -noni
    - -nop
    - ' -c '
    - iex
    - New-Object
  selection_iex_webclient:
    ContextInfo|contains|all:
    - iex
    - New-Object
    - Net.WebClient
    - .Download
  selection_reg:
    ContextInfo|contains|all:
    - powershell
    - reg
    - add
    - HKCU\software\microsoft\windows\currentversion\run
  selection_webclient:
    ContextInfo|contains|all:
    - bypass
    - -noprofile
    - -windowstyle
    - hidden
    - new-object
    - system.net.webclient
    - .download
falsepositives:
- Unknown
id: 8ff28fdd-e2fa-4dfa-aeda-ef3d61c62090
level: high
logsource:
  category: ps_module
  definition: PowerShell Module Logging must be enabled
  product: windows
modified: 2022/02/21
product: windows
related:
- id: fce5f582-cc00-41e1-941a-c6fabf0fdb8c
  type: derived
status: experimental
tags:
- attack.execution
- attack.t1059.001
title: Suspicious PowerShell Invocations - Specific
