author: Nikita Nazarov, oscd.community
category: ps_module
date: 2020/10/12
definition: PowerShell Module Logging must be enabled
description: Detects Obfuscated Powershell via Stdin in Scripts
detection:
  condition: selection_4103
  selection_4103:
    Payload|re: (?i).*(set).*&&\s?set.*(environment|invoke|\${?input).*&&.*"
falsepositives:
- Unknown
id: c72aca44-8d52-45ad-8f81-f96c4d3c755e
level: high
logsource:
  category: ps_module
  definition: PowerShell Module Logging must be enabled
  product: windows
modified: 2021/10/16
product: windows
references:
- https://github.com/Neo23x0/sigma/issues/1009
related:
- id: 86b896ba-ffa1-4fea-83e3-ee28a4c915c7
  type: derived
status: experimental
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
title: Invoke-Obfuscation Via Stdin
