author: Ilyas Ochkov, Jonhnathan Ribeiro, Daniil Yugoslavskiy, oscd.community
category: ps_module
date: 2019/10/25
definition: PowerShell Module Logging must be enabled
description: Detects keywords that could indicate clearing PowerShell history
detection:
  condition: 1 of selection_payload_* or all of selection_1*
  selection_1a_payload:
    Payload|contains:
    - del
    - Remove-Item
    - rm
  selection_1b_payload:
    Payload|contains: (Get-PSReadlineOption).HistorySavePath
  selection_payload_2:
    Payload|contains|all:
    - Set-PSReadlineOption
    - "\u2013HistorySaveStyle"
    - SaveNothing
  selection_payload_3:
    Payload|contains|all:
    - Set-PSReadlineOption
    - -HistorySaveStyle
    - SaveNothing
falsepositives:
- Legitimate PowerShell scripts
id: f99276ad-d122-4989-a09a-d00904a5f9d2
level: medium
logsource:
  category: ps_module
  definition: PowerShell Module Logging must be enabled
  product: windows
modified: 2022/05/10
product: windows
references:
- https://gist.github.com/hook-s3c/7363a856c3cdbadeb71085147f042c1a
related:
- id: dfba4ce1-e0ea-495f-986e-97140f31af2d
  type: derived
status: experimental
tags:
- attack.defense_evasion
- attack.t1070.003
title: Clear PowerShell History
