author: frack113
category: ps_module
date: 2021/07/21
definition: PowerShell Module Logging must be enabled
description: Adversaries may use a non-application layer protocol for communication
  between host and C2 server or among infected hosts within a network
detection:
  condition: selection
  selection:
    ContextInfo|contains:
    - 'powercat '
    - powercat.ps1
falsepositives:
- Unknown
id: bf7286e7-c0be-460b-a7e8-5b2e07ecc2f2
level: medium
logsource:
  category: ps_module
  definition: PowerShell Module Logging must be enabled
  product: windows
modified: 2021/10/16
product: windows
references:
- https://nmap.org/ncat/
- https://github.com/besimorhino/powercat
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1095/T1095.md
status: experimental
tags:
- attack.command_and_control
- attack.t1095
title: Netcat The Powershell Version
