author: Florian Roth (rule)
category: ps_module
date: 2017/03/12
definition: PowerShell Module Logging must be enabled
description: Detects suspicious PowerShell invocation command parameters
detection:
  condition: all of selection*
  selection_encoded:
    ContextInfo|contains:
    - ' -enc '
    - ' -EncodedCommand '
  selection_hidden:
    ContextInfo|contains:
    - ' -w hidden '
    - ' -window hidden '
    - ' -windowstyle hidden '
  selection_noninteractive:
    ContextInfo|contains:
    - ' -noni '
    - ' -noninteractive '
falsepositives:
- Very special / sneaky PowerShell scripts
id: bbb80e91-5746-4fbe-8898-122e2cafdbf4
level: high
logsource:
  category: ps_module
  definition: PowerShell Module Logging must be enabled
  product: windows
modified: 2021/12/02
product: windows
related:
- id: 3d304fda-78aa-43ed-975c-d740798a49c1
  type: derived
status: experimental
tags:
- attack.execution
- attack.t1059.001
title: Suspicious PowerShell Invocations - Generic
