author: Jonathan Cheong, oscd.community
category: ps_module
date: 2020/10/15
definition: PowerShell Module Logging must be enabled
description: Detects Obfuscated use of stdin to execute PowerShell
detection:
  condition: selection_4103
  selection_4103:
    Payload|re: .*cmd.{0,5}(?:\/c|\/r).+powershell.+(?:\$\{?input\}?|noexit).+\"
falsepositives:
- Unknown
id: 9ac8b09b-45de-4a07-9da1-0de8c09304a3
level: high
logsource:
  category: ps_module
  definition: PowerShell Module Logging must be enabled
  product: windows
modified: 2021/10/16
product: windows
references:
- https://github.com/Neo23x0/sigma/issues/1009
related:
- id: 779c8c12-0eb1-11eb-adc1-0242ac120002
  type: derived
status: experimental
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
title: Invoke-Obfuscation STDIN+ Launcher
