author: Roberto Rodriguez @Cyb3rWard0g, Tim Shelton
category: ps_module
date: 2019/08/10
definition: PowerShell Module Logging must be enabled
description: Detects remote PowerShell sessions
detection:
  condition: selection and not 1 of false_positive*
  false_positive_1:
    ContextInfo|contains: \Windows\system32\WindowsPowerShell\v1.0\Modules\Microsoft.PowerShell.Archive\Microsoft.PowerShell.Archive.psm1
  selection:
    ContextInfo|contains|all:
    - ' = ServerRemoteHost '
    - wsmprovhost.exe
falsepositives:
- Legitimate use remote PowerShell sessions
id: 96b9f619-aa91-478f-bacb-c3e50f8df575
level: high
logsource:
  category: ps_module
  definition: PowerShell Module Logging must be enabled
  product: windows
modified: 2022/06/20
product: windows
references:
- https://threathunterplaybook.com/notebooks/windows/02_execution/WIN-190511223310.html
status: test
tags:
- attack.execution
- attack.t1059.001
- attack.lateral_movement
- attack.t1021.006
title: Remote PowerShell Session (PS Module)
