author: frack113
category: ps_module
date: 2021/12/10
definition: PowerShell Module Logging must be enabled
description: Adversaries may attempt to get a listing of network connections to or
  from the compromised system they are currently accessing or from remote systems
  by querying for information over the network.
detection:
  condition: selection
  selection:
    ContextInfo|contains: Get-NetTCPConnection
falsepositives:
- Unknown
id: aff815cc-e400-4bf0-a47a-5d8a2407d4e1
level: low
logsource:
  category: ps_module
  definition: PowerShell Module Logging must be enabled
  product: windows
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1049/T1049.md#atomic-test-2---system-network-connections-discovery-with-powershell
status: experimental
tags:
- attack.discovery
- attack.t1049
title: Use Get-NetTCPConnection
