author: Timur Zinniatullin, oscd.community
category: ps_module
date: 2020/10/18
definition: PowerShell Module Logging must be enabled
description: Detects Obfuscated Powershell via RUNDLL LAUNCHER
detection:
  condition: selection_4103
  selection_4103:
    Payload|contains|all:
    - rundll32.exe
    - shell32.dll
    - shellexec_rundll
    - powershell
falsepositives:
- Unknown
id: a23791fe-8846-485a-b16b-ca691e1b03d4
level: medium
logsource:
  category: ps_module
  definition: PowerShell Module Logging must be enabled
  product: windows
modified: 2022/03/08
product: windows
references:
- https://github.com/Neo23x0/sigma/issues/1009
related:
- id: e6cb92b4-b470-4eb8-8a9d-d63e8583aae0
  type: derived
status: experimental
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
title: Invoke-Obfuscation RUNDLL LAUNCHER
