author: Nikita Nazarov, oscd.community
category: ps_module
date: 2020/10/08
definition: PowerShell Module Logging must be enabledd
description: Detects Obfuscated Powershell via use MSHTA in Scripts
detection:
  condition: selection_4103
  selection_4103:
    Payload|re: (?i).*(set).*(&&).*(mshta).*(vbscript:createobject).*(\.run).*\(window\.close\).*"
falsepositives:
- Unknown
id: 07ad2ea8-6a55-4ac6-bf3e-91b8e59676eb
level: high
logsource:
  category: ps_module
  definition: PowerShell Module Logging must be enabledd
  product: windows
modified: 2021/10/16
product: windows
references:
- https://github.com/Neo23x0/sigma/issues/1009
related:
- id: e55a5195-4724-480e-a77e-3ebe64bd3759
  type: derived
status: experimental
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
title: Invoke-Obfuscation Via Use MSHTA
