author: frack113
category: ps_module
date: 2021/07/13
definition: PowerShell Module Logging must be enabledd
description: RemoteFXvGPUDisablement.exe is an abusable, signed PowerShell host executable
  that was introduced in Windows 10 and Server 2019 (OS Build 17763.1339).
detection:
  condition: selection_cmd and selection_opt
  selection_cmd:
    ContextInfo|contains: 'Invoke-ATHRemoteFXvGPUDisablementCommand '
  selection_opt:
    ContextInfo|contains:
    - '-ModuleName '
    - '-ModulePath '
    - '-ScriptBlock '
    - -RemoteFXvGPUDisablementFilePath
falsepositives:
- Unknown
fields:
- winlog.ComputerName
- winlog.event_data.User
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: 38a7625e-b2cb-485d-b83d-aff137d859f4
level: medium
logsource:
  category: ps_module
  definition: PowerShell Module Logging must be enabledd
  product: windows
modified: 2021/10/16
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1218/T1218.md
- https://github.com/redcanaryco/AtomicTestHarnesses/blob/master/TestHarnesses/T1218_SignedBinaryProxyExecution/InvokeRemoteFXvGPUDisablementCommand.ps1
status: experimental
tags:
- attack.defense_evasion
- attack.t1218
title: Abusable Invoke-ATHRemoteFXvGPUDisablementCommand
