author: Ilyas Ochkov, Jonhnathan Ribeiro, Daniil Yugoslavskiy, oscd.community
category: ps_module
date: 2019/10/25
definition: PowerShell Module Logging must be enabled
description: Detects keywords that could indicate clearing PowerShell history
detection:
  condition: selection_payload_1 or selection_payload_2
  selection_payload_1:
    Payload|contains:
    - del
    - Remove-Item
    - rm
    Payload|contains|all:
    - (Get-PSReadlineOption).HistorySavePath
  selection_payload_2:
    Payload|contains|all:
    - Set-PSReadlineOption
    - "\u2013HistorySaveStyle"
    - SaveNothing
falsepositives:
- Legitimate PowerShell scripts
id: f99276ad-d122-4989-a09a-d00904a5f9d2
level: medium
logsource:
  category: ps_module
  definition: PowerShell Module Logging must be enabled
  product: windows
modified: 2021/10/16
product: windows
references:
- https://gist.github.com/hook-s3c/7363a856c3cdbadeb71085147f042c1a
related:
- id: dfba4ce1-e0ea-495f-986e-97140f31af2d
  type: derived
status: experimental
tags:
- attack.defense_evasion
- attack.t1070.003
title: Clear PowerShell History
