author: Florian Roth
category: ps_module
date: 2017/03/05
description: Detects suspicious PowerShell download command
detection:
  condition: webclient and download
  download:
    ContextInfo|contains:
    - .DownloadFile(
    - .DownloadString(
  webclient:
    ContextInfo|contains: System.Net.WebClient
falsepositives:
- PowerShell scripts that download content from the Internet
id: de41232e-12e8-49fa-86bc-c05c7e722df9
level: medium
logsource:
  category: ps_module
  product: windows
modified: 2021/10/18
product: windows
related:
- id: 65531a81-a694-4e31-ae04-f8ba5bc33759
  type: derived
status: experimental
tags:
- attack.execution
- attack.t1059.001
title: Suspicious PowerShell Download
