author: Roberto Rodriguez @Cyb3rWard0g
category: ps_module
date: 2019/08/11
definition: PowerShell Module Logging must be enabled
description: Detects alternate PowerShell hosts potentially bypassing detections looking
  for powershell.exe
detection:
  condition: selection and not filter
  filter:
    ContextInfo|contains: powershell.exe
  selection:
    ContextInfo: '*'
falsepositives:
- Programs using PowerShell directly without invocation of a dedicated interpreter
- MSP Detection Searcher
- Citrix ConfigSync.ps1
id: 64e8e417-c19a-475a-8d19-98ea705394cc
level: medium
logsource:
  category: ps_module
  definition: PowerShell Module Logging must be enabled
  product: windows
modified: 2021/10/16
product: windows
references:
- https://threathunterplaybook.com/notebooks/windows/02_execution/WIN-190815181010.html
status: test
tags:
- attack.execution
- attack.t1059.001
title: Alternate PowerShell Hosts
