author: frack113
category: ps_module
date: 2021/07/20
definition: PowerShell Module Logging must be enabledd
description: Use living off the land tools to zip a file and stage it in the Windows
  temporary folder for later exfiltration
detection:
  condition: selection_4103
  selection_4103:
    ContextInfo|contains|all:
    - 'Compress-Archive '
    - ' -Path '
    - ' -DestinationPath '
    - $env:TEMP\
falsepositives:
- Unknown
id: daf7eb81-35fd-410d-9d7a-657837e602bb
level: medium
logsource:
  category: ps_module
  definition: PowerShell Module Logging must be enabledd
  product: windows
modified: 2021/10/16
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1074.001/T1074.001.md
related:
- id: b7a3c9a3-09ea-4934-8864-6a32cacd98d9
  type: derived
status: experimental
tags:
- attack.collection
- attack.t1074.001
title: Zip A Folder With PowerShell For Staging In Temp
