category: firewall
detection:
  condition: selection1 AND selection2
  selection1:
    destination.port:
    - 8080
    - 21
    - 80
    - 23
    - 50000
    - 1521
    - 27017
    - 3306
    - 1433
    - 11211
    - 15672
    - 5900
    - 5901
    - 5902
    - 5903
    - 5904
  selection2:
    action:
    - forward
    - accept
    - 2
id: d7fb8f0e-bd5f-45c2-b467-19571c490d7e
logsource:
  category: firewall
  product: suricata
product: suricata
