author: Alexandr Yampolskyi, SOC Prime
date: 2019/03/26
description: Automatically lock workstation sessions after a standard period of inactivity.
  The case is not applicable for Unix OS. Supported OS - Windows 2008 R2 and 7, Windows
  2012 R2 and 8.1, Windows 2016 and 10 Windows Server 2019.
detection:
  condition: selection
  selection:
    winlog.event_id:
    - 4800
falsepositives:
- unknown
id: 411742ad-89b0-49cb-a7b0-3971b5c1e0a4
level: low
logsource:
  product: windows
  service: security
product: windows
references:
- https://www.cisecurity.org/controls/cis-controls-list/
- https://www.pcisecuritystandards.org/documents/PCI_DSS_v3-2-1.pdf
- https://nvlpubs.nist.gov/nistpubs/CSWP/NIST.CSWP.04162018.pdf
- https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventID=4800
service: security
status: stable
title: Locked Workstation
