author: Tom Ueltschi (@c_APT_ure)
category: wmi_event
date: 2019/01/12
description: Detects creation of WMI event subscription persistence method
detection:
  condition: selection
  selection:
    winlog.event_id:
    - 19
    - 20
    - 21
falsepositives:
- Exclude legitimate (vetted) use of WMI event subscription in your network
id: 0f06a3a5-6a09-413f-8743-e6cf35561297
level: medium
logsource:
  category: wmi_event
  product: windows
modified: 2021/11/27
product: windows
status: test
tags:
- attack.persistence
- attack.t1546.003
title: WMI Event Subscription
