author: Florian Roth
date: 2017/08/21
description: Detects suspicious shell commands used in various exploit codes (see
  references)
detection:
  condition: keywords
  keywords:
  - wget * - http* | perl
  - wget * - http* | sh
  - wget * - http* | bash
  - python -m SimpleHTTPServer
  - -m http.server
  - import pty; pty.spawn*
  - socat exec:*
  - socat -O /tmp/*
  - socat tcp-connect*
  - '*echo binary >>*'
  - '*wget *; chmod +x*'
  - '*wget *; chmod 777 *'
  - '*cd /tmp || cd /var/run || cd /mnt*'
  - '*stop;service iptables stop;*'
  - '*stop;SuSEfirewall2 stop;*'
  - chmod 777 2020*
  - '*>>/etc/rc.local'
  - '*base64 -d /tmp/*'
  - '* | base64 -d *'
  - '*/chmod u+s *'
  - '*chmod +s /tmp/*'
  - '*chmod u+s /tmp/*'
  - '* /tmp/haxhax*'
  - '* /tmp/ns_sploit*'
  - nc -l -p *
  - cp /bin/ksh *
  - cp /bin/sh *
  - '* /tmp/*.b64 *'
  - '*/tmp/ysocereal.jar*'
  - '*/tmp/x *'
  - '*; chmod +x /tmp/*'
  - '*;chmod +x /tmp/*'
falsepositives:
- Unknown
id: 2aa1440c-9ae9-4d92-84a7-a9e5f5e31695
level: high
logsource:
  product: snoopy
modified: 2019/02/05
product: snoopy
references:
- http://www.threatgeek.com/2017/03/widespread-exploitation-attempts-using-cve-2017-5638.html
- https://github.com/rapid7/metasploit-framework/blob/master/modules/exploits/multi/http/struts_code_exec_exception_delegator.rb#L121
- http://pastebin.com/FtygZ1cg
- https://artkond.com/2017/03/23/pivoting-guide/
status: experimental
tags:
- attack.execution
- attack.t1059.004
title: Suspicious Activity in Shell Commands
