author: Alfie Champion (ajpc500)
category: process_creation
date: 2021/06/02
description: F-Secure C3 produces DLLs with a default exported StartNodeRelay function.
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains|all:
    - rundll32.exe
    - .dll
    - StartNodeRelay
falsepositives:
- Unknown
id: b18c9d4c-fac9-4708-bd06-dd5bfacf200f
level: critical
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://github.com/FSecureLABS/C3/blob/master/Src/NodeRelayDll/NodeRelayDll.cpp#L12
status: experimental
tags:
- attack.defense_evasion
- attack.t1218.011
title: F-Secure C3 Load by Rundll32
