author: frack113
category: process_creation
date: 2021/07/13
description: Emulates attack via documents through protocol handler in Microsoft Office.
  On successful execution you should see Microsoft Word launch a blank file.
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains|all:
    - '"ms-word'
    - .docx"
    winlog.event_data.Image|endswith: \protocolhandler.exe
falsepositives:
- Unknown
fields:
- winlog.ComputerName
- winlog.event_data.User
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: 104cdb48-a7a8-4ca7-a453-32942c6e5dcb
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1218/T1218.md
status: experimental
tags:
- attack.defense_evasion
- attack.t1218
title: ProtocolHandler.exe Downloaded Suspicious File
