author: frack113
category: process_creation
date: 2021/06/03
description: Use of SDelete to erase a file not the free space
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.CommandLine|contains:
    - ' -h'
    - ' -c'
    - ' -z'
    - ' /?'
  selection:
    winlog.event_data.OriginalFileName: sdelete.exe
falsepositives:
- System administrator Usage
fields:
- winlog.ComputerName
- winlog.event_data.User
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: a4824fca-976f-4964-b334-0621379e84c4
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1485/T1485.md
status: experimental
tags:
- attack.impact
- attack.t1485
title: Sysinternals SDelete Delete File
