author: frack113
category: process_creation
date: 2021/09/01
description: Adversaries may use NTFS file attributes to hide their malicious data
  in order to evade detection
detection:
  condition: selection_stream and (1 of selection_tools_*)
  selection_stream:
    winlog.event_data.CommandLine|contains: 'txt:'
  selection_tools_esentutl:
    winlog.event_data.CommandLine|contains|all:
    - 'esentutl '
    - ' /y '
    - ' /d '
    - ' /o '
  selection_tools_makecab:
    winlog.event_data.CommandLine|contains|all:
    - 'makecab '
    - .cab
  selection_tools_reg:
    winlog.event_data.CommandLine|contains|all:
    - 'reg '
    - ' export '
  selection_tools_regedit:
    winlog.event_data.CommandLine|contains|all:
    - 'regedit '
    - ' /E '
  selection_tools_type:
    winlog.event_data.CommandLine|contains|all:
    - 'type '
    - ' > '
falsepositives:
- Unknown
id: 7f43c430-5001-4f8b-aaa9-c3b88f18fa5c
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1564.004/T1564.004.md
status: experimental
tags:
- attack.defense_evasion
- attack.t1564.004
title: Execute From Alternate Data Streams
