author: frack113
category: process_creation
date: 2021/08/16
description: Detects a command used by conti to dump database
detection:
  condition: all of them
  selection_query:
    winlog.event_data.CommandLine|contains:
    - sys.sysprocesses
    - master.dbo.sysdatabases
    - BACKUP DATABASE
  selection_svr:
    winlog.event_data.CommandLine|contains: ' -S localhost '
  selection_tools:
    winlog.event_data.CommandLine|contains:
    - 'sqlcmd '
    - sqlcmd.exe
falsepositives:
- Unknown
id: 2f47f1fd-0901-466e-a770-3b7092834a1b
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://twitter.com/vxunderground/status/1423336151860002816?s=20
- https://www.virustotal.com/gui/file/03e9b8c2e86d6db450e5eceec057d7e369ee2389b9daecaf06331a95410aa5f8/detection
- https://docs.microsoft.com/en-us/sql/tools/sqlcmd-utility?view=sql-server-ver15
status: experimental
tags:
- attack.collection
title: Conti Backup Database
