author: Bhabesh Raj
category: process_creation
date: 2021/07/30
description: Adversaries can use the inbuilt expand utility to decompress cab files
  as seen in recent Iranian MeteorExpress attack
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains:
    - .cab
    - '/F:'
    - '-F:'
    - C:\ProgramData\
    - C:\Public\
    - \AppData\Local\Temp\
    - \AppData\Roaming\Temp\
    winlog.event_data.Image|endswith:
    - \expand.exe
falsepositives:
- System administrator Usage
fields:
- winlog.ComputerName
- winlog.event_data.User
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: 9f107a84-532c-41af-b005-8d12a607639f
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2021/08/31
product: windows
references:
- https://labs.sentinelone.com/meteorexpress-mysterious-wiper-paralyzes-iranian-trains-with-epic-troll
- https://blog.malwarebytes.com/threat-intelligence/2021/08/new-variant-of-konni-malware-used-in-campaign-targetting-russia/
status: experimental
tags:
- attack.execution
- attack.t1218
title: Cabinet File Expansion
