author: frack113
category: process_creation
date: 2021/07/21
description: Adversaries may use a non-application layer protocol for communication
  between host and C2 server or among infected hosts within a network
detection:
  condition: selection or selection_cmdline
  selection:
    winlog.event_data.Image|endswith:
    - \ncat.exe
  selection_cmdline:
    winlog.event_data.CommandLine|contains:
    - ' -lvp '
    - ' -l --proxy-type http '
    - ' --exec cmd.exe '
    - ' -vnl --exec '
falsepositives:
- Legitimate ncat use
id: e31033fc-33f0-4020-9a16-faf9b31cbf08
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://nmap.org/ncat/
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1095/T1095.md
status: experimental
tags:
- attack.command_and_control
- attack.t1095
title: Ncat Execution
