author: Bhabesh Raj
category: process_creation
date: 2021/03/03
description: "Detects possible successful exploitation for vulnerability described\
  \ in CVE-2021-26857 by looking for | abnormal subprocesses spawning by Exchange\
  \ Server\u2019s Unified Messaging service"
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.Image|endswith:
    - wermgr.exe
    - WerFault.exe
  selection:
    winlog.event_data.ParentImage|endswith: UMWorkerProcess.exe
falsepositives:
- Unknown
id: cd479ccc-d8f0-4c66-ba7d-e06286f3f887
level: critical
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://cve.mitre.org/cgi-bin/cvename.cgi?name=2021-26857
- https://www.microsoft.com/security/blog/2021/03/02/hafnium-targeting-exchange-servers/
- https://nvd.nist.gov/vuln/detail/cve-2021-26857
status: experimental
tags:
- attack.t1203
- attack.execution
title: CVE-2021-26857 Exchange Exploitation
