author: frack113
category: process_creation
date: 2021/07/12
description: Adversaries may disable security tools to avoid possible detection of
  their tools and activities by uninstalling Crowdstrike Falcon
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains|all:
    - \WindowsSensor.exe
    - ' /uninstall'
    - ' /quiet'
falsepositives:
- Uninstall by admin
fields:
- winlog.ComputerName
- winlog.event_data.User
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: f0f7be61-9cf5-43be-9836-99d6ef448a18
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1562.001/T1562.001.md
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001
title: Uninstall Crowdstrike Falcon
