author: Tom Ueltschi (@c_APT_ure)
category: process_creation
date: 2019/01/12
description: Detects creation or execution of UserInitMprLogonScript persistence method
detection:
  condition: ( exec_selection and not exec_exclusion1 and not exec_exclusion2 ) or
    create_keywords_cli
  create_keywords_cli:
    winlog.event_data.CommandLine|contains: UserInitMprLogonScript
  exec_exclusion1:
    winlog.event_data.Image|endswith: \explorer.exe
  exec_exclusion2:
    winlog.event_data.CommandLine|contains:
    - netlogon.bat
    - UsrLogon.cmd
  exec_selection:
    winlog.event_data.ParentImage|endswith: \userinit.exe
falsepositives:
- exclude legitimate logon scripts
- penetration tests, red teaming
id: 0a98a10c-685d-4ab0-bddc-b6bdd1d48458
level: high
logsource:
  category: process_creation
  product: windows
modified: 2020/08/26
product: windows
references:
- https://attack.mitre.org/techniques/T1037/
status: experimental
tags:
- attack.t1037.001
- attack.persistence
title: Logon Scripts (UserInitMprLogonScript)
