author: Bhabesh Raj, Sittikorn S
category: process_creation
date: 2021/05/10
description: Detects execution of RClone utility for exfiltration as used by various
  ransomwares strains like REvil, Conti, FiveHands, etc
detection:
  condition: 1 of them
  selection:
    winlog.event_data.Description: Rsync for cloud storage
  selection2:
    winlog.event_data.CommandLine|contains|all:
    - '--config '
    - '--no-check-certificate '
    - ' copy '
  selection3:
    winlog.event_data.CommandLine|contains:
    - mega
    - pcloud
    - ftp
    - --progress
    - --ignore-existing
    - --auto-confirm
    - --transfers
    - --multi-thread-streams
    winlog.event_data.Image|endswith:
    - \rclone.exe
falsepositives:
- Legitimate RClone use
fields:
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
- winlog.event_data.Details
id: a0d63692-a531-4912-ad39-4393325b2a9c
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/06/29
product: windows
references:
- https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware
- https://us-cert.cisa.gov/ncas/analysis-reports/ar21-126a
- https://labs.sentinelone.com/egregor-raas-continues-the-chaos-with-cobalt-strike-and-rclone
- https://www.splunk.com/en_us/blog/security/darkside-ransomware-splunk-threat-update-and-detections.html
status: experimental
tags:
- attack.exfiltration
- attack.t1567.002
title: RClone Execution
