author: Florian Roth
category: process_creation
date: 2019/02/21
description: Detects Russian group activity as described in Global Threat Report 2019
  by Crowdstrike
detection:
  condition: selection1 or selection2
  selection1:
    winlog.event_data.CommandLine|contains|all:
    - /S
    - /E
    - /C
    - /Q
    - /H
    - \\
    winlog.event_data.Image|endswith: \xcopy.exe
  selection2:
    winlog.event_data.CommandLine|contains|all:
    - -snapshot
    - '""'
    - c:\users\
    winlog.event_data.Image|endswith: \adexplorer.exe
falsepositives:
- unknown
id: b83f5166-9237-4b5e-9cd4-7b5d52f4d8ee
level: critical
logsource:
  category: process_creation
  product: windows
modified: 2020/08/26
product: windows
references:
- https://www.crowdstrike.com/resources/reports/2019-crowdstrike-global-threat-report/
tags:
- attack.credential_access
- attack.t1552.001
- attack.t1003.003
title: Judgement Panda Credential Access Activity
