author: '@neu5ron, Florian Roth, Jonhnathan Ribeiro, oscd.community'
category: process_creation
date: 2019/03/22
description: Detects a command that clears or disables any ETW trace log which could
  indicate a logging evasion.
detection:
  condition: 1 of them
  selection_clear_1:
    winlog.event_data.CommandLine|contains|all:
    - cl
    - /Trace
  selection_clear_2:
    winlog.event_data.CommandLine|contains|all:
    - clear-log
    - /Trace
  selection_disable_1:
    winlog.event_data.CommandLine|contains|all:
    - sl
    - /e:false
  selection_disable_2:
    winlog.event_data.CommandLine|contains|all:
    - set-log
    - /e:false
  selection_disable_3:
    winlog.event_data.CommandLine|contains|all:
    - Remove-EtwTraceProvider
    - EventLog-Microsoft-Windows-WMI-Activity-Trace
    - '{1418ef04-b0b4-4623-bf7e-d74ab47bbdaa}'
  selection_disable_4:
    winlog.event_data.CommandLine|contains|all:
    - Set-EtwTraceProvider
    - '{1418ef04-b0b4-4623-bf7e-d74ab47bbdaa}'
    - EventLog-Microsoft-Windows-WMI-Activity-Trace
    - '0x11'
  selection_disable_5:
    winlog.event_data.CommandLine|contains|all:
    - logman
    - update
    - trace
    - --p
    - -ets
falsepositives:
- Unknown
id: a238b5d0-ce2d-4414-a676-7a531b3d13d6
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/wevtutil
- https://abuse.io/lockergoga.txt
- https://medium.com/palantir/tampering-with-windows-event-tracing-background-offense-and-defense-4be7ac62ac63
status: experimental
tags:
- attack.defense_evasion
- attack.t1070
- attack.t1562.006
- car.2016-04-002
title: Disable of ETW Trace
