author: Endgame, JHasenbusch (ported to sigma for oscd.community)
category: process_creation
date: 2018/10/30
description: Detect download by BITS jobs via PowerShell
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains: Start-BitsTransfer
    winlog.event_data.Image|endswith: \powershell.exe
falsepositives:
- Unknown
fields:
- winlog.ComputerName
- winlog.event_data.User
- winlog.event_data.CommandLine
id: f67dbfce-93bc-440d-86ad-a95ae8858c90
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2019/11/11
product: windows
references:
- https://eqllib.readthedocs.io/en/latest/analytics/ec5180c9-721a-460f-bddc-27539a284273.html
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1197/T1197.md
status: experimental
tags:
- attack.defense_evasion
- attack.persistence
- attack.t1197
title: Suspicious Bitsadmin Job via PowerShell
