author: Florian Roth
category: process_creation
date: 2018/12/12
description: Detects process injection using the signed Windows tool Mavinject32.exe
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains: ' /INJECTRUNNING '
falsepositives:
- unknown
id: 17eb8e57-9983-420d-ad8a-2c4976c22eb8
level: critical
logsource:
  category: process_creation
  product: windows
modified: 2020/09/01
product: windows
references:
- https://twitter.com/gN3mes1s/status/941315826107510784
- https://reaqta.com/2017/12/mavinject-microsoft-injector/
- https://twitter.com/Hexacorn/status/776122138063409152
status: experimental
tags:
- attack.t1055.001
- attack.t1218
title: MavInject Process Injection
