author: Beyu Denis, oscd.community
category: process_creation
date: 2019/10/26
description: Execute VBscript code that is referenced within the *.bgi file.
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains|all:
    - /popup
    - /nolicprompt
    winlog.event_data.Image|endswith: \bginfo.exe
falsepositives:
- Unknown
id: aaf46cdc-934e-4284-b329-34aa701e3771
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2020/09/05
product: windows
references:
- https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OtherMSBinaries/Bginfo.yml
- https://oddvar.moe/2017/05/18/bypassing-application-whitelisting-with-bginfo/
status: experimental
tags:
- attack.execution
- attack.t1059.005
- attack.defense_evasion
- attack.t1218
- attack.t1202
title: Application Whitelisting Bypass via Bginfo
