author: Julia Fomina, oscd.community
category: process_creation
date: 2020/10/09
description: Detects using Rpcping.exe to send a RPC test connection to the target
  server (-s) and force the NTLM hash to be sent in the process.
detection:
  condition: use_rpcping and remote_server and ntlm_auth
  ntlm_auth:
  - winlog.event_data.CommandLine|contains|all:
    - -u
    - NTLM
  - winlog.event_data.CommandLine|contains|all:
    - /u
    - NTLM
  - winlog.event_data.CommandLine|contains|all:
    - -t
    - ncacn_np
  - winlog.event_data.CommandLine|contains|all:
    - /t
    - ncacn_np
  remote_server:
    winlog.event_data.CommandLine|contains:
    - -s
    - /s
  use_rpcping:
    winlog.event_data.Image|endswith: \rpcping.exe
falsepositives:
- Unlikely
id: 93671f99-04eb-4ab4-a161-70d446a84003
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://lolbas-project.github.io/lolbas/Binaries/Rpcping/
- https://twitter.com/vysecurity/status/974806438316072960
- https://twitter.com/vysecurity/status/873181705024266241
- https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/hh875578(v=ws.11)
status: experimental
tags:
- attack.credential_access
- attack.t1003
title: Capture Credentials with Rpcping.exe
