author: Sreeman
category: process_creation
date: 2020/01/13
description: Adversaries can use curl to download payloads remotely and execute them.
  Curl is included by default in Windows 10 build 17063 and later.
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains|all:
    - curl
    - ' start '
falsepositives:
- Administrative scripts (installers)
fields:
- winlog.event_data.ParentImage
- winlog.event_data.CommandLine
id: 21dd6d38-2b18-4453-9404-a0fe4a0cc288
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2020/09/05
product: windows
references:
- https://medium.com/@reegun/curl-exe-is-the-new-rundll32-exe-lolbin-3f79c5f35983
status: experimental
tags:
- attack.execution
- attack.t1218
- attack.command_and_control
- attack.t1105
title: Curl Start Combination
