author: Timur Zinniatullin, oscd.community
category: process_creation
date: 2020/10/13
description: Detects Obfuscated Powershell via VAR++ LAUNCHER
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|re: (?i).*&&set.*(\{\d\}){2,}\\\"\s+?\-f.*&&.*cmd.*\/c
falsepositives:
- Unknown
id: e9f55347-2928-4c06-88e5-1a7f8169942e
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://github.com/Neo23x0/sigma/issues/1009
status: experimental
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
title: Invoke-Obfuscation VAR++ LAUNCHER OBFUSCATION
