author: Beyu Denis, oscd.community (rule), @_felamos (idea)
category: process_creation
date: 2019/10/12
description: The Devtoolslauncher.exe executes other binary
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains: LaunchForDeploy
    winlog.event_data.Image|endswith: \devtoolslauncher.exe
falsepositives:
- Legitimate use of devtoolslauncher.exe by legitimate user
id: cc268ac1-42d9-40fd-9ed3-8c4e1a5b87e6
level: critical
logsource:
  category: process_creation
  product: windows
modified: 2019/11/04
product: windows
references:
- https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OtherMSBinaries/Devtoolslauncher.yml
- https://twitter.com/_felamos/status/1179811992841797632
status: experimental
tags:
- attack.defense_evasion
- attack.t1218
title: Devtoolslauncher.exe Executes Specified Binary
