author: Florian Roth
category: process_creation
date: 2020/05/08
description: Detects specific process characteristics of Maze ransomware word document
  droppers
detection:
  condition: 1 of them
  selection1:
    winlog.event_data.Image|endswith:
    - .tmp
    winlog.event_data.ParentImage|endswith:
    - \WINWORD.exe
  selection2:
    winlog.event_data.CommandLine|endswith: shadowcopy delete
    winlog.event_data.Image|endswith: \wmic.exe
    winlog.event_data.ParentImage|contains: \Temp\
  selection3:
    winlog.event_data.CommandLine|contains: \..\..\system32
    winlog.event_data.CommandLine|endswith: shadowcopy delete
falsepositives:
- Unlikely
fields:
- winlog.ComputerName
- winlog.event_data.User
- winlog.event_data.Image
id: 29fd07fc-9cfd-4331-b7fd-cc18dfa21052
level: critical
logsource:
  category: process_creation
  product: windows
modified: 2021/06/27
product: windows
references:
- https://www.fireeye.com/blog/threat-research/2020/05/tactics-techniques-procedures-associated-with-maze-ransomware-incidents.html
- https://app.any.run/tasks/51e7185c-52d7-4efb-ac0d-e86340053473/
- https://app.any.run/tasks/65a79440-373a-4725-8d74-77db9f2abda4/
status: experimental
tags:
- attack.execution
- attack.t1204.002
- attack.t1047
- attack.impact
- attack.t1490
title: Maze Ransomware
