category: process_creation
detection:
  condition: contains_winrm and (contains_format_pretty_arg and not image_from_system_folder)
  contains_format_pretty_arg:
    winlog.event_data.CommandLine|contains:
    - format:pretty
    - format:"pretty"
    - format:"text"
    - format:text
  contains_winrm:
    winlog.event_data.CommandLine|contains: winrm
  image_from_system_folder:
    winlog.event_data.Image|startswith:
    - C:\Windows\System32\
    - C:\Windows\SysWOW64\
id: 074e0ded-6ced-4ebd-8b4d-53f55908119d
logsource:
  category: process_creation
  product: windows
product: windows
