author: Teymur Kheirkhabarov (idea), Ryan Plas (rule), oscd.community
category: process_creation
date: 2020/10/05
description: Search for usage of reg or Powershell by non-priveleged users to modify
  service configuration in registry
detection:
  condition: integrity_level and (reg or powershell_1 and powershell_2) and registry_folder
    and registry_key
  integrity_level:
    winlog.event_data.IntegrityLevel: Medium
  powershell_1:
    winlog.event_data.CommandLine|contains: powershell
  powershell_2:
    winlog.event_data.CommandLine|contains:
    - set-itemproperty
    - ' sp '
    - new-itemproperty
  reg:
    winlog.event_data.CommandLine|contains|all:
    - reg
    - add
  registry_folder:
    winlog.event_data.CommandLine|contains|all:
    - ControlSet
    - Services
  registry_key:
    winlog.event_data.CommandLine|contains:
    - FailureCommand
    - ServiceDLL
    - winlog.event_data.ImagePath
falsepositives:
- Unknown
fields:
- winlog.event_id
- winlog.event_data.IntegrityLevel
- winlog.event_data.CommandLine
id: 8f02c935-effe-45b3-8fc9-ef8696a9e41d
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://image.slidesharecdn.com/kheirkhabarovoffzonefinal-181117201458/95/hunting-for-privilege-escalation-in-windows-environment-20-638.jpg
status: experimental
tags:
- attack.defense_evasion
- attack.t1112
title: Non-privileged Usage of Reg or Powershell
