author: Daniil Yugoslavskiy, oscd.community
category: process_creation
date: 2019/10/24
description: Well-known DNS Exfiltration tools execution
detection:
  condition: selection
  selection:
  - winlog.event_data.Image|endswith: \iodine.exe
  - winlog.event_data.Image|contains: \dnscat2
falsepositives:
- "Legitimate usage of iodine or dnscat2 \u2014 DNS Exfiltration tools (unlikely)"
id: 98a96a5a-64a0-4c42-92c5-489da3866cb0
level: high
logsource:
  category: process_creation
  product: windows
modified: 2020/08/29
product: windows
status: experimental
tags:
- attack.exfiltration
- attack.t1048.001
- attack.command_and_control
- attack.t1071.004
- attack.t1132.001
title: DNS Exfiltration and Tunneling Tools Execution
