author: Florian Roth
category: process_creation
date: 2021/05/22
description: Detects suspicious flags used by PsExec and PAExec but no usual program
  name in command line
detection:
  condition: ( selection_flags_1 or selection_flags_2 ) and not filter
  filter:
    winlog.event_data.CommandLine|contains:
    - paexec
    - PsExec
  selection_flags_1:
    winlog.event_data.CommandLine|contains|all:
    - \\127.0.0.1
    - ' -s '
    - cmd.exe
  selection_flags_2:
    winlog.event_data.CommandLine|contains|all:
    - ' /accepteula '
    - 'cmd /c '
    - ' -u '
    - ' -p '
falsepositives:
- Weird admins that rename their tools
- Software companies that bundle PsExec/PAExec with their software and rename it,
  so that it is less embarrassing
id: 207b0396-3689-42d9-8399-4222658efc99
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://docs.microsoft.com/en-us/sysinternals/downloads/psexec
- https://www.poweradmin.com/paexec/
- https://www.fireeye.com/blog/threat-research/2020/10/kegtap-and-singlemalt-with-a-ransomware-chaser.html
status: experimental
title: PsExec/PAExec Flags
