author: Beyu Denis, oscd.community
category: process_creation
date: 2019/10/26
description: Detects execution of of Dxcap.exe
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains|all:
    - -c
    - .exe
    winlog.event_data.Image|endswith: \dxcap.exe
falsepositives:
- Legitimate execution of dxcap.exe by legitimate user
id: 60f16a96-db70-42eb-8f76-16763e333590
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2019/11/04
product: windows
references:
- https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OtherMSBinaries/Dxcap.yml
- https://twitter.com/harr0ey/status/992008180904419328
status: experimental
tags:
- attack.defense_evasion
- attack.t1218
title: Application Whitelisting Bypass via Dxcap.exe
