author: Florian Roth
category: process_creation
date: 2019/03/04
description: Detects a specific tool and export used by EquationGroup
detection:
  condition: 1 of them
  selection1:
    winlog.event_data.CommandLine|endswith: ',dll_u'
    winlog.event_data.Image|endswith: \rundll32.exe
  selection2:
    winlog.event_data.CommandLine|contains: ' -export dll_u '
falsepositives:
- Unknown
id: d465d1d8-27a2-4cca-9621-a800f37cf72e
level: critical
logsource:
  category: process_creation
  product: windows
modified: 2020/08/27
product: windows
references:
- https://github.com/adamcaudill/EquationGroupLeak/search?utf8=%E2%9C%93&q=dll_u&type=
- https://securelist.com/apt-slingshot/84312/
- https://twitter.com/cyb3rops/status/972186477512839170
tags:
- attack.g0020
- attack.defense_evasion
- attack.t1218.011
title: Equation Group DLL_U Load
