author: Florian Roth, omkar72, oscd.community
category: process_creation
date: 2019/01/29
description: Detects netsh commands that configure a port forwarding (PortProxy)
detection:
  condition: selection1 or selection2
  selection1:
    winlog.event_data.CommandLine|contains|all:
    - interface
    - portproxy
    - add
    - v4tov4
    winlog.event_data.Image|endswith: \netsh.exe
  selection2:
    winlog.event_data.CommandLine|contains|all:
    - connectp
    - listena
    - c=
    winlog.event_data.Image|endswith: \netsh.exe
falsepositives:
- Legitimate administration
- WSL2 network bridge PowerShell script used for WSL/Kubernetes/Docker (e.g. https://github.com/microsoft/WSL/issues/4150#issuecomment-504209723)
id: 322ed9ec-fcab-4f67-9a34-e7c6aef43614
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2021/06/22
product: windows
references:
- https://www.fireeye.com/blog/threat-research/2019/01/bypassing-network-restrictions-through-rdp-tunneling.html
- https://adepts.of0x.cc/netsh-portproxy-code/
- https://www.dfirnotes.net/portproxy_detection/
status: experimental
tags:
- attack.lateral_movement
- attack.defense_evasion
- attack.command_and_control
- attack.t1090
title: Netsh Port Forwarding
