author: Beyu Denis, oscd.community (rule), @harr0ey (idea)
category: process_creation
date: 2019/10/12
description: The OpenWith.exe executes other binary
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains: /c
    winlog.event_data.Image|endswith: \OpenWith.exe
falsepositives:
- Legitimate use of OpenWith.exe by legitimate user
id: cec8e918-30f7-4e2d-9bfa-a59cc97ae60f
level: high
logsource:
  category: process_creation
  product: windows
modified: 2019/11/04
product: windows
references:
- https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/LOLUtilz/OSBinaries/Openwith.yml
- https://twitter.com/harr0ey/status/991670870384021504
status: experimental
tags:
- attack.defense_evasion
- attack.t1218
title: OpenWith.exe Executes Specified Binary
