author: Florian Roth
category: process_creation
date: 2019/05/22
description: Detects a process spawned by the terminal service server process (this
  could be an indicator for an exploitation of CVE-2019-0708)
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.Image|endswith: \rdpclip.exe
  selection:
    winlog.event_data.ParentCommandLine|contains|all:
    - \svchost.exe
    - termsvcs
falsepositives:
- Unknown
id: 1012f107-b8f1-4271-af30-5aed2de89b39
level: high
logsource:
  category: process_creation
  product: windows
modified: 2020/08/29
product: windows
references:
- https://securingtomorrow.mcafee.com/other-blogs/mcafee-labs/rdp-stands-for-really-do-patch-understanding-the-wormable-rdp-vulnerability-cve-2019-0708/
status: experimental
tags:
- attack.initial_access
- attack.t1190
- attack.lateral_movement
- attack.t1210
- car.2013-07-002
title: Terminal Service Process Spawn
