author: Christian Burkard
category: process_creation
date: 2021/08/23
description: Detects the pattern of UAC Bypass via WSReset usable by default sysmon-config
detection:
  condition: selection
  selection:
    winlog.event_data.Image|endswith: \wsreset.exe
    winlog.event_data.IntegrityLevel:
    - High
    - System
falsepositives:
- Unknown
id: 89a9a0e0-f61a-42e5-8957-b1479565a658
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://lolbas-project.github.io/lolbas/Binaries/Wsreset/
- https://github.com/hfiref0x/UACME
- https://medium.com/falconforce/falconfriday-detecting-uac-bypasses-0xff16-86c2a9107abf
status: experimental
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1548.002
title: UAC Bypass WSReset
