author: Thomas Patzke
category: process_creation
date: 2020/05/22
description: Detect various execution methods of the CrackMapExec pentesting framework
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains:
    - powershell.exe -exec bypass -noni -nop -w 1 -C "
    - 'powershell.exe -noni -nop -w 1 -enc '
    winlog.event_data.CommandLine|endswith:
    - cmd.exe /Q /c * 1> \\\\*\\*\\* 2>&1
    - cmd.exe /C * > \\\\*\\*\\* 2>&1
    - cmd.exe /C * > *\\Temp\\* 2>&1
falsepositives:
- Unknown
fields:
- winlog.ComputerName
- winlog.event_data.User
- winlog.event_data.CommandLine
id: 058f4380-962d-40a5-afce-50207d36d7e2
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://github.com/byt3bl33d3r/CrackMapExec
status: stable
tags:
- attack.execution
- attack.t1047
- attack.t1053
- attack.t1059.003
- attack.t1059.001
- attack.s0106
title: CrackMapExec Command Execution
