author: E.M. Anhaus (originally from Atomic Blue Detections, Tony Lambert), oscd.community
category: process_creation
date: 2019/10/24
description: Identifies use of Fodhelper.exe to bypass User Account Control. Adversaries
  use this technique to execute privileged processes.
detection:
  condition: selection
  selection:
    winlog.event_data.ParentImage|endswith: \fodhelper.exe
falsepositives:
- Legitimate use of fodhelper.exe utility by legitimate user
fields:
- winlog.ComputerName
- winlog.event_data.User
- winlog.event_data.CommandLine
id: 7f741dcf-fc22-4759-87b4-9ae8376676a2
level: high
logsource:
  category: process_creation
  product: windows
modified: 2019/11/11
product: windows
references:
- https://eqllib.readthedocs.io/en/latest/analytics/e491ce22-792f-11e9-8f5c-d46d6d62a49e.html
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1088/T1088.md
status: experimental
tags:
- attack.privilege_escalation
- attack.t1548.002
title: Bypass UAC via Fodhelper.exe
