category: process_creation
detection:
  condition: 1 of them
  selection1:
    winlog.event_data.Image|contains: \CreateMiniDump.exe
  selection2:
    winlog.event_data.Imphash: 4a07f944a83e8a7c2525efa35dd30e2f
id: 36d88494-1d43-4dc0-b3fa-35c8fea0ca9d
logsource:
  category: process_creation
  product: windows
product: windows
