author: Florian Roth, Jonhnathan Ribeiro, oscd.community
category: process_creation
date: 2019/10/14
description: Detects a code page switch in command line or batch scripts to a rare
  language
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|endswith:
    - ' 936'
    - ' 1258'
    winlog.event_data.Image|endswith: \chcp.com
falsepositives:
- Administrative activity (adjust code pages according to your organisation's region)
fields:
- winlog.event_data.ParentCommandLine
id: c7942406-33dd-4377-a564-0f62db0593a3
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2020/11/28
product: windows
references:
- https://docs.microsoft.com/en-us/windows/win32/intl/code-page-identifiers
- https://twitter.com/cglyer/status/1183756892952248325
status: experimental
title: Suspicious Code Page Switch
