author: Florian Roth
category: process_creation
date: 2021/03/09
description: Detects a service binary running in a suspicious directory
detection:
  condition: selection
  selection:
    winlog.event_data.Image|contains:
    - \Users\Public\
    - \$Recycle.bin
    - \Users\All Users\
    - \Users\Default\
    - \Users\Contacts\
    - \Users\Searches\
    - C:\Perflogs\
    - \config\systemprofile\
    - \Windows\Fonts\
    - \Windows\IME\
    - \Windows\addins\
    winlog.event_data.ParentImage|endswith:
    - \services.exe
    - \svchost.exe
falsepositives:
- Unknown
id: 883faa95-175a-4e22-8181-e5761aeb373c
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://blog.truesec.com/2021/03/07/exchange-zero-day-proxylogon-and-hafnium/
status: experimental
title: Suspicious Service Binary Directory
