author: Markus Neis, Sander Wiebing
category: process_creation
date: 2019/01/29
description: Allow Incoming Connections by Port or Application on Windows Firewall
detection:
  condition: selection1 and selection2
  selection1:
    winlog.event_data.Image|endswith: \netsh.exe
  selection2:
    winlog.event_data.CommandLine|contains|all:
    - firewall
    - add
falsepositives:
- Legitimate administration
id: cd5cfd80-aa5f-44c0-9c20-108c4ae12e3c
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2020/09/01
product: windows
references:
- https://attack.mitre.org/software/S0246/ (Lazarus HARDRAIN)
- https://www.operationblockbuster.com/wp-content/uploads/2016/02/Operation-Blockbuster-RAT-and-Staging-Report.pdf
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.004
title: Netsh Port or Application Allowed
