author: Florian Roth (rule), Samir Bousseaden (idea)
category: process_creation
date: 2019/06/17
description: Detects a suspicious child process of userinit
detection:
  condition: selection and not filter1 and not filter2
  filter1:
    winlog.event_data.CommandLine|contains: \netlogon\
  filter2:
    winlog.event_data.Image|endswith: \explorer.exe
  selection:
    winlog.event_data.ParentImage|endswith: \userinit.exe
falsepositives:
- Administrative scripts
fields:
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: b655a06a-31c0-477a-95c2-3726b83d649d
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2021/06/27
product: windows
references:
- https://twitter.com/SBousseaden/status/1139811587760562176
status: experimental
tags:
- attack.defense_evasion
- attack.t1055
title: Suspicious Userinit Child Process
