author: Florian Roth
category: process_creation
date: 2018/10/30
description: Detects suspicious uses of the SysInternals Procdump utility by using
  a special command line parameter in combination with the lsass.exe process. This
  way we're also able to catch cases in which the attacker has renamed the procdump
  executable.
detection:
  condition: ( selection1 and selection2 ) or selection3
  selection1:
    winlog.event_data.CommandLine|contains: ' -ma '
  selection2:
    winlog.event_data.CommandLine|contains: ' lsass'
  selection3:
    winlog.event_data.CommandLine|contains|all:
    - ' -ma '
    - ' ls'
falsepositives:
- Unlikely, because no one should dump an lsass process memory
- Another tool that uses the command line switches of Procdump
id: 5afee48e-67dd-4e03-a783-f74259dcf998
level: critical
logsource:
  category: process_creation
  product: windows
modified: 2021/02/02
product: windows
references:
- Internal Research
status: experimental
tags:
- attack.defense_evasion
- attack.t1036
- attack.credential_access
- attack.t1003.001
- car.2013-05-009
title: Suspicious Use of Procdump on LSASS
