author: Austin Songer @austinsonger
category: process_creation
date: 2021/08/19
description: Detects transferring files from system on a server bitstransfer Powershell
  cmdlets
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains:
    - Get-BitsTransfer
    - Add-BitsFile
    winlog.event_data.Image|endswith:
    - \powershell.exe
    - \powershell_ise.exe
    - \pwsh.exe
falsepositives:
- Unknown
fields:
- winlog.ComputerName
- winlog.event_data.User
- winlog.event_data.CommandLine
id: cd5c8085-4070-4e22-908d-a5b3342deb74
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://docs.microsoft.com/en-us/powershell/module/bitstransfer/add-bitsfile?view=windowsserver2019-ps
status: experimental
tags:
- attack.exfiltration
- attack.persistence
- attack.t1197
title: Suspicious Bitstransfer via PowerShell
