author: Avneet Singh @v3t0_, oscd.community
category: process_creation
date: 2020/10/18
description: This rule detects the execution of Run Once task as configured in the
  registry
detection:
  command_line:
    winlog.event_data.CommandLine|contains:
    - ' /AlternateShellStartup'
  condition: (process_name or process_description) and command_line
  process_description:
    winlog.event_data.Description:
    - Run Once Wrapper
  process_name:
    winlog.event_data.Image|endswith:
    - \runonce.exe
falsepositives:
- Unknown
id: 198effb6-6c98-4d0c-9ea3-451fa143c45c
level: low
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://twitter.com/pabraeken/status/990717080805789697
- https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OSBinaries/Runonce.yml
status: experimental
tags:
- attack.defense_evasion
- attack.t1112
title: Run Once Task Execution as Configured in Registry
