author: Florian Roth
category: process_creation
date: 2019/07/17
description: Detects a regsvr.exe execution that doesn't contain a DLL in the command
  line
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.CommandLine|contains:
    - .dll
    - .ocx
    - .cpl
    - .ax
    - .bav
    - .ppl
  selection:
    winlog.event_data.ParentImage|endswith: \regsvr32.exe
falsepositives:
- Unknown
fields:
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: 50919691-7302-437f-8e10-1fe088afa145
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/07/20
product: windows
references:
- https://app.any.run/tasks/34221348-072d-4b70-93f3-aa71f6ebecad/
status: experimental
tags:
- attack.defense_evasion
- attack.execution
title: Regsvr32 Command Line Without DLL
