author: Timur Zinniatullin, Daniil Yugoslavskiy, oscd.community
category: process_creation
date: 2019/10/21
description: Detects manual service execution (start) via system utilities.
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains: ' start '
    winlog.event_data.Image|endswith:
    - \net.exe
    - \net1.exe
falsepositives:
- Legitimate administrator or user executes a service for legitimate reasons.
id: 2a072a96-a086-49fa-bcb5-15cc5a619093
level: low
logsource:
  category: process_creation
  product: windows
modified: 2019/11/04
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1569.002/T1569.002.md
status: experimental
tags:
- attack.execution
- attack.t1569.002
title: Service Execution
