author: Bhabesh Raj
category: process_creation
date: 2021/04/20
description: Detects different process creation events as described in Malwarebytes's
  threat report on Lazarus group activity
detection:
  condition: 1 of them
  selection1:
    winlog.event_data.CommandLine|contains|all:
    - mshta
    - .zip
  selection2:
    winlog.event_data.Image:
    - C:\Windows\System32\mshta.exe
    winlog.event_data.ParentImage:
    - C:\Windows\System32\wbem\wmiprvse.exe
  selection3:
    winlog.event_data.Image:
    - C:\Windows\System32\rundll32.exe
    winlog.event_data.ParentImage|contains:
    - :\Users\Public\
falsepositives:
- Should not be any false positives
id: 4a12fa47-c735-4032-a214-6fab5b120670
level: critical
logsource:
  category: process_creation
  product: windows
modified: 2021/06/27
product: windows
references:
- https://blog.malwarebytes.com/malwarebytes-news/2021/04/lazarus-apt-conceals-malicious-code-within-bmp-file-to-drop-its-rat/
status: experimental
tags:
- attack.g0032
title: Lazarus Activity
