author: Teymur Kheirkhabarov (idea), Vasiliy Burov (rule), oscd.community
category: process_creation
date: 2020/10/11
description: Detects specific combinations of encoding methods in the PowerShell command
  lines
detection:
  condition: (selection2 and selection3) or selection1 or selection4 or selection5
    or selection6
  selection1:
    winlog.event_data.CommandLine|contains|all:
    - char
    - join
    winlog.event_data.Image|endswith: \powershell.exe
  selection2:
    winlog.event_data.CommandLine|contains:
    - ToInt
    - ToDecimal
    - ToByte
    - ToUint
    - ToSingle
    - ToSByte
    winlog.event_data.Image|endswith: \powershell.exe
  selection3:
    winlog.event_data.CommandLine|contains:
    - ToChar
    - ToString
    - String
    winlog.event_data.Image|endswith: \powershell.exe
  selection4:
    winlog.event_data.CommandLine|contains|all:
    - split
    - join
    winlog.event_data.Image|endswith: \powershell.exe
  selection5:
    winlog.event_data.CommandLine|contains|all:
    - ForEach
    - Xor
    winlog.event_data.Image|endswith: \powershell.exe
  selection6:
    winlog.event_data.CommandLine|contains:
    - cOnvErTTO-SECUreStRIng
    winlog.event_data.Image|endswith: \powershell.exe
falsepositives:
- Unlikely
id: cdf05894-89e7-4ead-b2b0-0a5f97a90f2f
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=65
status: experimental
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
title: Encoded PowerShell Command Line
