author: Florian Roth
category: process_creation
date: 2021/01/28
description: Detects commands that temporarily turn off Volume Snapshots
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains|all:
    - reg
    - ' add '
    - \Services\VSS\Diag
    - /d Disabled
falsepositives:
- Legitimate administration
id: dee4af55-1f22-4e1d-a9d2-4bdc7ecb472a
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://twitter.com/0gtweet/status/1354766164166115331
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001
title: Disabled Volume Snapshots
