author: Ivan Dyachkov, Yulia Fomina, oscd.community
category: process_creation
date: 2020/10/07
definition: 'Requirements: Sysmon ProcessCreation logging must be activated and Windows
  audit msut Include command line in process creation events'
description: Detects using register-cimprovider.exe to execute arbitrary dll file.
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains|all:
    - -path
    - dll
    winlog.event_data.Image|endswith: \register-cimprovider.exe
falsepositives:
- Unknown
fields:
- winlog.event_data.CommandLine
id: a2910908-e86f-4687-aeba-76a5f996e652
level: medium
logsource:
  category: process_creation
  definition: 'Requirements: Sysmon ProcessCreation logging must be activated and
    Windows audit msut Include command line in process creation events'
  product: windows
product: windows
references:
- https://twitter.com/PhilipTsukerman/status/992021361106268161
- https://github.com/api0cradle/LOLBAS/blob/master/OSBinaries/Register-cimprovider.md
status: experimental
tags:
- attack.defense_evasion
- attack.t1574
title: DLL Execution Via Register-cimprovider.exe
