author: Florian Roth
category: process_creation
date: 2021/01/30
description: Detects deinstallation of security products using WMIC utility
detection:
  condition: selection and selection_product
  selection:
    winlog.event_data.CommandLine|contains|all:
    - wmic
    - product where name=
    - call uninstall
    - /nointeractive
  selection_product:
    winlog.event_data.CommandLine|contains:
    - Antivirus
    - Endpoint Security
    - Endpoint Detection
    - Crowdstrike Sensor
    - Windows Defender
    - VirusScan
    - Threat Protection
    - Endpoint Sensor
falsepositives:
- Legitimate administration
id: 847d5ff3-8a31-4737-a970-aeae8fe21765
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://twitter.com/cglyer/status/1355171195654709249
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001
title: Wmic Uninstall Security Product
