author: vburov
category: process_creation
date: 2019/02/23
description: Detect suspicious parent processes of well-known Windows processes
detection:
  condition: selection and not filter1 and not filter2 and not filter_null
  filter1:
  - winlog.event_data.ParentImage|endswith: \SavService.exe
  - winlog.event_data.ParentImage|contains:
    - \System32\
    - \SysWOW64\
  filter2:
    winlog.event_data.ParentImage|contains:
    - \Windows Defender\
    - \Microsoft Security Client\
    winlog.event_data.ParentImage|endswith: \MsMpEng.exe
  filter_null:
    winlog.event_data.ParentImage: null
  selection:
    winlog.event_data.Image|endswith:
    - \svchost.exe
    - \taskhost.exe
    - \lsm.exe
    - \lsass.exe
    - \services.exe
    - \lsaiso.exe
    - \csrss.exe
    - \wininit.exe
    - \winlogon.exe
falsepositives:
- Some security products seem to spawn these
id: 96036718-71cc-4027-a538-d1587e0006a7
level: low
logsource:
  category: process_creation
  product: windows
modified: 2020/11/28
product: windows
references:
- https://securitybytes.io/blue-team-fundamentals-part-two-windows-processes-759fe15965e2
- https://www.carbonblack.com/2014/06/10/screenshot-demo-hunt-evil-faster-than-ever-with-carbon-black/
- https://www.13cubed.com/downloads/windows_process_genealogy_v2.pdf
- https://attack.mitre.org/techniques/T1036/
status: experimental
tags:
- attack.defense_evasion
- attack.t1036.003
- attack.t1036.005
title: Windows Processes Suspicious Parent Directory
