category: process_creation
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains:
    - checkadmin.exe 127.0.0.1 -all
    - netsh advfirewall firewall add rule name=powershell dir=in
    - cmd /c powershell.exe -ep bypass -file c:\s.ps1
    - /tn win32times /f
    - create win32times binPath=
    - \c$\windows\system32\devmgr.dll
    - ' -exec bypass -enc JgAg'
    - type *keepass\KeePass.config.xml
    - iie.exe iie.txt
    - reg query HKEY_CURRENT_USER\Software\\*\PuTTY\Sessions\
id: 1cfac73c-be78-4f9a-9b08-5bde0c3953ab
logsource:
  category: process_creation
  product: windows
product: windows
