author: Mateusz Wydra, oscd.community
category: process_creation
date: 2020/10/12
description: Atbroker executing non-deafualt Assistive Technology applications
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.CommandLine|contains:
    - animations
    - audiodescription
    - caretbrowsing
    - caretwidth
    - colorfiltering
    - cursorscheme
    - filterkeys
    - focusborderheight
    - focusborderwidth
    - highcontrast
    - keyboardcues
    - keyboardpref
    - magnifierpane
    - messageduration
    - minimumhitradius
    - mousekeys
    - Narrator
    - osk
    - overlappedcontent
    - showsounds
    - soundsentry
    - stickykeys
    - togglekeys
    - windowarranging
    - windowtracking
    - windowtrackingtimeout
    - windowtrackingzorder
  selection:
    winlog.event_data.CommandLine|contains: start
    winlog.event_data.Image|endswith: AtBroker.exe
falsepositives:
- Legitimate, non-default assistive technology applications execution
id: f24bcaea-0cd1-11eb-adc1-0242ac120002
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/08/14
product: windows
references:
- http://www.hexacorn.com/blog/2016/07/22/beyond-good-ol-run-key-part-42/
- https://lolbas-project.github.io/lolbas/Binaries/Atbroker/
status: experimental
tags:
- attack.defense_evasion
- attack.t1218
title: Suspicious Atbroker Execution
