author: Florian Roth
category: process_creation
date: 2021/04/29
description: Detects requests to exclude files, folders or processes from Antivirus
  scanning using PowerShell cmdlets
detection:
  condition: ( selection1 and selection2 ) or selection_encoded
  selection1:
    winlog.event_data.CommandLine|contains: 'Add-MpPreference '
  selection2:
    winlog.event_data.CommandLine|contains:
    - ' -ExclusionPath '
    - ' -ExclusionExtension '
    - ' -ExclusionProcess '
  selection_encoded:
    winlog.event_data.CommandLine|contains:
    - QWRkLU1wUHJlZmVyZW5jZ
    - FkZC1NcFByZWZlcmVuY2
    - BZGQtTXBQcmVmZXJlbmNl
falsepositives:
- Possible Admin Activity
- Other Cmdlets that may use the same parameters
id: 17769c90-230e-488b-a463-e05c08e9d48f
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/07/12
product: windows
references:
- https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/configure-process-opened-file-exclusions-microsoft-defender-antivirus
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1562.001/T1562.001.md
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001
title: Powershell Defender Exclusion
