author: Florian Roth
category: process_creation
date: 2019/01/16
description: Detects a suspicious program execution in a web service root folder (filter
  out false positives)
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.Image|contains:
    - bin\
    - \Tools\
    - \SMSComponent\
    winlog.event_data.ParentImage|endswith:
    - \services.exe
  selection:
    winlog.event_data.Image|contains:
    - \wwwroot\
    - \wmpub\
    - \htdocs\
falsepositives:
- Various applications
- Tools that include ping or nslookup command invocations
fields:
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: 35efb964-e6a5-47ad-bbcd-19661854018d
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
status: experimental
tags:
- attack.persistence
- attack.t1505.003
title: Execution in Webserver Root Folder
