author: Modexp (idea)
category: process_creation
date: 2019/09/02
description: Detects process memory dump via comsvcs.dll and rundll32
detection:
  condition: (rundll_image or rundll_ofn) and selection
  rundll_image:
    winlog.event_data.Image|endswith: \rundll32.exe
  rundll_ofn:
    winlog.event_data.OriginalFileName: RUNDLL32.EXE
  selection:
    winlog.event_data.CommandLine|contains|all:
    - comsvcs
    - MiniDump
    - full
falsepositives:
- unknown
fields:
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: 09e6d5c0-05b8-4ff8-9eeb-043046ec774c
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2020/09/05
product: windows
references:
- https://modexp.wordpress.com/2019/08/30/minidumpwritedump-via-com-services-dll/
- https://twitter.com/SBousseaden/status/1167417096374050817
status: experimental
tags:
- attack.defense_evasion
- attack.t1218.011
- attack.credential_access
- attack.t1003.001
title: Process Dump via Comsvcs DLL
