author: Florian Roth
category: process_creation
date: 2021/05/22
description: Detects suspicious renamed PAExec execution as often used by attackers
detection:
  condition: ( selection1 or selection2 ) and not filter
  filter:
    winlog.event_data.Image|endswith:
    - \PAexec.exe
    - \paexec.exe
  selection1:
    winlog.event_data.Description: PAExec Application
  selection2:
    winlog.event_data.OriginalFileName: PAExec.exe
falsepositives:
- Weird admins that rename their tools
- Software companies that bundle PAExec with their software and rename it, so that
  it is less embarrassing
id: c4e49831-1496-40cf-8ce1-b53f942b02f9
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/07/06
product: windows
references:
- https://www.poweradmin.com/paexec/
status: experimental
title: Renamed PAExec
