author: Cian Heasley
category: process_creation
date: 2020/07/22
description: Looking for processes spawned by web server components that indicate
  reconnaissance by popular public domain webshells for whether perl, python or wget
  are installed.
detection:
  condition: selection and selection2
  selection:
  - winlog.event_data.ParentImage|contains:
    - \apache
    - \tomcat
  - winlog.event_data.ParentImage|endswith:
    - \w3wp.exe
    - \php-cgi.exe
    - \nginx.exe
    - \httpd.exe
  selection2:
    winlog.event_data.CommandLine|contains:
    - perl --help
    - python --help
    - wget --help
    - perl -h
    winlog.event_data.Image|endswith:
    - \cmd.exe
falsepositives:
- unknown
fields:
- winlog.event_data.Image
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: f64e5c19-879c-4bae-b471-6d84c8339677
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://ragged-lab.blogspot.com/2020/07/webshells-automating-reconnaissance.html
status: experimental
tags:
- attack.persistence
- attack.t1505.003
title: Webshell Recon Detection Via CommandLine & Processes
