author: E.M. Anhaus (originally from Atomic Blue Detections, Endgame), oscd.community
category: process_creation
date: 2019/10/24
description: Identifies use of various commands to query a systems time. This technique
  may be used before executing a scheduled task or to discover the time zone of a
  target system.
detection:
  condition: selection
  selection:
  - winlog.event_data.CommandLine|contains: time
    winlog.event_data.Image|endswith:
    - \net.exe
    - \net1.exe
  - winlog.event_data.CommandLine|contains: tz
    winlog.event_data.Image|endswith: \w32tm.exe
  - winlog.event_data.CommandLine|contains: Get-Date
    winlog.event_data.Image|endswith: \powershell.exe
falsepositives:
- Legitimate use of the system utilities to discover system time for legitimate reason
id: b243b280-65fe-48df-ba07-6ddea7646427
level: low
logsource:
  category: process_creation
  product: windows
modified: 2019/11/11
product: windows
references:
- https://eqllib.readthedocs.io/en/latest/analytics/fcdb99c2-ac3c-4bde-b664-4b336329bed2.html
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1124/T1124.md
status: experimental
tags:
- attack.discovery
- attack.t1124
title: Discovery of a System Time
