author: Florian Roth
category: process_creation
date: 2020/08/28
description: Detects the execution of powershell, a WebClient object creation and
  the invocation of DownloadFile in a single command line
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains|all:
    - powershell
    - .DownloadFile
    - System.Net.WebClient
falsepositives:
- Unknown
id: 8f70ac5f-1f6f-4f8e-b454-db19561216c5
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://www.fireeye.com/blog/threat-research/2020/03/apt41-initiates-global-intrusion-campaign-using-multiple-exploits.html
status: experimental
tags:
- attack.execution
- attack.t1059.001
- attack.command_and_control
- attack.t1104
- attack.t1105
title: PowerShell DownloadFile
