author: Florian Roth
category: process_creation
date: 2021/05/27
description: Detects a regedit started with TrustedInstaller privileges or by ProcessHacker.exe
detection:
  condition: selection
  selection:
    winlog.event_data.Image|endswith: \regedit.exe
    winlog.event_data.ParentImage|endswith:
    - \TrustedInstaller.exe
    - \ProcessHacker.exe
falsepositives:
- Unlikely
id: 883835a7-df45-43e4-bf1d-4268768afda4
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://twitter.com/1kwpeter/status/1397816101455765504
title: Regedit as Trusted Installer
