detection:
  condition: selection
  selection:
    CallerProcessName|endswith: \checkadmin.exe
    winlog.event_data.TargetUserName|startswith: Administr
    winlog.event_id: 4799
id: 74ad4314-482e-4c3e-b237-3f7ed3b9ca8d
logsource:
  product: windows
  service: security
product: windows
service: security
