author: Oddvar Moe, Sander Wiebing, oscd.community
category: process_creation
date: 2020/10/12
description: Detects the import of a alternate datastream to the registry with regedit.exe.
detection:
  condition: selection and selection_2 and not filter
  filter:
    winlog.event_data.CommandLine|contains:
    - ' /e '
    - ' /a '
    - ' /c '
  selection:
    winlog.event_data.CommandLine|contains:
    - ' /i '
    - .reg
    winlog.event_data.Image|endswith: \regedit.exe
  selection_2:
    winlog.event_data.CommandLine|re: :[^ \\\\]
falsepositives:
- Unknown
fields:
- winlog.event_data.ParentImage
- winlog.event_data.CommandLine
id: 0b80ade5-6997-4b1d-99a1-71701778ea61
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OSBinaries/Regedit.yml
- https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f
status: experimental
tags:
- attack.t1112
- attack.defense_evasion
title: Imports Registry Key From an ADS
