author: Teymur Kheirkhabarov, Daniil Yugoslavskiy, oscd.community
category: process_creation
date: 2019/10/22
description: Files with well-known filenames (sensitive files with credential data)
  copying
detection:
  condition: selection
  selection:
  - winlog.event_data.CommandLine|contains:
    - vss
    - ' /m '
    - ' /y '
    winlog.event_data.Image|endswith: \esentutl.exe
  - winlog.event_data.CommandLine|contains:
    - \windows\ntds\ntds.dit
    - \config\sam
    - \config\security
    - '\config\system '
    - \repair\sam
    - \repair\system
    - \repair\security
    - \config\RegBack\sam
    - \config\RegBack\system
    - \config\RegBack\security
falsepositives:
- Copying sensitive files for legitimate use (eg. backup) or forensic investigation
  by legitimate incident responder or forensic invetigator
id: e7be6119-fc37-43f0-ad4f-1f3f99be2f9f
level: high
logsource:
  category: process_creation
  product: windows
modified: 2019/11/13
product: windows
references:
- https://room362.com/post/2013/2013-06-10-volume-shadow-copy-ntdsdit-domain-hashes-remotely-part-1/
- https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
- https://dfironthemountain.wordpress.com/2018/12/06/locked-file-access-using-esentutl-exe/
status: experimental
tags:
- attack.credential_access
- attack.t1003.002
- attack.t1003.003
- car.2013-07-001
- attack.s0404
title: Copying Sensitive Files with Credential Data
