author: Michael Haag
category: process_creation
date: 2019/01/16
description: Detects a Windows command line executable started from MSHTA
detection:
  condition: selection and selection2
  selection:
    winlog.event_data.ParentImage|endswith: \mshta.exe
  selection2:
  - winlog.event_data.Image|endswith:
    - \cmd.exe
    - \powershell.exe
    - \wscript.exe
    - \cscript.exe
    - \sh.exe
    - \bash.exe
    - \reg.exe
    - \regsvr32.exe
  - winlog.event_data.Image|contains:
    - \BITSADMIN
falsepositives:
- Printer software / driver installations
- HP software
fields:
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: 03cc0c25-389f-4bf8-b48d-11878079f1ca
level: high
logsource:
  category: process_creation
  product: windows
modified: 2020/09/01
product: windows
references:
- https://www.trustedsec.com/july-2015/malicious-htas/
status: experimental
tags:
- attack.defense_evasion
- attack.t1218.005
- car.2013-02-003
- car.2013-03-001
- car.2014-04-003
title: MSHTA Spawning Windows Shell
