author: Florian Roth
category: process_creation
date: 2018/11/17
description: Detects Base64 encoded Shellcode
detection:
  condition: selection1 and selection2
  selection1:
    winlog.event_data.CommandLine|contains: AAAAYInlM
  selection2:
    winlog.event_data.CommandLine|contains:
    - OiCAAAAYInlM
    - OiJAAAAYInlM
falsepositives:
- Unknown
id: 2d117e49-e626-4c7c-bd1f-c3c0147774c8
level: critical
logsource:
  category: process_creation
  product: windows
modified: 2020/09/01
product: windows
references:
- https://twitter.com/cyb3rops/status/1063072865992523776
status: experimental
tags:
- attack.defense_evasion
- attack.t1027
title: PowerShell Base64 Encoded Shellcode
