author: Endgame, JHasenbusch (ported for oscd.community)
category: process_creation
date: 2018/10/30
description: Identifies attempts to enumerate hosts in a network using the built-in
  Windows net.exe tool.
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.CommandLine|contains: \\\
  selection:
    winlog.event_data.CommandLine|contains: view
    winlog.event_data.Image|endswith:
    - \net.exe
    - \net1.exe
falsepositives:
- Legitimate use of net.exe utility by legitimate user
fields:
- winlog.ComputerName
- winlog.event_data.User
- winlog.event_data.CommandLine
id: 62510e69-616b-4078-b371-847da438cc03
level: low
logsource:
  category: process_creation
  product: windows
modified: 2019/11/11
product: windows
references:
- https://eqllib.readthedocs.io/en/latest/analytics/b8a94d2f-dc75-4630-9d73-1edc6bd26fff.html
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1018/T1018.md
status: stable
tags:
- attack.discovery
- attack.t1018
title: Windows Network Enumeration
