author: Florian Roth
category: process_creation
date: 2020/05/26
description: Detects commands used by Turla group as reported by ESET in May 2020
detection:
  condition: 1 of them
  selection1:
    winlog.event_data.CommandLine|contains:
    - tracert -h 10 yahoo.com
    - .WSqmCons))|iex;
    - Fr`omBa`se6`4Str`ing
  selection2:
    winlog.event_data.CommandLine|contains|all:
    - net use https://docs.live.net
    - '@aol.co.uk'
falsepositives:
- Unknown
id: 9e2e51c5-c699-4794-ba5a-29f5da40ac0c
level: critical
logsource:
  category: process_creation
  product: windows
modified: 2020/08/27
product: windows
references:
- https://www.welivesecurity.com/wp-content/uploads/2020/05/ESET_Turla_ComRAT.pdf
status: experimental
tags:
- attack.g0010
- attack.execution
- attack.t1059.001
- attack.t1053.005
- attack.t1027
title: Turla Group Commands May 2020
