author: Sreeman
category: process_creation
date: 2020/10/29
description: Adversaries can abuse wuauclt.exe (Windows Update client) to run code
  execution by specifying an arbitrary DLL.
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.CommandLine|contains:
    - wuaueng.dll
    - UpdateDeploymentProvider.dll /ClassId
  selection:
    winlog.event_data.CommandLine|re: (?i)wuauclt\.exe.*\/UpdateDeploymentProvider.*\/Runhandlercomserver
falsepositives:
- Wuaueng.dll which is a module belonging to Microsoft Windows Update.
fields:
- winlog.event_data.CommandLine
id: ba1bb0cb-73da-42de-ad3a-de10c643a5d0
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2021/06/11
product: windows
references:
- https://dtm.uk/wuauclt/
status: experimental
tags:
- attack.defense_evasion
- attack.execution
- attack.t1218.011
title: Monitoring Wuauclt.exe For Lolbas Execution Of DLL
