author: Markus Neis
category: process_creation
date: 2018/12/27
description: Detects EnableUnsafeClientMailRules used for Script Execution from Outlook
detection:
  clientMailRules:
    winlog.event_data.CommandLine|contains: EnableUnsafeClientMailRules
  condition: clientMailRules or outlookExec
  outlookExec:
    winlog.event_data.CommandLine|contains|all:
    - \\\\
    - \\
    - .exe
    winlog.event_data.ParentImage|endswith: \outlook.exe
falsepositives:
- unknown
id: e212d415-0e93-435f-9e1a-f29005bb4723
level: high
logsource:
  category: process_creation
  product: windows
modified: 2020/11/28
product: windows
references:
- https://github.com/sensepost/ruler
- https://www.fireeye.com/blog/threat-research/2018/12/overruled-containing-a-potentially-destructive-adversary.html
status: experimental
tags:
- attack.execution
- attack.t1059
- attack.t1202
title: Suspicious Execution from Outlook
