author: Thomas Patzke
category: process_creation
date: 2018/03/07
description: Detects WMI script event consumers
detection:
  condition: selection
  selection:
    winlog.event_data.Image: C:\WINDOWS\system32\wbem\scrcons.exe
    winlog.event_data.ParentImage: C:\Windows\System32\svchost.exe
falsepositives:
- Legitimate event consumers
id: ec1d5e28-8f3b-4188-a6f8-6e8df81dc28e
level: high
logsource:
  category: process_creation
  product: windows
modified: 2020/08/29
product: windows
references:
- https://www.eideon.com/2018-03-02-THL03-WMIBackdoors/
status: experimental
tags:
- attack.persistence
- attack.privilege_escalation
- attack.t1546.003
title: WMI Persistence - Script Event Consumer
