author: Thomas Patzke
category: process_creation
date: 2019/01/16
description: Web servers that spawn shell processes could be the result of a successfully
  placed web shell or an other attack
detection:
  condition: selection
  selection:
    winlog.event_data.Image|endswith:
    - \cmd.exe
    - \sh.exe
    - \bash.exe
    - \powershell.exe
    - \bitsadmin.exe
    winlog.event_data.ParentImage|endswith:
    - \w3wp.exe
    - \httpd.exe
    - \nginx.exe
    - \php-cgi.exe
    - \tomcat.exe
    - \UMWorkerProcess.exe
falsepositives:
- Particular web applications may spawn a shell process legitimately
fields:
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: 8202070f-edeb-4d31-a010-a26c72ac5600
level: high
logsource:
  category: process_creation
  product: windows
modified: 2020/03/25
product: windows
status: experimental
tags:
- attack.persistence
- attack.t1505.003
- attack.t1190
title: Shells Spawned by Web Servers
