author: Florian Roth, Michael Haag, Teymur Kheirkhabarov, Daniil Yugoslavskiy, oscd.community,
  Andreas Hunkeler (@Karneades)
category: process_creation
date: 2019/10/22
description: Shadow Copies deletion using operating systems utilities
detection:
  condition: 1 of selection*
  selection1:
    winlog.event_data.CommandLine|contains|all:
    - shadow
    - delete
    winlog.event_data.Image|endswith:
    - \powershell.exe
    - \wmic.exe
    - \vssadmin.exe
    - \diskshadow.exe
  selection2:
    winlog.event_data.CommandLine|contains|all:
    - delete
    - catalog
    - quiet
    winlog.event_data.Image|endswith:
    - \wbadmin.exe
falsepositives:
- Legitimate Administrator deletes Shadow Copies using operating systems utilities
  for legitimate reason
fields:
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: c947b146-0abc-4c87-9c64-b17e9d7274a2
level: critical
logsource:
  category: process_creation
  product: windows
modified: 2021/06/02
product: windows
references:
- https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
- https://blog.talosintelligence.com/2017/05/wannacry.html
- https://securingtomorrow.mcafee.com/other-blogs/mcafee-labs/new-teslacrypt-ransomware-arrives-via-spam/
- https://www.bleepingcomputer.com/news/security/why-everyone-should-disable-vssadmin-exe-now/
- https://www.hybrid-analysis.com/sample/ed01ebfbc9eb5bbea545af4d01bf5f1071661840480439c6e5babe8e080e41aa?environmentId=100
- https://github.com/Neo23x0/Raccine#the-process
- https://github.com/Neo23x0/Raccine/blob/main/yara/gen_ransomware_command_lines.yar
status: stable
tags:
- attack.defense_evasion
- attack.impact
- attack.t1070
- attack.t1490
title: Shadow Copies Deletion Using Operating Systems Utilities
