author: Konstantin Grishchenko, oscd.community
category: process_creation
date: 2020/10/06
description: Detect VBoxDrvInst.exe run with parameters allowing processing INF file.
  This allows to create values in the registry and install drivers. For example one
  could use this technique to obtain persistence via modifying one of Run or RunOnce
  registry keys
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains|all:
    - driver
    - executeinf
    winlog.event_data.Image|endswith: \VBoxDrvInst.exe
falsepositives:
- Legitimate use of VBoxDrvInst.exe utility by VirtualBox Guest Additions installation
  process
fields:
- winlog.ComputerName
- winlog.event_data.User
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: b7b19cb6-9b32-4fc4-a108-73f19acfe262
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/LOLUtilz/OtherBinaries/VBoxDrvInst.yml
- https://twitter.com/pabraeken/status/993497996179492864
status: experimental
tags:
- attack.defense_evasion
- attack.t1112
title: Suspicious VBoxDrvInst.exe Parameters
