author: "Ensar \u015Eamil, @sblmsrsn, @oscd_initiative"
category: process_creation
date: 2020/10/07
description: Detects the execution of Xwizard tool with specific arguments which utilized
  to run custom class properties.
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|re: '{[a-fA-F0-9]{8}-[a-fA-F0-9]{4}-[a-fA-F0-9]{4}-[a-fA-F0-9]{4}-[a-fA-F0-9]{12}}'
    winlog.event_data.Image|endswith: \xwizard.exe
falsepositives:
- Unknown
id: 53d4bb30-3f36-4e8a-b078-69d36c4a79ff
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://lolbas-project.github.io/lolbas/Binaries/Xwizard/
status: experimental
tags:
- attack.defense_evasion
- attack.t1218
title: Custom Class Execution via Xwizard
