author: Markus Neis, Swisscom
category: process_creation
date: 2019/06/04
description: Detects renamed jusched.exe used by cobalt group
detection:
  condition: (selection1 or selection2) and not filter
  filter:
    winlog.event_data.Image|endswith:
    - \jusched.exe
  selection1:
    winlog.event_data.Description: Java Update Scheduler
  selection2:
    winlog.event_data.Description: Java(TM) Update Scheduler
falsepositives:
- penetration tests, red teaming
id: edd8a48c-1b9f-4ba1-83aa-490338cd1ccb
level: high
logsource:
  category: process_creation
  product: windows
modified: 2020/09/06
product: windows
references:
- https://www.bitdefender.com/files/News/CaseStudies/study/262/Bitdefender-WhitePaper-An-APT-Blueprint-Gaining-New-Visibility-into-Financial-Threats-interactive.pdf
status: experimental
tags:
- attack.execution
- attack.defense_evasion
- attack.t1036.003
title: Renamed jusched.exe
