author: Daniil Yugoslavskiy, oscd.community
category: process_creation
date: 2019/10/24
description: Execution of well known tools for data exfiltration and tunneling
detection:
  condition: selection
  selection:
    winlog.event_data.Image|endswith:
    - \plink.exe
    - \socat.exe
    - \stunnel.exe
    - \httptunnel.exe
falsepositives:
- Legitimate Administrator using tools
id: c75309a3-59f8-4a8d-9c2c-4c927ad50555
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2020/08/29
product: windows
status: experimental
tags:
- attack.exfiltration
- attack.command_and_control
- attack.t1041
- attack.t1572
- attack.t1071.001
title: Exfiltration and Tunneling Tools Execution
