author: Florian Roth, juju4, keepwatch
category: process_creation
date: 2019/01/16
description: Detects a suspicious Microsoft certutil execution with sub commands like
  'decode' sub command, which is sometimes used to decode malicious code with the
  built-in certutil utility
detection:
  certutil:
    winlog.event_data.CommandLine|contains:
    - URL
    - ping
    winlog.event_data.Image|endswith: \certutil.exe
  condition: parameters or certutil
  parameters:
    winlog.event_data.CommandLine|contains:
    - ' -decode '
    - ' -decodehex '
    - ' -urlcache '
    - ' -verifyctl '
    - ' -encode '
    - ' /decode '
    - ' /decodehex '
    - ' /urlcache '
    - ' /verifyctl '
    - ' /encode '
falsepositives:
- False positives depend on scripts and administrative tools used in the monitored
  environment
fields:
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: e011a729-98a6-4139-b5c4-bf6f6dd8239a
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/04/23
product: windows
references:
- https://twitter.com/JohnLaTwC/status/835149808817991680
- https://blogs.technet.microsoft.com/pki/2006/11/30/basic-crl-checking-with-certutil/
- https://www.trustedsec.com/2017/07/new-tool-release-nps_payload/
- https://twitter.com/egre55/status/1087685529016193025
- https://lolbas-project.github.io/lolbas/Binaries/Certutil/
status: experimental
tags:
- attack.defense_evasion
- attack.t1140
- attack.command_and_control
- attack.t1105
- attack.s0160
- attack.g0007
- attack.g0010
- attack.g0045
- attack.g0049
- attack.g0075
- attack.g0096
title: Suspicious Certutil Command
