author: Jonhnathan Ribeiro, oscd.community
category: process_creation
date: 2020/10/16
description: Detects suspicious DACL modifications that can  be used to hide services
  or make them unstopable
detection:
  condition: selection and sids
  selection:
    winlog.event_data.CommandLine|contains|all:
    - sdset
    - D;;
    winlog.event_data.Image|endswith:
    - \sc.exe
  sids:
    winlog.event_data.CommandLine|contains:
    - ;;;IU
    - ;;;SU
    - ;;;BA
    - ;;;SY
    - ;;;WD
falsepositives:
- Unknown
id: 99cf1e02-00fb-4c0d-8375-563f978dfd37
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://www.sans.org/blog/red-team-tactics-hiding-windows-services/
- https://docs.microsoft.com/pt-br/windows/win32/secauthz/sid-strings
status: experimental
tags:
- attack.persistence
- attack.t1543.003
title: Suspicious Service DACL Modification
