detection:
  c2_selection:
    QNAME:
    - asyspy256.ddns.net
    - hotkillmail9sddcc.ddns.net
    - rosaf112.ddns.net
    - cvdfhjh1231.myftp.biz
    - sz2016rose.ddns.net
    - dffwescwer4325.myftp.biz
    - cvdfhjh1231.ddns.net
    winlog.event_id: 257
  condition: c2_selection
id: 3db10f25-2527-4b79-8d4b-471eb900ee29
logsource:
  product: windows
  service: dns-server
product: windows
service: dns-server
