author: oscd.community, Zach Stanford @svch0st
category: process_creation
date: 2020/10/05
description: Detects Possible usage of Windows Subsystem for Linux (WSL) binary as
  a LOLBIN
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains:
    - ' -e '
    - ' --exec '
    winlog.event_data.Image|endswith:
    - \wsl.exe
falsepositives:
- Automation and orchestration scripts may use this method execute scripts etc
id: dec44ca7-61ad-493c-bfd7-8819c5faa09b
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Wsl/
status: experimental
tags:
- attack.execution
- attack.defense_evasion
- attack.t1218
- attack.t1202
title: WSL Execution
