author: Florian Roth
category: process_creation
date: 2021/05/27
description: Detects suspicious start of rundll32.exe without any parameters as found
  in CobaltStrike beacon activity
detection:
  condition: selection and not filter1 and not filter2
  filter1:
    winlog.event_data.ParentImage|endswith: \svchost.exe
  filter2:
    winlog.event_data.ParentImage|contains:
    - \AppData\Local\
    - \Microsoft\Edge\
  selection:
    winlog.event_data.CommandLine|endswith: \rundll32.exe
falsepositives:
- Possible but rare
fields:
- winlog.event_data.ParentImage
- winlog.event_data.ParentCommandLine
id: 1775e15e-b61b-4d14-a1a3-80981298085a
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://www.cobaltstrike.com/help-opsec
status: experimental
title: Suspicious Rundll32 Without Any CommandLine Params
