author: Julia Fomina, oscd.community
category: process_creation
date: 2020/10/08
description: Detects code execution via Pester.bat (Pester - Powershell Modulte for
  testing)
detection:
  cmd_execution:
    winlog.event_data.CommandLine|contains|all:
    - pester
    - ;
    winlog.event_data.Image|endswith: \cmd.exe
  condition: powershell_module or (cmd_execution and get_help)
  get_help:
    winlog.event_data.CommandLine|contains:
    - help
    - '?'
  powershell_module:
    winlog.event_data.CommandLine|contains|all:
    - Pester
    - Get-Help
    winlog.event_data.Image|endswith: \powershell.exe
falsepositives:
- Legitimate use of Pester for writing tests for Powershell scripts and modules
id: 59e938ff-0d6d-4dc3-b13f-36cc28734d4e
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://twitter.com/Oddvarmoe/status/993383596244258816
status: experimental
tags:
- attack.execution
- attack.t1059.001
- attack.defense_evasion
- attack.t1216
title: Execute Code with Pester.bat
