author: Florian Roth
category: process_creation
date: 2021/06/28
description: Detects suspicious command line reg.exe tool adding key to RUN key in
  Registry
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains|all:
    - reg
    - ' ADD '
    - Software\Microsoft\Windows\CurrentVersion\Run
falsepositives:
- Unknown
id: de587dce-915e-4218-aac4-835ca6af6f70
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://app.any.run/tasks/9c0f37bc-867a-4314-b685-e101566766d7/
- https://docs.microsoft.com/en-us/windows/win32/setupapi/run-and-runonce-registry-keys
status: experimental
title: Reg Add RUN Key
