author: E.M. Anhaus (originally from Atomic Blue Detections, Endgame), oscd.community
category: process_creation
date: 2019/10/24
description: Detect child processes of automatically elevated instances of Microsoft
  Connection Manager Profile Installer (cmstp.exe).
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains:
    - /s
    - /au
    winlog.event_data.Image|endswith: \cmstp.exe
falsepositives:
- Legitimate use of cmstp.exe utility by legitimate user
fields:
- winlog.ComputerName
- winlog.event_data.User
- winlog.event_data.CommandLine
id: e66779cc-383e-4224-a3a4-267eeb585c40
level: high
logsource:
  category: process_creation
  product: windows
modified: 2020/08/29
product: windows
references:
- https://eqllib.readthedocs.io/en/latest/analytics/e584f1a1-c303-4885-8a66-21360c90995b.html
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1191/T1191.md
status: experimental
tags:
- attack.privilege_escalation
- attack.defense_evasion
- attack.t1548.002
- attack.t1218.003
title: Bypass UAC via CMSTP
