author: Florian Roth
category: process_creation
date: 2018/09/03
description: Detects the execution of DLL side-loading malware used by threat group
  Emissary Panda aka APT27
detection:
  condition: selection
  selection:
    winlog.event_data.Image|endswith: \svchost.exe
    winlog.event_data.ParentImage|endswith: \sllauncher.exe
falsepositives:
- Unknown
id: 9aa01d62-7667-4d3b-acb8-8cb5103e2014
level: critical
logsource:
  category: process_creation
  product: windows
modified: 2020/08/27
product: windows
references:
- https://app.any.run/tasks/579e7587-f09d-4aae-8b07-472833262965
- https://twitter.com/cyb3rops/status/1168863899531132929
status: experimental
tags:
- attack.defense_evasion
- attack.t1574.002
title: Emissary Panda Malware SLLauncher
