author: Victor Sergeev, oscd.community
category: process_creation
date: 2020/10/09
description: Detects execution of powershell scripts via Runscripthelper.exe
detection:
  cmd:
    winlog.event_data.CommandLine|contains: surfacecheck
  condition: image_path and cmd
  image_path:
    winlog.event_data.Image|endswith: \Runscripthelper.exe
falsepositives:
- Unknown
fields:
- winlog.event_data.CommandLine
id: eca49c87-8a75-4f13-9c73-a5a29e845f03
level: medium
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OSBinaries/Runscripthelper.yml
status: experimental
tags:
- attack.execution
- attack.t1059
- attack.defense_evasion
- attack.t1202
title: Suspicious Runscripthelper.exe
