author: Florian Roth, oscd.community, Jonhnathan Ribeiro
category: process_creation
date: 2017/07/20
description: Detects a ZxShell start by the called and well-known function name
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains:
    - zxFunction
    - RemoteDiskXXXXX
    winlog.event_data.Image|endswith:
    - \rundll32.exe
falsepositives:
- Unlikely
fields:
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: f0b70adb-0075-43b0-9745-e82a1c608fcc
level: critical
logsource:
  category: process_creation
  product: windows
modified: 2020/08/26
product: windows
references:
- https://www.hybrid-analysis.com/sample/5d2a4cde9fa7c2fdbf39b2e2ffd23378d0c50701a3095d1e91e3cf922d7b0b16?environmentId=100
tags:
- attack.execution
- attack.t1059.003
- attack.defense_evasion
- attack.t1218.011
- attack.s0412
- attack.g0001
title: ZxShell Malware
