author: Florian Roth
category: process_creation
date: 2021/07/17
description: Detects suspicious mshta process patterns
detection:
  condition: selection_base and ( selection1 or selection2 ) or ( selection_base and
    not filter3 ) or ( selection_base and not filter4 )
  filter3:
    winlog.event_data.Image|contains:
    - C:\Windows\System32
    - C:\Windows\SysWOW64
  filter4:
    winlog.event_data.CommandLine|contains:
    - .htm
    - .hta
    winlog.event_data.CommandLine|endswith:
    - mshta.exe
    - mshta
  selection1:
    winlog.event_data.ParentImage|endswith:
    - \cmd.exe
    - \powershell.exe
  selection2:
    winlog.event_data.CommandLine|contains:
    - \AppData\Local
    - C:\Windows\Temp
    - C:\Users\Public
  selection_base:
    winlog.event_data.Image|endswith: \mhsta.exe
falsepositives:
- Unknown
id: e32f92d1-523e-49c3-9374-bdb13b46a3ba
level: high
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://en.wikipedia.org/wiki/HTML_Application
- https://www.echotrail.io/insights/search/mshta.exe
- https://app.any.run/tasks/34221348-072d-4b70-93f3-aa71f6ebecad/
status: experimental
tags:
- attack.execution
title: Suspicious MSHTA Process Patterns
