author: Florian Roth
category: process_creation
date: 2018/12/19
description: Detects command line parameters used by Rubeus hack tool
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains:
    - ' asreproast '
    - ' dump /service:krbtgt '
    - ' kerberoast '
    - ' createnetonly /program:'
    - ' ptt /ticket:'
    - ' /impersonateuser:'
    - ' renew /ticket:'
    - ' asktgt /user:'
    - ' harvest /interval:'
    - ' s4u /user:'
    - ' s4u /ticket:'
    - ' hash /password:'
falsepositives:
- unlikely
id: 7ec2c172-dceb-4c10-92c9-87c1881b7e18
level: critical
logsource:
  category: process_creation
  product: windows
product: windows
references:
- https://www.harmj0y.net/blog/redteaming/from-kekeo-to-rubeus/
tags:
- attack.credential_access
- attack.t1003
- attack.t1558.003
- attack.lateral_movement
- attack.t1550.003
title: Rubeus Hack Tool
