category: process_creation
detection:
  condition: legitimate_executable and not legitimate_process_path
  legitimate_executable:
    sha1:
    - e570585edc69f9074cb5e8a790708336bd45ca0f
  legitimate_process_path:
    winlog.event_data.Image|contains:
    - :\Program Files(x86)\
    - :\Program Files\
id: 18739897-21b1-41da-8ee4-5b786915a676
logsource:
  category: process_creation
  product: windows
product: windows
