author: '@neu5ron, Teymur Kheirkhabarov, oscd.community'
date: 2020/04/02
description: Transferring files with well-known filenames (sensitive files with credential
  data) using network shares
detection:
  condition: selection
  selection:
    name:
    - \mimidrv
    - \lsass
    - \windows\minidump\
    - \hiberfil
    - \sqldmpr
    - \sam
    - \ntds.dit
    - \security
falsepositives:
- Transferring sensitive files for legitimate administration work by legitimate administrator
id: 2e69f167-47b5-4ae7-a390-47764529eff5
level: medium
logsource:
  product: zeek
  service: smb_files
product: zeek
references:
- https://github.com/neo23x0/sigma/blob/373424f14574facf9e261d5c822345a282b91479/rules/windows/builtin/win_transferring_files_with_credential_data_via_network_shares.yml
service: smb_files
status: experimental
tags:
- attack.credential_access
- attack.t1003.002
- attack.t1003.001
- attack.t1003.003
title: Transferring Files with Credential Data via Network Shares - Zeek
