author: Greg Howell, OTR (Open Threat Research)
date: 2020/04/05
description: This rule detects potential exfiltration by looking for a few compression
  extensions in the uri and signs of compression in the mime type, file type, and
  http body
detection:
  condition: selection1 or selection3 or selection4
  selection1:
    mime_types|endswith: compressed
    uri|endswith:
    - .7z
    - .zip
    - .rar
  selection3:
    filetype|endswith: compressed
  selection4:
    http.bodyMagic|endswith: compressed
    http.method: PUT
falsepositives:
- Legitimate upload/download of archives
id: 0d47e3f6-357f-4534-928c-202631d065fa
level: medium
logsource:
  product: zeek
  service: http
product: zeek
references:
- https://github.com/OTRF/detection-hackathon-apt29/issues/17
service: http
tags:
- attack.exfiltration
- attack.t1560.001
- attack.t1005
title: Potential Exfiltration of Compressed Files
