author: Samir Bousseaden, @neu5ron
date: 2020/03/19
description: Detect AD credential dumping using impacket secretdump HKTL. Based on
  the SIGMA rules/windows/builtin/win_impacket_secretdump.yml
detection:
  condition: selection
  selection:
    name|contains: SYSTEM32\
    name|endswith: .tmp
    path|contains|all:
    - \
    - ADMIN$
falsepositives:
- unknown
id: 92dae1ed-1c9d-4eff-a567-33acbd95b00e
level: high
logsource:
  product: zeek
  service: smb_files
product: zeek
references:
- https://blog.menasec.net/2019/02/threat-huting-10-impacketsecretdump.html
service: smb_files
tags:
- attack.credential_access
- attack.t1003.002
- attack.t1003.004
- attack.t1003.003
title: Possible Impacket SecretDump Remote Activity - Zeek
