author: Nate Guagenti (@neu5ron), Open Threat Research (OTR)
date: 2020/05/03
description: Domain user and group enumeration via network reconnaissance. Seen in
  APT 29 and other common tactics and actors. Detects a set of RPC (remote procedure
  calls) used to enumerate a domain controller. The rule was created based off the
  datasets and hackathon from https://github.com/OTRF/detection-hackathon-apt29
detection:
  condition: selection | count(operation) by src_ip > 4
  selection:
    operation:
    - LsarLookupNames3
    - LsarLookupSids3
    - SamrGetGroupsForUser
    - SamrLookupIdsInDomain
    - SamrLookupNamesInDomain
    - SamrQuerySecurityObject
    - SamrQueryInformationGroup
  timeframe: 30s
falsepositives:
- Devices that may do authentication like a VPN or a firewall that looksup IPs to
  username
- False positives depend on scripts and administrative tools used in the monitored
  environment
id: 66a0bdc6-ee04-441a-9125-99d2eb547942
level: medium
logsource:
  product: zeek
  service: dce_rpc
modified: 2020/09/02
product: zeek
references:
- https://github.com/OTRF/detection-hackathon-apt29
- https://github.com/OTRF/detection-hackathon-apt29/issues/37
service: dce_rpc
status: experimental
tags:
- attack.discovery
- attack.t1087.002
- attack.t1082
title: Domain User Enumeration Network Recon 01
