author: '@BarryShooshooga'
date: 2019/10/26
definition: 'Requirements: Audit Policy : Security Settings/Local Policies/Audit Policy,
  Registry System Access Control (SACL): Auditing/User'
description: Detects scenarios where an windows defender exclusion was added in registry
  where an entity would want to bypass antivirus scanning from windows defender
detection:
  condition: selection
  selection:
    winlog.event_data.ObjectName|contains: \Microsoft\Windows Defender\Exclusions\
    winlog.event_id:
    - 4657
    - 4656
    - 4660
    - 4663
falsepositives:
- Intended inclusions by administrator
id: e9c8808f-4cfb-4ba9-97d4-e5f3beaa244d
level: high
logsource:
  definition: 'Requirements: Audit Policy : Security Settings/Local Policies/Audit
    Policy, Registry System Access Control (SACL): Auditing/User'
  product: windows
  service: security
product: windows
references:
- https://www.bleepingcomputer.com/news/security/gootkit-malware-bypasses-windows-defender-by-setting-path-exclusions/
service: security
tags:
- attack.defense_evasion
- attack.t1562.001
title: Windows Defender Exclusion Set
