author: Florian Roth
date: 2017/03/17
description: This rule detects rare scheduled task creations. Typically software gets
  installed on multiple systems and not only on a few. The aggregation and count function
  selects tasks with rare names.
detection:
  condition: selection | count() by TaskName < 5
  selection:
    winlog.event_id: 106
  timeframe: 7d
falsepositives:
- Software installation
id: b20f6158-9438-41be-83da-a5a16ac90c2b
level: low
logsource:
  product: windows
  service: taskscheduler
product: windows
service: taskscheduler
status: experimental
tags:
- attack.persistence
- attack.s0111
- attack.t1053.005
title: Rare Scheduled Task Creations
