author: Nasreddine Bencherchali
category: file_block
date: 2022/08/16
description: Triggers on any Sysmon file block executable event. Which should indicates
  a violation of the block policy set
detection:
  condition: selection
  selection:
    winlog.event_data.Image: '*'
falsepositives:
- Unlikely
id: 23b71bc5-953e-4971-be4c-c896cda73fc2
level: high
logsource:
  category: file_block
  product: windows
product: windows
references:
- https://medium.com/@olafhartong/sysmon-14-0-fileblockexecutable-13d7ba3dff3e
status: experimental
tags:
- attack.defense_evasion
title: Sysmon Blocked Executable
