author: Florian Roth, Markus Neis, Jonhnathan Ribeiro, Daniil Yugoslavskiy, oscd.community
date: 2018/03/23
description: Detects Chafer activity attributed to OilRig as reported in Nyotron report
  in March 2018
detection:
  condition: selection_service
  selection_service:
    Provider_Name: Service Control Manager
    winlog.event_data.ServiceName:
    - SC Scheduled Scan
    - UpdatMachine
    winlog.event_id: 7045
falsepositives:
- Unknown
id: 53ba33fd-3a50-4468-a5ef-c583635cfa92
level: critical
logsource:
  product: windows
  service: system
modified: 2021/11/30
product: windows
references:
- https://nyotron.com/nyotron-discovers-next-generation-oilrig-attacks/
service: system
status: experimental
tags:
- attack.persistence
- attack.g0049
- attack.t1053.005
- attack.s0111
- attack.t1543.003
- attack.defense_evasion
- attack.t1112
- attack.command_and_control
- attack.t1071.004
title: Chafer Activity
