author: Florian Roth
date: 2017/03/07
description: This method detects a service install of the malicious Microsoft Network
  Realtime Inspection Service service described in StoneDrill report by Kaspersky
detection:
  condition: selection
  selection:
    Provider_Name: Service Control Manager
    winlog.event_data.ImagePath|endswith: ' LocalService'
    winlog.event_data.ServiceName: NtsSrv
    winlog.event_id: 7045
falsepositives:
- Unlikely
id: 9e987c6c-4c1e-40d8-bd85-dd26fba8fdd6
level: high
logsource:
  product: windows
  service: system
modified: 2021/11/30
product: windows
references:
- https://securelist.com/blog/research/77725/from-shamoon-to-stonedrill/
service: system
status: test
tags:
- attack.persistence
- attack.g0064
- attack.t1543.003
title: StoneDrill Service Install
