author: Cybex
date: 2022/08/16
description: During exploitation of this vuln, two logs (providername:Microsoft-Windows-User
  Profiles Service) with eventid 1511 and 1515 (maybe lot of false positives with
  this event) are created. Moreover, it appears the directory \Users\TEMP is created
  may be created during the exploitation.Viewed on 2008 Server
detection:
  condition: selection
  selection:
    ProviderName: Microsoft-Windows-User Profiles Service
    winlog.event_id: 1511
falsepositives:
- Unknown
id: 52a85084-6989-40c3-8f32-091e12e17692
level: high
logsource:
  product: windows
  service: application
product: windows
references:
- https://packetstormsecurity.com/files/166692/Windows-User-Profile-Service-Privlege-Escalation.html
service: application
status: experimental
tags:
- attack.execution
title: Suspicious Usage of CVE_2021_34484 or CVE 2022_21919
