author: Florian Roth
date: 2021/05/27
description: Detects a ProcessHacker tool that elevated privileges to a very high
  level
detection:
  condition: selection
  selection:
    Provider_Name: Service Control Manager
    winlog.event_data.AccountName: LocalSystem
    winlog.event_data.ServiceName|startswith: ProcessHacker
    winlog.event_id: 7045
falsepositives:
- Unlikely
id: c4ff1eac-84ad-44dd-a6fb-d56a92fc43a9
level: high
logsource:
  product: windows
  service: system
modified: 2021/11/30
product: windows
references:
- https://twitter.com/1kwpeter/status/1397816101455765504
service: system
status: experimental
tags:
- attack.execution
- attack.privilege_escalation
- attack.t1543.003
- attack.t1569.002
title: ProcessHacker Privilege Elevation
