author: Nikita Nazarov, oscd.community
date: 2020/10/09
description: Detects Obfuscated Powershell via use Rundll32 in Scripts
detection:
  condition: selection
  selection:
    Provider_Name: Service Control Manager
    winlog.event_data.ImagePath|contains:
    - value
    - invoke
    - comspec
    - iex
    winlog.event_data.ImagePath|contains|all:
    - '&&'
    - rundll32
    - shell32.dll
    - shellexec_rundll
    winlog.event_id: 7045
falsepositives:
- Unknown
id: 641a4bfb-c017-44f7-800c-2aee0184ce9b
level: high
logsource:
  product: windows
  service: system
modified: 2022/03/07
product: windows
references:
- https://github.com/Neo23x0/sigma/issues/1009
service: system
status: experimental
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
title: Invoke-Obfuscation Via Use Rundll32
