author: oscd.community, Natalia Shornikova
date: 2020/10/06
description: Detects powershell script installed as a Service
detection:
  condition: selection
  selection:
    Provider_Name: Service Control Manager
    winlog.event_data.ImagePath|contains:
    - powershell
    - pwsh
    winlog.event_id: 7045
falsepositives:
- Unknown
id: a2e5019d-a658-4c6a-92bf-7197b54e2cae
level: high
logsource:
  product: windows
  service: system
modified: 2021/11/30
product: windows
references:
- https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse
service: system
status: experimental
tags:
- attack.execution
- attack.t1569.002
title: PowerShell Scripts Installed as Services
