author: Nikita Nazarov, oscd.community
date: 2020/10/12
description: Detects Obfuscated Powershell via Stdin in Scripts
detection:
  condition: selection
  selection:
    Provider_Name: Service Control Manager
    winlog.event_data.ImagePath|re: (?i).*(set).*&&\s?set.*(environment|invoke|\${?input).*&&.*"
    winlog.event_id: 7045
falsepositives:
- Unknown
id: 487c7524-f892-4054-b263-8a0ace63fc25
level: high
logsource:
  product: windows
  service: system
modified: 2021/11/30
product: windows
references:
- https://github.com/Neo23x0/sigma/issues/1009
service: system
status: experimental
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
title: Invoke-Obfuscation Via Stdin
