author: Jonathan Cheong, oscd.community
date: 2020/10/15
description: Detects Obfuscated use of Environment Variables to execute PowerShell
detection:
  condition: selection
  selection:
    Provider_Name: Service Control Manager
    winlog.event_data.ImagePath|re: .*cmd.{0,5}(?:\/c|\/r)(?:\s|)\"set\s[a-zA-Z]{3,6}.*(?:\{\d\}){1,}\\\"\s+?\-f(?:.*\)){1,}.*\"
    winlog.event_id: 7045
falsepositives:
- Unknown
id: 8ca7004b-e620-4ecb-870e-86129b5b8e75
level: high
logsource:
  product: windows
  service: system
modified: 2021/11/30
product: windows
references:
- https://github.com/Neo23x0/sigma/issues/1009
service: system
status: experimental
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
title: Invoke-Obfuscation VAR+ Launcher
