author: Florian Roth, Nasreddine Bencherchali
date: 2022/08/25
description: Detects known malicious service installation that appear in cases in
  which a Sliver implants execute the PsExec commands
detection:
  condition: selection_id and 1 of selection_service*
  selection_id:
    Provider_Name: Service Control Manager
    winlog.event_id: 7045
  selection_service1:
    winlog.event_data.ImagePath|re: ^[a-zA-Z]:\\windows\\temp\\[a-zA-Z0-9]{10}\.exe
  selection_service2:
    winlog.event_data.ServiceName:
    - Sliver
    - Sliver implant
falsepositives:
- Unknown
id: 31c51af6-e7aa-4da7-84d4-8f32cc580af2
level: high
logsource:
  product: windows
  service: system
product: windows
references:
- https://github.com/BishopFox/sliver/blob/79f2d48fcdfc2bee4713b78d431ea4b27f733f30/client/command/commands.go#L1231
- https://www.microsoft.com/security/blog/2022/08/24/looking-for-the-sliver-lining-hunting-for-emerging-command-and-control-frameworks/
service: system
status: experimental
tags:
- attack.execution
- attack.privilege_escalation
- attack.t1543.003
- attack.t1569.002
title: Sliver C2 Default Service Installation
