author: Florian Roth, Tim Shelton
date: 2022/05/17
description: One of the Windows Core Eventlogs has been cleared. e.g. caused by "wevtutil
  cl" command execution
detection:
  condition: selection
  selection:
    Provider_Name: Microsoft-Windows-Eventlog
    winlog.channel:
    - System
    - Security
    - Application
    winlog.event_id: 104
falsepositives:
- Rollout of log collection agents (the setup routine often includes a reset of the
  local Eventlog)
- System provisioning (system reset before the golden image creation)
id: 100ef69e-3327-481c-8e5c-6d80d9507556
level: high
logsource:
  product: windows
  service: system
modified: 2022/05/19
product: windows
references:
- https://twitter.com/deviouspolack/status/832535435960209408
- https://www.hybrid-analysis.com/sample/027cc450ef5f8c5f653329641ec1fed91f694e0d229928963b30f6b0d7d3a745?environmentId=100
related:
- id: a62b37e0-45d3-48d9-a517-90c1a1b0186b
  type: derived
service: system
status: experimental
tags:
- attack.defense_evasion
- attack.t1070.001
- car.2016-04-002
title: System Eventlog Cleared
