author: Tim Shelton
date: 2022/04/26
description: Detects the reporting of NTLMv1 being used between a client and server
detection:
  condition: selection
  selection:
    Provider_Name: LsaSrv
    winlog.event_id: 6038
falsepositives:
- Environments that use NTLMv1
fields:
- Provider_Name
- winlog.event_id
id: e9d4ab66-a532-4ef7-a502-66a9e4a34f5d
level: low
logsource:
  product: windows
  service: system
modified: 2022/05/02
product: windows
references:
- https://attack.mitre.org/techniques/T1550/002/
service: system
status: experimental
tags:
- attack.execution
- attack.t1550.002
- attack.s0363
title: NTLMv1 Logon Between Client and Server
