author: Florian Roth
date: 2017/03/08
description: Detects rare service installs that only appear a few times per time frame
  and could reveal password dumpers, backdoor installs or other types of malicious
  services
detection:
  condition: selection | count() by ServiceName < 5
  selection:
    Provider_Name: Service Control Manager
    winlog.event_id: 7045
  timeframe: 7d
falsepositives:
- Software installation
- Software updates
id: 66bfef30-22a5-4fcd-ad44-8d81e60922ae
level: low
logsource:
  product: windows
  service: system
modified: 2022/03/21
product: windows
service: system
status: test
tags:
- attack.persistence
- attack.privilege_escalation
- car.2013-09-005
- attack.t1543.003
title: Rare Service Installations
