author: Florian Roth
date: 2017/05/15
description: Detects QuarksPwDump clearing access history in hive
detection:
  condition: selection
  selection:
    Provider_Name: Microsoft-Windows-Kernel-General
    winlog.event_data.HiveName|contains: \AppData\Local\Temp\SAM
    winlog.event_data.HiveName|endswith: .dmp
    winlog.event_id: 16
falsepositives:
- Unknown
id: 39f919f3-980b-4e6f-a975-8af7e507ef2b
level: critical
logsource:
  product: windows
  service: system
modified: 2022/04/14
product: windows
service: system
status: test
tags:
- attack.credential_access
- attack.t1003.002
title: QuarksPwDump Clearing Access History
