author: Daniel Bohannon (@Mandiant/@FireEye), oscd.community
date: 2019/11/08
description: Detects all variations of obfuscated powershell IEX invocation code generated
  by Invoke-Obfuscation framework from the code block linked in the references
detection:
  condition: all of selection_*
  selection_eid:
    winlog.event_id: 7045
  selection_imagepath:
  - winlog.event_data.ImagePath|re: \$PSHome\[\s*\d{1,3}\s*\]\s*\+\s*\$PSHome\[
  - winlog.event_data.ImagePath|re: \$ShellId\[\s*\d{1,3}\s*\]\s*\+\s*\$ShellId\[
  - winlog.event_data.ImagePath|re: \$env:Public\[\s*\d{1,3}\s*\]\s*\+\s*\$env:Public\[
  - winlog.event_data.ImagePath|re: \$env:ComSpec\[(\s*\d{1,3}\s*,){2}
  - winlog.event_data.ImagePath|re: \\*mdr\*\W\s*\)\.Name
  - winlog.event_data.ImagePath|re: \$VerbosePreference\.ToString\(
  - winlog.event_data.ImagePath|re: \String\]\s*\$VerbosePreference
falsepositives:
- Unknown
id: 51aa9387-1c53-4153-91cc-d73c59ae1ca9
level: high
logsource:
  product: windows
  service: system
modified: 2022/07/11
product: windows
references:
- https://github.com/danielbohannon/Invoke-Obfuscation/blob/f20e7f843edd0a3a7716736e9eddfa423395dd26/Out-ObfuscatedStringCommand.ps1#L873-L888
service: system
status: experimental
tags:
- attack.defense_evasion
- attack.t1027
title: Invoke-Obfuscation Obfuscated IEX Invocation
