author: Florian Roth
date: 2017/03/31
description: This method detects a service install of malicious services mentioned
  in Carbon Paper - Turla report by ESET
detection:
  condition: selection
  selection:
    Provider_Name: Service Control Manager
    winlog.event_data.ServiceName:
    - srservice
    - ipvpn
    - hkmsvc
    winlog.event_id: 7045
falsepositives:
- Unknown
id: 1df8b3da-b0ac-4d8a-b7c7-6cb7c24160e4
level: high
logsource:
  product: windows
  service: system
modified: 2021/11/30
product: windows
references:
- https://www.welivesecurity.com/2017/03/30/carbon-paper-peering-turlas-second-stage-backdoor/
service: system
status: test
tags:
- attack.persistence
- attack.g0010
- attack.t1543.003
title: Turla Service Install
