author: frack113
date: 2021/12/15
description: 'The attacker creates a computer object using those permissions with
  a password known to her.

  After that she clears the attribute ServicePrincipalName on the computer object.

  Because she created the object (CREATOR OWNER), she gets granted additional permissions
  and can do many changes to the object.

  '
detection:
  condition: selection_1 or selection_2
  selection_1:
    Provider_Name: Microsoft-Windows-Kerberos-Key-Distribution-Center
    winlog.event_id:
    - 35
    - 36
    - 37
    - 38
  selection_2:
    Provider_Name: Microsoft-Windows-Directory-Services-SAM
    winlog.event_id:
    - 16990
    - 16991
falsepositives:
- Unknown
fields:
- samAccountName
id: 44bbff3e-4ca3-452d-a49a-6efa4cafa06f
level: medium
logsource:
  product: windows
  service: system
product: windows
references:
- https://cloudbrothers.info/en/exploit-kerberos-samaccountname-spoofing/
service: system
status: experimental
tags:
- attack.credential_access
- attack.t1558.003
title: Exploit SamAccountName Spoofing with Kerberos
