author: Florian Roth
date: 2018/01/27
definition: The source of this type of event is Kernel-General
description: Detects suspicious SAM dump activity as cause by QuarksPwDump and other
  password dumpers
detection:
  condition: selection and all of keywords
  keywords:
  - \AppData\Local\Temp\SAM-
  - .dmp
  selection:
    Provider_Name: Microsoft-Windows-Kernel-General
    winlog.event_id: 16
falsepositives:
- Unknown
id: 839dd1e8-eda8-4834-8145-01beeee33acd
level: high
logsource:
  definition: The source of this type of event is Kernel-General
  product: windows
  service: system
modified: 2022/04/14
product: windows
service: system
status: test
tags:
- attack.credential_access
- attack.t1003.002
title: SAM Dump to AppData
