author: pH-T
date: 2022/03/18
description: Detects suspicious service installation commands
detection:
  condition: selection and ( suspicious1 or all of suspicious2* ) and not 1 of filter_*
  filter_thor_remote:
    winlog.event_data.ImagePath|startswith: C:\WINDOWS\TEMP\thor10-remote\thor64.exe
  selection:
    Provider_Name: Service Control Manager
    winlog.event_id: 7045
  suspicious1:
    winlog.event_data.ImagePath|contains:
    - ' -w hidden '
    - ' -nop '
    - ' -sta '
    - \Users\Public\
    - \Windows\Temp\
    - \Perflogs\
    - \\\\.\\pipe
    - \ADMIN$\
    - .downloadstring(
    - .downloadfile(
  suspicious2a:
    winlog.event_data.ImagePath|contains: ' -e'
  suspicious2b:
    winlog.event_data.ImagePath|contains:
    - ' JAB'
    - ' SUVYI'
    - ' SQBFAFgA'
    - ' aWV4I'
    - ' IAB'
    - ' PAA'
    - ' aQBlAHgA'
falsepositives:
- Unknown
id: 1d61f71d-59d2-479e-9562-4ff5f4ead16b
level: high
logsource:
  product: windows
  service: system
modified: 2022/05/02
product: windows
service: system
status: experimental
tags:
- attack.persistence
- attack.privilege_escalation
- car.2013-09-005
- attack.t1543.003
title: Suspicious Service Installation
