author: Florian Roth
date: 2018/11/23
description: This method detects malicious services mentioned in Turla PNG dropper
  report by NCC Group in November 2018
detection:
  condition: selection
  selection:
    Provider_Name: Service Control Manager
    winlog.event_data.ServiceName: WerFaultSvc
    winlog.event_id: 7045
falsepositives:
- Unlikely
id: 1228f8e2-7e79-4dea-b0ad-c91f1d5016c1
level: critical
logsource:
  product: windows
  service: system
modified: 2021/11/30
product: windows
references:
- https://www.nccgroup.trust/uk/about-us/newsroom-and-events/blogs/2018/november/turla-png-dropper-is-back/
service: system
status: test
tags:
- attack.persistence
- attack.g0010
- attack.t1543.003
title: Turla PNG Dropper Service
