author: Austin Songer @austinsonger
date: 2021/10/12
description: Detects when an user account is locked or suspended.
detection:
  condition: 1 of selection*
  selection1:
    event_type_id: 532
  selection2:
    event_type_id: 553
  selection3:
    event_type_id: 551
falsepositives:
- System may lock or suspend user accounts.
id: a717c561-d117-437e-b2d9-0118a7035d01
level: low
logsource:
  product: onelogin
  service: onelogin.events
modified: 2021/10/12
product: onelogin
references:
- https://developers.onelogin.com/api-docs/1/events/event-resource/
service: onelogin.events
status: experimental
tags:
- attack.impact
title: OneLogin User Account Locked
