author: Austin Songer @austinsonger
date: 2021/10/12
description: Detects when an user assumed another user account.
detection:
  condition: selection
  selection:
    event_type_id: 3
falsepositives:
- Unknown
id: 62fff148-278d-497e-8ecd-ad6083231a35
level: low
logsource:
  product: onelogin
  service: onelogin.events
modified: 2021/10/12
product: onelogin
references:
- https://developers.onelogin.com/api-docs/1/events/event-resource
service: onelogin.events
status: experimental
tags:
- attack.impact
title: OneLogin User Assumed Another User
