author: Alejandro Ortuno, oscd.community
category: process_creation
date: 2020/10/06
description: Detects the creation of a new user account. Such accounts may be used
  for persistence that do not require persistent remote access tools to be deployed
  on the system.
detection:
  condition: selection
  selection:
    CommandLine|contains: create
    Image|endswith: /dscl
falsepositives:
- Legitimate administration activities
id: 51719bf5-e4fd-4e44-8ba8-b830e7ac0731
level: low
logsource:
  category: process_creation
  product: macos
modified: 2021/11/27
product: macos
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1136.001/T1136.001.md
status: test
tags:
- attack.t1136.001
- attack.persistence
title: Creation Of A Local User Account
