author: Daniil Yugoslavskiy, oscd.community
category: process_creation
date: 2020/10/10
description: Detects creation of a hidden user account on macOS (UserID < 500) or
  with IsHidden option
detection:
  condition: dscl_create and id_below_500 or dscl_create and (ishidden_option_declaration
    and ishidden_option_confirmation)
  dscl_create:
    CommandLine|contains: create
    Image|endswith: /dscl
  id_below_500:
    CommandLine|contains: UniqueID
    CommandLine|re: ([0-9]|[1-9][0-9]|[1-4][0-9]{2})
  ishidden_option_confirmation:
    CommandLine|contains:
    - 'true'
    - 'yes'
    - '1'
  ishidden_option_declaration:
    CommandLine|contains: IsHidden
falsepositives:
- Legitimate administration activities
id: b22a5b36-2431-493a-8be1-0bae56c28ef3
level: medium
logsource:
  category: process_creation
  product: macos
modified: 2021/11/27
product: macos
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1564.002/T1564.002.md
status: test
tags:
- attack.defense_evasion
- attack.t1564.002
title: Hidden User Creation
