author: Daniil Yugoslavskiy, oscd.community
category: process_creation
date: 2020/10/19
description: Detects disabling security tools
detection:
  condition: (launchctl_unload and security_plists) or disable_gatekeeper
  disable_gatekeeper:
    CommandLine|contains: disable
    Image: /usr/sbin/spctl
  launchctl_unload:
    CommandLine|contains: unload
    Image: /bin/launchctl
  security_plists:
    CommandLine|contains:
    - com.objective-see.lulu.plist
    - com.objective-see.blockblock.plist
    - com.google.santad.plist
    - com.carbonblack.defense.daemon.plist
    - com.carbonblack.daemon.plist
    - at.obdev.littlesnitchd.plist
    - com.tenablesecurity.nessusagent.plist
    - com.opendns.osx.RoamingClientConfigUpdater.plist
    - com.crowdstrike.falcond.plist
    - com.crowdstrike.userdaemon.plist
    - osquery
    - filebeat
    - auditbeat
    - packetbeat
    - td-agent
falsepositives:
- Legitimate activities
id: ff39f1a6-84ac-476f-a1af-37fcdf53d7c0
level: medium
logsource:
  category: process_creation
  product: macos
modified: 2021/11/27
product: macos
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md
status: test
tags:
- attack.defense_evasion
- attack.t1562.001
title: Disable Security Tools
