author: Alejandro Ortuno, oscd.community
category: process_creation
date: 2020/10/22
description: Detects the enumeration of other remote systems.
detection:
  condition: 1 of selection*
  selection_1:
    CommandLine|contains: -a
    Image|endswith: /arp
  selection_2:
    CommandLine|contains:
    - ' 10.'
    - ' 192.168.'
    - ' 172.16.'
    - ' 172.17.'
    - ' 172.18.'
    - ' 172.19.'
    - ' 172.20.'
    - ' 172.21.'
    - ' 172.22.'
    - ' 172.23.'
    - ' 172.24.'
    - ' 172.25.'
    - ' 172.26.'
    - ' 172.27.'
    - ' 172.28.'
    - ' 172.29.'
    - ' 172.30.'
    - ' 172.31.'
    - ' 127.'
    - ' 169.254.'
    Image|endswith: /ping
falsepositives:
- Legitimate administration activities
id: 10227522-8429-47e6-a301-f2b2d014e7ad
level: informational
logsource:
  category: process_creation
  product: macos
modified: 2021/11/27
product: macos
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1018/T1018.md
status: test
tags:
- attack.discovery
- attack.t1018
title: Macos Remote System Discovery
