author: remotephone, oscd.community
category: process_creation
date: 2020/10/13
description: Detects attempts to use system dialog prompts to capture user credentials
detection:
  condition: all of selection*
  selection1:
    Image: /usr/sbin/osascript
  selection2:
    CommandLine|contains|all:
    - -e
    - display
    - dialog
    - answer
  selection3:
    CommandLine|contains:
    - admin
    - administrator
    - authenticate
    - authentication
    - credentials
    - pass
    - password
    - unlock
falsepositives:
- Legitimate administration tools and activities
id: 60f1ce20-484e-41bd-85f4-ac4afec2c541
level: low
logsource:
  category: process_creation
  product: macos
modified: 2021/12/02
product: macos
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1056.002/T1056.002.md
- https://scriptingosx.com/2018/08/user-interaction-from-bash-scripts/
status: experimental
tags:
- attack.credential_access
- attack.t1056.002
title: GUI Input Capture - macOS
