author: Igor Fits, Mikhail Larin, oscd.community
category: process_creation
date: 2020/10/19
description: Detect file time attribute change to hide new or changes to existing
  files
detection:
  condition: selection
  selection:
    CommandLine|contains:
    - -t
    - -acmr
    - -d
    - -r
    Image|endswith: /touch
falsepositives:
- Unknown
id: 88c0f9d8-30a8-4120-bb6b-ebb54abcf2a0
level: medium
logsource:
  category: process_creation
  product: macos
modified: 2021/11/27
product: macos
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1070.006/T1070.006.md
status: test
tags:
- attack.defense_evasion
- attack.t1070.006
title: File Time Attribute Change
