author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
category: network_connection
date: 2020/10/12
description: Detects the use of the Windows Update Client binary (wuauclt.exe) to
  proxy execute code and making a network connections. One could easily make the DLL
  spawn a new process and inject to it to proxy the network connection and bypass
  this rule.
detection:
  condition: selection
  selection:
    winlog.event_data.Image|contains: wuauclt
falsepositives:
- Legitimate use of wuauclt.exe over the network.
id: c649a6c7-cd8c-4a78-9c04-000fc76df954
level: medium
logsource:
  category: network_connection
  product: windows
modified: 2021/11/27
product: windows
references:
- https://dtm.uk/wuauclt/
status: test
tags:
- attack.defense_evasion
- attack.t1218
title: Wuauclt Network Connection
