author: Kiran kumar s, oscd.community
category: network_connection
date: 2020/10/11
description: Detects a possible remote connections to Silenttrinity c2
detection:
  condition: selection and filter
  filter:
    Initiated: 'true'
    winlog.event_data.DestinationPort:
    - '80'
    - '443'
  selection:
    winlog.event_data.Image|endswith: \msbuild.exe
falsepositives:
- Unknown
id: 50e54b8d-ad73-43f8-96a1-5191685b17a4
level: high
logsource:
  category: network_connection
  product: windows
modified: 2021/11/27
product: windows
references:
- https://www.blackhillsinfosec.com/my-first-joyride-with-silenttrinity/
status: test
tags:
- attack.execution
- attack.t1127.001
title: Silenttrinity Stager Msbuild Activity
