author: Florian Roth
category: network_connection
date: 2021/12/06
description: Detects an executable accessing mega.co.nz, which could be a sign of
  forbidden file sharing use of data exfiltration by malicious actors
detection:
  condition: selection
  selection:
    Initiated: 'true'
    winlog.event_data.DestinationHostname|endswith: api.mega.co.nz
falsepositives:
- Legitimate use of mega.nz uploaders and tools
id: fdeebdf0-9f3f-4d08-84a6-4c4d13e39fe4
level: high
logsource:
  category: network_connection
  product: windows
product: windows
references:
- https://megatools.megous.com/
- https://www.mandiant.com/resources/russian-targeting-gov-business
status: experimental
tags:
- attack.exfiltration
- attack.t1567.001
title: Communication To Mega.nz
