author: Florian Roth
category: network_connection
date: 2018/08/30
description: Detects an executable in the Windows folder accessing suspicious domains
detection:
  condition: selection
  selection:
    Initiated: 'true'
    winlog.event_data.DestinationHostname|endswith:
    - dl.dropboxusercontent.com
    - .pastebin.com
    - .githubusercontent.com
    - cdn.discordapp.com/attachments/
    - mediafire.com
    - mega.nz
    - ddns.net
    - .paste.ee
    - .hastebin.com/raw/
    - .ghostbin.co/
    - ufile.io
    - anonfiles.com
    - send.exploit.in
    - transfer.sh
    winlog.event_data.Image|startswith:
    - C:\Windows\
    - C:\Users\Public\
falsepositives:
- Unknown
id: e0f8ab85-0ac9-423b-a73a-81b3c7b1aa97
level: high
logsource:
  category: network_connection
  product: windows
modified: 2022/08/09
product: windows
references:
- https://twitter.com/M_haggis/status/900741347035889665
- https://twitter.com/M_haggis/status/1032799638213066752
- https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/ransomware-hive-conti-avoslocker
status: test
tags:
- attack.lateral_movement
- attack.t1105
title: Microsoft Binary Suspicious Communication Endpoint
