author: frack113
category: network_connection
date: 2022/01/16
description: 'Adversaries may abuse msiexec.exe to proxy execution of malicious payloads.

  Msiexec.exe is the command-line utility for the Windows Installer and is thus commonly
  associated with executing installation packages (.msi)

  '
detection:
  condition: selection
  selection:
    Initiated: 'true'
    winlog.event_data.Image|endswith: \msiexec.exe
falsepositives:
- Legitimate msiexec over networks
id: 8e5e38e4-5350-4c0b-895a-e872ce0dd54f
level: medium
logsource:
  category: network_connection
  product: windows
product: windows
references:
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/msiexec
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218.007/T1218.007.md
status: experimental
tags:
- attack.defense_evasion
- attack.t1218.007
title: Msiexec Initiated Connection
