author: Dmitriy Lifanov, oscd.community
category: network_connection
date: 2019/10/25
description: Detects network connections and DNS queries initiated by Regsvr32.exe
detection:
  condition: selection
  selection:
    winlog.event_data.Image|endswith: \regsvr32.exe
falsepositives:
- Unknown
fields:
- winlog.ComputerName
- winlog.event_data.User
- winlog.event_data.Image
- winlog.event_data.DestinationIp
- winlog.event_data.DestinationPort
id: c7e91a02-d771-4a6d-a700-42587e0b1095
level: high
logsource:
  category: network_connection
  product: windows
modified: 2021/09/21
product: windows
references:
- https://pentestlab.blog/2017/05/11/applocker-bypass-regsvr32/
- https://oddvar.moe/2017/12/13/applocker-case-study-how-insecure-is-it-really-part-1/
status: experimental
tags:
- attack.execution
- attack.t1559.001
- attack.defense_evasion
- attack.t1218.010
title: Regsvr32 Network Activity
