author: Roberto Rodriguez @Cyb3rWard0g
category: network_connection
date: 2019/09/12
description: Detects remote PowerShell connections by monitoring network outbound
  connections to ports 5985 or 5986 from a non-network service account.
detection:
  condition: selection and not 1 of filter*
  filter:
  - winlog.event_data.User|contains:
    - NETWORK SERVICE
    - NETZWERKDIENST
    - SERVIZIO DI RETE
    - SERVICIO DE RED
  - winlog.event_data.User|contains|all:
    - SERVICE R
    - SEAU
  - winlog.event_data.SourceIp|startswith: '0:0:'
  - winlog.event_data.Image:
    - C:\Program Files\Avast Software\Avast\AvastSvc.exe
    - C:\Program Files (x86)\Avast Software\Avast\AvastSvc.exe
  filter_localhost:
    winlog.event_data.DestinationIp: ::1
    winlog.event_data.SourceIp: ::1
  selection:
    Initiated: 'true'
    winlog.event_data.DestinationPort:
    - 5985
    - 5986
falsepositives:
- Legitimate usage of remote PowerShell, e.g. remote administration and monitoring.
- Network Service user name of a not-covered localization
id: c539afac-c12a-46ed-b1bd-5a5567c9f045
level: high
logsource:
  category: network_connection
  product: windows
modified: 2022/08/24
product: windows
references:
- https://threathunterplaybook.com/notebooks/windows/02_execution/WIN-190511223310.html
status: test
tags:
- attack.execution
- attack.t1059.001
- attack.lateral_movement
- attack.t1021.006
title: Remote PowerShell Session (Network)
