author: Florian Roth
category: network_connection
date: 2022/04/29
description: Detects svchost hosting RDP termsvcs communicating to target systems
  on TCP port 80 or 443
detection:
  condition: selection
  selection:
    Initiated: 'true'
    winlog.event_data.DestinationPort:
    - 80
    - 443
    winlog.event_data.Image|endswith: \svchost.exe
    winlog.event_data.SourcePort: 3389
falsepositives:
- Unknown
id: b1e5da3b-ca8e-4adf-915c-9921f3d85481
level: high
logsource:
  category: network_connection
  product: windows
modified: 2022/07/14
product: windows
references:
- https://twitter.com/tekdefense/status/1519711183162556416?s=12&t=OTsHCBkQOTNs1k3USz65Zg
- https://www.mandiant.com/resources/bypassing-network-restrictions-through-rdp-tunneling
status: experimental
tags:
- attack.command_and_control
- attack.t1572
- attack.lateral_movement
- attack.t1021.001
- car.2013-07-002
title: RDP to HTTP or HTTPS Target Ports
