author: Samir Bousseaden
category: network_connection
date: 2019/02/16
description: Detects svchost hosting RDP termsvcs communicating with the loopback
  address and on TCP port 3389
detection:
  condition: selection and selection2
  selection:
    Initiated: 'true'
    winlog.event_data.Image|endswith: \svchost.exe
    winlog.event_data.SourcePort: 3389
  selection2:
  - winlog.event_data.DestinationIp|startswith:
    - '127.'
  - winlog.event_data.DestinationIp:
    - ::1
falsepositives:
- Unknown
id: 5f699bc5-5446-4a4a-a0b7-5ef2885a3eb4
level: high
logsource:
  category: network_connection
  product: windows
modified: 2021/05/11
product: windows
references:
- https://twitter.com/SBousseaden/status/1096148422984384514
status: experimental
tags:
- attack.command_and_control
- attack.t1572
- attack.lateral_movement
- attack.t1021.001
- car.2013-07-002
title: RDP Over Reverse SSH Tunnel
