author: Nasreddine Bencherchali
category: network_connection
date: 2022/08/30
description: Detects suspicious network connection by Cmstp
detection:
  condition: selection
  selection:
    Initiated: 'true'
    winlog.event_data.Image|endswith: \cmstp.exe
falsepositives:
- Unknown
id: efafe0bf-4238-479e-af8f-797bd3490d2d
level: high
logsource:
  category: network_connection
  product: windows
product: windows
references:
- https://web.archive.org/web/20190720093911/http://www.endurant.io/cmstp/detecting-cmstp-enabled-code-execution-and-uac-bypass-with-sysmon/
status: experimental
tags:
- attack.defense_evasion
- attack.t1218.003
title: Cmstp Making Network Connection
