author: Michael Haag (idea), Florian Roth (rule)
category: network_connection
date: 2017/08/24
description: Detects an executable in the Windows folder accessing github.com
detection:
  condition: selection
  selection:
    Initiated: 'true'
    winlog.event_data.DestinationHostname|endswith:
    - .github.com
    - .githubusercontent.com
    winlog.event_data.Image|startswith: C:\Windows\
falsepositives:
- Unknown
- '@subTee in your network'
id: 635dbb88-67b3-4b41-9ea5-a3af2dd88153
level: high
logsource:
  category: network_connection
  product: windows
modified: 2021/11/27
product: windows
references:
- https://twitter.com/M_haggis/status/900741347035889665
- https://twitter.com/M_haggis/status/1032799638213066752
- https://github.com/EmpireProject/Empire/blob/e37fb2eef8ff8f5a0a689f1589f424906fe13055/data/module_source/exfil/Invoke-ExfilDataToGitHub.ps1
status: test
tags:
- attack.lateral_movement
- attack.t1105
- attack.exfiltration
- attack.t1567.001
title: Microsoft Binary Github Communication
