author: Florian Roth
category: network_connection
date: 2022/07/16
description: Detects an executable accessing ngrok.io, which could be a sign of forbidden
  exfiltration of data exfiltration by malicious actors
detection:
  condition: selection
  selection:
    Initiated: 'true'
    winlog.event_data.DestinationHostname|endswith: .ngrok.io
falsepositives:
- Legitimate use of ngrok.io
id: 18249279-932f-45e2-b37a-8925f2597670
level: high
logsource:
  category: network_connection
  product: windows
product: windows
references:
- https://ngrok.com/
- https://www.virustotal.com/gui/file/cca0c1182ac114b44dc52dd2058fcd38611c20bb6b5ad84710681d38212f835a/
status: experimental
tags:
- attack.exfiltration
- attack.t1567.001
title: Communication To Ngrok.Io
