author: elhoim
category: network_connection
date: 2022/04/28
description: Detects suspicious connections from Microsoft Sync Center to non-private
  IPs.
detection:
  condition: selection_mobsync and not filter
  filter:
    winlog.event_data.DestinationIp|startswith:
    - '10.'
    - 192.168.
    - 172.16.
    - 172.17.
    - 172.18.
    - 172.19.
    - 172.20.
    - 172.21.
    - 172.22.
    - 172.23.
    - 172.24.
    - 172.25.
    - 172.26.
    - 172.27.
    - 172.28.
    - 172.29.
    - 172.30.
    - 172.31.
    winlog.event_data.DestinationIsIpv6: 'false'
  selection_mobsync:
    winlog.event_data.Image|endswith: \mobsync.exe
falsepositives:
- Unknown
id: 9f2cc74d-78af-4eb2-bb64-9cd1d292b87b
level: medium
logsource:
  category: network_connection
  product: windows
modified: 2022/06/02
product: windows
references:
- https://redcanary.com/blog/intelligence-insights-november-2021/
status: experimental
tags:
- attack.t1055
- attack.t1218
- attack.execution
- attack.defense_evasion
title: Microsoft Sync Center Suspicious Network Connections
