author: Austin Songer
date: 2021/09/23
description: Detects when an user attached a Lambda layer to an existing function
  to override a library that is in use by the function, where their malicious code
  could utilize the function's IAM role for AWS API calls. This would give an adversary
  access to the privileges associated with the Lambda service role that is attached
  to that function.
detection:
  condition: selection
  selection:
    eventName|startswith: UpdateFunctionConfiguration
    eventSource: lambda.amazonaws.com
falsepositives:
- Lambda Layer being attached may be performed by a system administrator. Verify whether
  the user identity, user agent, and/or hostname should be making changes in your
  environment.
- Lambda Layer being attached from unfamiliar users should be investigated. If known
  behavior is causing false positives, it can be exempted from the rule.
id: 97fbabf8-8e1b-47a2-b7d5-a418d2b95e3d
level: medium
logsource:
  service: cloudtrail
references:
- https://docs.aws.amazon.com/lambda/latest/dg/API_UpdateFunctionConfiguration.html
service: cloudtrail
status: experimental
tags:
- attack.privilege_escalation
title: AWS Attached Malicious Lambda Layer
