author: Austin Songer @austinsonger
date: 2021/08/15
description: Detects when a EFS Fileshare Mount is modified or deleted. An adversary
  breaking any file system using the mount target that is being deleted, which might
  disrupt instances or applications using those mounts.
detection:
  condition: selection
  selection:
    eventName: DeleteMountTarget
    eventSource: elasticfilesystem.amazonaws.com
falsepositives:
- unknown
id: 6a7ba45c-63d8-473e-9736-2eaabff79964
level: medium
logsource:
  service: cloudtrail
references:
- https://docs.aws.amazon.com/efs/latest/ug/API_DeleteMountTarget.html
service: cloudtrail
status: experimental
tags:
- attack.impact
- attack.t1485
title: AWS EFS Fileshare Mount Modified or Deleted
