author: Florian Roth
date: 2017/02/28
description: Detects multiple blocks by the mod_security module (Web Application Firewall)
detection:
  condition: selection | count() > 6
  selection:
  - 'mod_security: Access denied'
  - 'ModSecurity: Access denied'
  - 'mod_security-message: Access denied'
  timeframe: 120m
falsepositives:
- Vulnerability scanners
- Frequent attacks if system faces Internet
id: a06eea10-d932-4aa6-8ba9-186df72c8d23
level: medium
logsource:
  product: linux
  service: modsecurity
product: linux
service: modsecurity
status: stable
title: Multiple Modsecurity Blocks
