category: dns
detection:
  condition: selection | count() by src_ip > 1000
  selection:
    query: '*'
  timeframe: 1m
id: b4163085-4001-46a3-a79a-55d8bbbc7a3a
logsource:
  category: dns
  product: suricata
  service: dns
product: suricata
service: dns
