category: dns
detection:
  condition: selection | sum(question_length) by src_ip > 300000
  selection:
    query: '*'
  timeframe: 1m
id: 0f6c1bf5-70a5-4963-aef9-aab1eefb50bd
logsource:
  category: dns
  product: suricata
  service: dns
product: suricata
service: dns
