author: Brandon George (blog post), Thomas Patzke (rule)
category: dns_query
date: 2021/07/08
description: Detects DNS queries for api.ipify.org not originating from a browser
  process.
detection:
  browser_process:
    winlog.event_data.Image|endswith:
    - \chrome.exe
    - \iexplore.exe
    - \firefox.exe
  condition: dns_request and not browser_process
  dns_request:
    QueryName: api.ipify.org
falsepositives:
- Legitimate usage of ipify API
id: ec82e2a5-81ea-4211-a1f8-37a0286df2c2
level: medium
logsource:
  category: dns_query
  product: windows
product: windows
references:
- https://www.binarydefense.com/analysis-of-hancitor-when-boring-begets-beacon
status: experimental
tags:
- attack.reconnaissance
- attack.t1590
title: Suspicious DNS Query for IPify API
