author: Daniil Yugoslavskiy, oscd.community
category: dns
date: 2019/10/24
description: Extremely high rate of NULL record type DNS requests from host per short
  period of time. Possible result of iodine tool execution
detection:
  condition: selection | count() by src_ip > 50
  selection:
    record_type: 'NULL'
  timeframe: 1m
falsepositives:
- Legitimate high DNS NULL requests rate to domain name which should be added to whitelist
id: 44ae5117-9c44-40cf-9c7c-7edad385ca70
level: medium
logsource:
  category: dns
  product: suricata
  service: dns
modified: 2020/08/27
product: suricata
service: dns
status: experimental
tags:
- attack.exfiltration
- attack.t1048.003
- attack.command_and_control
- attack.t1071.004
title: High NULL Records Requests Rate
