author: Nikita Nazarov, oscd.community
category: pipe_created
date: 2020/05/10
definition: Note that you have to configure logging for PipeEvents in Symson config
description: Detecting use PsExec via Pipe Creation/Access to pipes
detection:
  condition: selection
  selection:
    winlog.event_data.PipeName|startswith:
    - psexec
    - paexec
    - remcom
    - csexec
falsepositives:
- Legitimate Administrator activity
id: 9e77ed63-2ecf-4c7b-b09d-640834882028
level: medium
logsource:
  category: pipe_created
  definition: Note that you have to configure logging for PipeEvents in Symson config
  product: windows
product: windows
references:
- https://drive.google.com/file/d/1lKya3_mLnR3UQuCoiYruO3qgu052_iS_/view
status: experimental
tags:
- attack.lateral_movement
- attack.t1021.002
title: PsExec Pipes Artifacts
