author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
category: pipe_created
date: 2019/09/12
description: Detects execution of PowerShell
detection:
  condition: selection
  selection:
    winlog.event_data.PipeName|startswith: \PSHost
falsepositives:
- Unknown
id: ac7102b4-9e1e-4802-9b4f-17c5524c015c
level: informational
logsource:
  category: pipe_created
  product: windows
product: windows
references:
- https://threathunterplaybook.com/notebooks/windows/02_execution/WIN-190410151110.html
status: experimental
tags:
- attack.execution
- attack.t1059.001
title: T1086 PowerShell Execution
