author: Tom Ueltschi (@c_APT_ure)
category: wmi_event
date: 2019/01/12
description: Detects creation of WMI event subscription persistence method
detection:
  condition: selector
  selector:
    winlog.event_id:
    - 19
    - 20
    - 21
falsepositives:
- exclude legitimate (vetted) use of WMI event subscription in your network
id: 0f06a3a5-6a09-413f-8743-e6cf35561297
level: high
logsource:
  category: wmi_event
  product: windows
product: windows
status: experimental
tags:
- attack.persistence
- attack.t1546.003
title: WMI Event Subscription
