author: Austin Songer @austinsonger
date: 2021/09/03
description: Identifies when a device in azure is no longer managed or compliant
detection:
  condition: selection
  selection:
    properties.message:
    - Device no longer compliant
    - Device no longer managed
falsepositives:
- Administrator may have forgotten to review the device.
id: 542b9912-c01f-4e3f-89a8-014c48cdca7d
level: medium
logsource:
  service: azure.activitylogs
references:
- https://docs.microsoft.com/en-us/azure/active-directory/reports-monitoring/reference-audit-activities#core-directory
service: azure.activitylogs
status: experimental
tags:
- attack.impact
title: Azure Device No Longer Managed or Compliant
