author: Austin Songer @austinsonger
date: 2021/09/03
description: Identifies when a service principal was removed in Azure.
detection:
  condition: selection
  selection:
    properties.message: Remove service principal
falsepositives:
- Service principal being removed may be performed by a system administrator.
- Verify whether the user identity, user agent, and/or hostname should be making changes
  in your environment.
- Service principal removed from unfamiliar users should be investigated. If known
  behavior is causing false positives, it can be exempted from the rule.
id: 448fd1ea-2116-4c62-9cde-a92d120e0f08
level: medium
logsource:
  service: azure.activitylogs
references:
- https://docs.microsoft.com/en-us/azure/active-directory/reports-monitoring/reference-audit-activities#application-proxy
service: azure.activitylogs
status: experimental
tags:
- attack.defense_evasion
title: Azure Service Principal Removed
