author: AlertIQ
date: 2021/10/10
description: "Detect access has been blocked by Conditional Access policies. The access\
  \ policy does not allow token issuance which might be sights\u2248 of unauthorizeed\
  \ login to valid accounts."
detection:
  condition: selection
  selection:
    ResultType: 53003
falsepositives:
- Unknown
id: 9a60e676-26ac-44c3-814b-0c2a8b977adf
level: medium
logsource:
  service: azure.signinlogs
references:
- https://docs.microsoft.com/en-us/azure/active-directory/fundamentals/security-operations-privileged-accounts
service: azure.signinlogs
status: experimental
tags:
- attack.credential_access
- attack.t1110
title: User Access Blocked by Azure Conditional Access
