author: Austin Songer @austinsonger
date: 2021/08/08
description: Identifies when a firewall is created, modified, or deleted.
detection:
  condition: selection
  selection:
    properties.message:
    - MICROSOFT.NETWORK/AZUREFIREWALLS/WRITE
    - MICROSOFT.NETWORK/AZUREFIREWALLS/DELETE
falsepositives:
- Firewall being modified or deleted may be performed by a system administrator. Verify
  whether the user identity, user agent, and/or hostname should be making changes
  in your environment.
- Firewall modified or deleted from unfamiliar users should be investigated. If known
  behavior is causing false positives, it can be exempted from the rule.
id: 512cf937-ea9b-4332-939c-4c2c94baadcd
level: medium
logsource:
  service: azure.activitylogs
references:
- https://docs.microsoft.com/en-us/azure/role-based-access-control/resource-provider-operations
service: azure.activitylogs
status: experimental
tags:
- attack.impact
title: Azure Firewall Modified or Deleted
