author: Austin Songer @austinsonger
date: 2021/08/08
description: Identifies when a Firewall Rule Configuration is Modified or Deleted.
detection:
  condition: selection
  selection:
    properties.message:
    - MICROSOFT.NETWORK/FIREWALLPOLICIES/RULECOLLECTIONGROUPS/WRITE
    - MICROSOFT.NETWORK/FIREWALLPOLICIES/RULECOLLECTIONGROUPS/DELETE
    - MICROSOFT.NETWORK/FIREWALLPOLICIES/RULEGROUPS/WRITE
    - MICROSOFT.NETWORK/FIREWALLPOLICIES/RULEGROUPS/DELETE
falsepositives:
- Firewall Rule Configuration being modified or deleted may be performed by a system
  administrator. Verify whether the user identity, user agent, and/or hostname should
  be making changes in your environment.
- Firewall Rule Configuration modified or deleted from unfamiliar users should be
  investigated. If known behavior is causing false positives, it can be exempted from
  the rule.
id: 2a7d64cf-81fa-4daf-ab1b-ab80b789c067
level: medium
logsource:
  service: azure.activitylogs
references:
- https://docs.microsoft.com/en-us/azure/role-based-access-control/resource-provider-operations
service: azure.activitylogs
status: experimental
tags:
- attack.impact
title: Azure Firewall Rule Configuration Modified or Deleted
