author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research), MSTIC
date: 2021/08/26
description: 'This detection uses AzureActivity logs (Administrative category) to
  identify the creation or update of a server instance in an Azure AD Hybrid health
  AD FS service.

  A threat actor can create a new AD Health ADFS service and create a fake server
  instance to spoof AD FS signing logs. There is no need to compromise an on-prem
  AD FS server.

  This can be done programmatically via HTTP requests to Azure.

  '
detection:
  condition: selection
  selection:
    CategoryValue: Administrative
    OperationNameValue: Microsoft.ADHybridHealthService/services/servicemembers/action
    ResourceId|contains: AdFederationService
    ResourceProviderValue: Microsoft.ADHybridHealthService
falsepositives:
- legitimate AD FS servers added to an AAD Health AD FS service instance
id: 288a39fc-4914-4831-9ada-270e9dc12cb4
level: medium
logsource:
  service: AzureActivity
references:
- https://o365blog.com/post/hybridhealthagent/
service: AzureActivity
status: experimental
tags:
- attack.defense_evasion
- attack.t1578
title: Azure Active Directory Hybrid Health AD FS New Server
