author: Austin Songer
date: 2021/09/06
description: Identifies when an user or application modified the federation settings
  on the domain.
detection:
  condition: selection
  selection:
    properties.message: Set federation settings on domain
falsepositives:
- Federation Settings being modified or deleted may be performed by a system administrator.
- Verify whether the user identity, user agent, and/or hostname should be making changes
  in your environment.
- Federation Settings modified from unfamiliar users should be investigated. If known
  behavior is causing false positives, it can be exempted from the rule.
id: 352a54e1-74ba-4929-9d47-8193d67aba1e
level: medium
logsource:
  service: azure.signinlogs
references:
- https://attack.mitre.org/techniques/T1078
service: azure.signinlogs
status: experimental
tags:
- attack.initial_access
- attack.t1078
title: Azure Domain Federation Settings Modified
