author: Austin Songer @austinsonger
date: 2021/08/07
description: Detects when a Azure Kubernetes Cluster is created or deleted.
detection:
  condition: selection
  selection:
    properties.message:
    - MICROSOFT.KUBERNETES/CONNECTEDCLUSTERS/WRITE
    - MICROSOFT.KUBERNETES/CONNECTEDCLUSTERS/DELETE
falsepositives:
- Kubernetes cluster being created or  deleted may be performed by a system administrator.
  Verify whether the user identity, user agent, and/or hostname should be making changes
  in your environment.
- Kubernetes cluster created or deleted from unfamiliar users should be investigated.
  If known behavior is causing false positives, it can be exempted from the rule.
id: 9541f321-7cba-4b43-80fc-fbd1fb922808
level: low
logsource:
  service: azure.activitylogs
references:
- https://docs.microsoft.com/en-us/azure/role-based-access-control/resource-provider-operations#microsoftkubernetes
- https://www.microsoft.com/security/blog/2021/03/23/secure-containerized-environments-with-updated-threat-matrix-for-kubernetes/
- https://www.microsoft.com/security/blog/2020/04/02/attack-matrix-kubernetes/
- https://medium.com/mitre-engenuity/att-ck-for-containers-now-available-4c2359654bf1
- https://attack.mitre.org/matrices/enterprise/cloud/
service: azure.activitylogs
status: experimental
tags:
- attack.impact
title: Azure Kubernetes Cluster Created or Deleted
