author: AlertIQ
date: 2021/10/10
description: Identifies user account which has been locked because the user tried
  to sign in too many times with an incorrect user ID or password.
detection:
  condition: selection
  selection:
    ResultType: 50053
falsepositives:
- Unknown
id: 2b7d6fc0-71ac-4cf7-8ed1-b5788ee5257a
level: medium
logsource:
  service: azure.signinlogs
references:
- https://docs.microsoft.com/en-us/azure/active-directory/fundamentals/security-operations-privileged-accounts
service: azure.signinlogs
status: experimental
tags:
- attack.credential_access
- attack.t1110
title: Account Lockout
