author: Austin Songer @austinsonger
date: 2021/08/08
description: Identifies when Rule Collections (Application, NAT, and Network) is being
  modified or deleted.
detection:
  condition: selection
  selection:
    properties.message:
    - MICROSOFT.NETWORK/AZUREFIREWALLS/APPLICATIONRULECOLLECTIONS/WRITE
    - MICROSOFT.NETWORK/AZUREFIREWALLS/APPLICATIONRULECOLLECTIONS/DELETE
    - MICROSOFT.NETWORK/AZUREFIREWALLS/NATRULECOLLECTIONS/WRITE
    - MICROSOFT.NETWORK/AZUREFIREWALLS/NATRULECOLLECTIONS/DELETE
    - MICROSOFT.NETWORK/AZUREFIREWALLS/NETWORKRULECOLLECTIONS/WRITE
    - MICROSOFT.NETWORK/AZUREFIREWALLS/NETWORKRULECOLLECTIONS/DELETE
falsepositives:
- Rule Collections (Application, NAT, and Network) being modified or deleted may be
  performed by a system administrator. Verify whether the user identity, user agent,
  and/or hostname should be making changes in your environment.
- Rule Collections (Application, NAT, and Network) modified or deleted from unfamiliar
  users should be investigated. If known behavior is causing false positives, it can
  be exempted from the rule.
id: 025c9fe7-db72-49f9-af0d-31341dd7dd57
level: medium
logsource:
  service: azure.activitylogs
references:
- https://docs.microsoft.com/en-us/azure/role-based-access-control/resource-provider-operations
service: azure.activitylogs
status: experimental
tags:
- attack.impact
title: Azure Firewall Rule Collection Modified or Deleted
