author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
category: registry_event
date: 2020/10/20
description: Detects the volume shadow copy service initialization and processing
  via esentutl. Registry keys such as HKLM\\System\\CurrentControlSet\\Services\\VSS\\Diag\\VolSnap\\Volume
  are captured.
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.TargetObject|contains: System\CurrentControlSet\Services\VSS\Start
  selection:
    winlog.event_data.Image|endswith: esentutl.exe
    winlog.event_data.TargetObject|contains: System\CurrentControlSet\Services\VSS
falsepositives:
- Unknown
id: 5aad0995-46ab-41bd-a9ff-724f41114971
level: high
logsource:
  category: registry_event
  product: windows
modified: 2021/12/08
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1003.002/T1003.002.md#atomic-test-3---esentutlexe-sam-copy
status: experimental
tags:
- attack.credential_access
- attack.t1003.002
title: Esentutl Volume Shadow Copy Service Keys
