author: Andreas Hunkeler (@Karneades)
category: registry_event
date: 2021/06/22
description: Detects the modification of PortProxy registry key which is used for
  port forwarding. For command execution see rule win_netsh_port_fwd.yml.
detection:
  condition: selection_registry
  selection_registry:
    winlog.event_data.TargetObject: HKLM\SYSTEM\CurrentControlSet\Services\PortProxy\v4tov4\tcp
falsepositives:
- WSL2 network bridge PowerShell script used for WSL/Kubernetes/Docker (e.g. https://github.com/microsoft/WSL/issues/4150#issuecomment-504209723)
- Synergy Software KVM (https://symless.com/synergy)
id: a54f842a-3713-4b45-8c84-5f136fdebd3c
level: medium
logsource:
  category: registry_event
  product: windows
modified: 2021/09/13
product: windows
references:
- https://www.fireeye.com/blog/threat-research/2019/01/bypassing-network-restrictions-through-rdp-tunneling.html
- https://adepts.of0x.cc/netsh-portproxy-code/
- https://www.dfirnotes.net/portproxy_detection/
status: experimental
tags:
- attack.lateral_movement
- attack.defense_evasion
- attack.command_and_control
- attack.t1090
title: PortProxy Registry Key
