author: Den Iuzvyk
category: registry_event
date: 2020/06/07
description: Detects Processes accessing the camera and microphone from suspicious
  folder
detection:
  condition: all of selection_*
  selection_1:
    winlog.event_data.TargetObject|contains|all:
    - \Software\Microsoft\Windows\CurrentVersion\CapabilityAccessManager\ConsentStore\
    - \NonPackaged
  selection_2:
    winlog.event_data.TargetObject|contains:
    - microphone
    - webcam
  selection_3:
    winlog.event_data.TargetObject|contains:
    - :#Windows#Temp#
    - :#$Recycle.bin#
    - :#Temp#
    - :#Users#Public#
    - :#Users#Default#
    - :#Users#Desktop#
falsepositives:
- Unlikely, there could be conferencing software running from a Temp folder accessing
  the devices
id: 62120148-6b7a-42be-8b91-271c04e281a3
level: high
logsource:
  category: registry_event
  product: windows
modified: 2021/09/17
product: windows
references:
- https://medium.com/@7a616368/can-you-track-processes-accessing-the-camera-and-microphone-7e6885b37072
status: experimental
tags:
- attack.collection
- attack.t1125
- attack.t1123
title: Suspicious Camera and Microphone Access
