author: omkar72
category: registry_event
date: 2020/10/30
description: Detects potential malicious modification of run keys by winekey or team9
  backdoor
detection:
  condition: selection
  selection:
    winlog.event_data.TargetObject|endswith: Software\Microsoft\Windows\CurrentVersion\Run\Backup
      Mgr
falsepositives:
- Unknown
fields:
- winlog.ComputerName
- winlog.event_data.Image
- winlog.event_data.EventType
- winlog.event_data.TargetObject
id: b98968aa-dbc0-4a9c-ac35-108363cbf8d5
level: high
logsource:
  category: registry_event
  product: windows
modified: 2021/11/27
product: windows
references:
- https://www.fireeye.com/blog/threat-research/2020/10/kegtap-and-singlemalt-with-a-ransomware-chaser.html
status: test
tags:
- attack.persistence
- attack.t1547
title: WINEKEY Registry Modification
