author: Florian Roth
category: registry_event
date: 2019/12/31
description: Detects the use of Windows Credential Editor (WCE)
detection:
  condition: selection
  selection:
    winlog.event_data.TargetObject|contains: Services\WCESERVICE\Start
falsepositives:
- Unknown
id: a6b33c02-8305-488f-8585-03cb2a7763f2
level: critical
logsource:
  category: registry_event
  product: windows
modified: 2021/11/27
product: windows
references:
- https://www.ampliasecurity.com/research/windows-credentials-editor/
status: test
tags:
- attack.credential_access
- attack.t1003.001
- attack.s0005
title: Windows Credential Editor Registry
