author: Florian Roth, Markus Neis, Jonhnathan Ribeiro, Daniil Yugoslavskiy, oscd.community
category: registry_event
date: 2018/03/23
description: Detects Chafer activity attributed to OilRig as reported in Nyotron report
  in March 2018
detection:
  condition: selection_reg1
  selection_reg1:
    winlog.event_data.TargetObject|endswith:
    - SOFTWARE\Microsoft\Windows\CurrentVersion\UMe
    - SOFTWARE\Microsoft\Windows\CurrentVersion\UT
falsepositives:
- Unknown
id: 7bdf2a7c-3acc-4091-9581-0a77dad1c5b5
level: critical
logsource:
  category: registry_event
  product: windows
modified: 2021/09/19
product: windows
references:
- https://nyotron.com/nyotron-discovers-next-generation-oilrig-attacks/
related:
- id: 53ba33fd-3a50-4468-a5ef-c583635cfa92
  type: derived
status: experimental
tags:
- attack.persistence
- attack.g0049
- attack.t1053.005
- attack.s0111
- attack.t1543.003
- attack.defense_evasion
- attack.t1112
- attack.command_and_control
- attack.t1071.004
title: Chafer Activity
