author: frack113
category: registry_event
date: 2021/11/18
description: Detects persistence registry keys for Recycle Bin
detection:
  condition: 1 of selection_*
  selection_create:
    winlog.event_data.EventType: RenameKey
    winlog.event_data.NewName: HKCR\CLSID\{645FF040-5081-101B-9F08-00AA002F954E}\shell\open
  selection_set:
    winlog.event_data.EventType: SetValue
    winlog.event_data.TargetObject: HKCR\CLSID\{645FF040-5081-101B-9F08-00AA002F954E}\shell\open\command\(Default)
falsepositives:
- Unknown
id: 277efb8f-60be-4f10-b4d3-037802f37167
level: high
logsource:
  category: registry_event
  product: windows
product: windows
references:
- https://github.com/vxunderground/VXUG-Papers/blob/751edb8d50f95bd7baa730adf2c6c3bb1b034276/The%20Persistence%20Series/Persistence%20via%20Recycle%20Bin/Persistence_via_Recycle_Bin.pdf
status: experimental
tags:
- attack.persistence
- attack.t1547
title: Registry Persistence Mechanisms in Recycle Bin
