author: Bartlomiej Czyz @bczyz1, oscd.community
category: registry_event
date: 2020/10/11
description: Detects value modification of registry key containing path to binary
  used as screensaver.
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.Image|endswith:
    - \rundll32.exe
    - \explorer.exe
  selection:
    winlog.event_data.TargetObject|endswith: \Control Panel\Desktop\SCRNSAVE.EXE
falsepositives:
- Legitimate modification of screensaver
id: 67a6c006-3fbe-46a7-9074-2ba3b82c3000
level: medium
logsource:
  category: registry_event
  product: windows
modified: 2021/11/27
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1546.002/T1546.002.md
- https://www.welivesecurity.com/wp-content/uploads/2017/08/eset-gazer.pdf
status: test
tags:
- attack.persistence
- attack.privilege_escalation
- attack.t1546.002
title: Path To Screensaver Binary Modified
