author: Florian Roth
category: registry_event
date: 2019/10/16
description: Detects a method to load DLL via LSASS process using an undocumented
  Registry key
detection:
  condition: selection and not 1 of filter_*
  filter_domain_controller:
    winlog.event_data.Details:
    - '%%systemroot%%\system32\ntdsa.dll'
    - '%%systemroot%%\system32\lsadb.dll'
    winlog.event_data.Image: C:\Windows\system32\lsass.exe
  selection:
    winlog.event_data.TargetObject|contains:
    - \CurrentControlSet\Services\NTDS\DirectoryServiceExtPt
    - \CurrentControlSet\Services\NTDS\LsaDbExtPt
falsepositives:
- Unknown
id: b3503044-60ce-4bf4-bbcb-e3db98788823
level: high
logsource:
  category: registry_event
  product: windows
modified: 2022/04/21
product: windows
references:
- https://blog.xpnsec.com/exploring-mimikatz-part-1/
- https://twitter.com/SBousseaden/status/1183745981189427200
status: test
tags:
- attack.execution
- attack.persistence
- attack.t1547.008
title: DLL Load via LSASS
