author: Avneet Singh @v3t0_, oscd.community
category: registry_event
date: 2020/11/15
description: Rule to detect the configuration of Run Once registry key. Configured
  payload can be run by runonce.exe /AlternateShellStartup
detection:
  condition: selection and not 1 of filter_*
  filter_chrome:
    winlog.event_data.Details|endswith: \Installer\chrmstp.exe" --configure-user-settings
      --verbose-logging --system-level
    winlog.event_data.Details|startswith: '"C:\Program Files\Google\Chrome\Application\'
  filter_edge:
    winlog.event_data.Details|endswith: \Installer\setup.exe" --configure-user-settings
      --verbose-logging --system-level --msedge --channel=stable
    winlog.event_data.Details|startswith:
    - '"C:\Program Files (x86)\Microsoft\Edge\Application\'
    - '"C:\Program Files\Microsoft\Edge\Application\'
  selection:
    winlog.event_data.TargetObject|endswith: \StubPath
    winlog.event_data.TargetObject|startswith: HKLM\SOFTWARE\Microsoft\Active Setup\Installed
      Components
falsepositives:
- Legitimate modification of the registry key by legitimate program
id: c74d7efc-8826-45d9-b8bb-f04fac9e4eff
level: medium
logsource:
  category: registry_event
  product: windows
modified: 2022/04/04
product: windows
references:
- https://twitter.com/pabraeken/status/990717080805789697
- https://lolbas-project.github.io/lolbas/Binaries/Runonce/
status: test
tags:
- attack.defense_evasion
- attack.t1112
title: Run Once Task Configuration in Registry
