author: Christian Burkard
category: registry_event
date: 2021/08/30
description: Detects the shell open key manipulation (exefile and ms-settings) used
  for persistence and the pattern of UAC Bypass using fodhelper.exe, computerdefaults.exe,
  slui.exe via registry keys (e.g. UACMe 33 or 62)
detection:
  condition: selection1 or selection2 or (selection3 and not filter_sel3)
  filter_sel3:
    winlog.event_data.Details: (Empty)
  selection1:
    winlog.event_data.Details|contains: \Software\Classes\{
    winlog.event_data.EventType: SetValue
    winlog.event_data.TargetObject|endswith: Classes\ms-settings\shell\open\command\SymbolicLinkValue
  selection2:
    winlog.event_data.TargetObject|endswith: Classes\ms-settings\shell\open\command\DelegateExecute
  selection3:
    winlog.event_data.EventType: SetValue
    winlog.event_data.TargetObject|endswith:
    - Classes\ms-settings\shell\open\command\(Default)
    - Classes\exefile\shell\open\command\(Default)
falsepositives:
- Unknown
id: 152f3630-77c1-4284-bcc0-4cc68ab2f6e7
level: high
logsource:
  category: registry_event
  product: windows
modified: 2022/01/13
product: windows
references:
- https://github.com/hfiref0x/UACME
- https://winscripting.blog/2017/05/12/first-entry-welcome-and-uac-bypass/
- https://github.com/RhinoSecurityLabs/Aggressor-Scripts/tree/master/UACBypass
- https://tria.ge/211119-gs7rtshcfr/behavioral2 [Lokibot sample from Nov 2021]
status: experimental
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1548.002
- attack.t1546.001
title: Shell Open Registry Keys Manipulation
