author: Christian Burkard
category: registry_event
date: 2021/05/03
description: Sysmon registry detection of a local hidden user account.
detection:
  condition: selection
  selection:
    winlog.event_data.Image|endswith: \lsass.exe
    winlog.event_data.TargetObject|contains: \SAM\SAM\Domains\Account\Users\Names\
    winlog.event_data.TargetObject|endswith: $
falsepositives:
- Unknown
id: 460479f3-80b7-42da-9c43-2cc1d54dbccd
level: high
logsource:
  category: registry_event
  product: windows
modified: 2022/08/05
product: windows
references:
- https://twitter.com/SBousseaden/status/1387530414185664538
status: experimental
tags:
- attack.persistence
- attack.t1136.001
title: Creation of a Local Hidden User Account by Registry
