author: Florian Roth (rule)
date: 2017/03/12
description: Detects suspicious PowerShell invocation command parameters
detection:
  condition: all of them
  encoded:
  - ' -enc '
  - ' -EncodedCommand '
  hidden:
  - ' -w hidden '
  - ' -window hidden '
  - ' -windowstyle hidden '
  noninteractive:
  - ' -noni '
  - ' -noninteractive '
falsepositives:
- Penetration tests
- Very special / sneaky PowerShell scripts
id: 3d304fda-78aa-43ed-975c-d740798a49c1
level: high
logsource:
  product: windows
  service: powershell
product: windows
service: powershell
status: experimental
tags:
- attack.execution
- attack.t1059.001
title: Suspicious PowerShell Invocations - Generic
