author: oscd.community, Natalia Shornikova
date: 2020/10/14
definition: Script block logging must be enabled
description: Detects Execution via runAfterCancelProcess in CL_Mutexverifiers.ps1
  module
detection:
  condition: selection
  selection:
    winlog.event_data.ScriptBlockText|contains|all:
    - CL_Mutexverifiers.ps1
    - runAfterCancelProcess
    winlog.event_id: 4104
falsepositives:
- Unknown
id: 39776c99-1c7b-4ba0-b5aa-641525eee1a4
level: high
logsource:
  definition: Script block logging must be enabled
  product: windows
  service: powershell
modified: 2021/05/21
product: windows
references:
- https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OSScripts/CL_mutexverifiers.yml
- https://twitter.com/pabraeken/status/995111125447577600
service: powershell
status: experimental
tags:
- attack.defense_evasion
- attack.t1216
title: Execution via CL_Mutexverifiers.ps1
