author: Sami Ruohonen
date: 2018/07/24
definition: Script block logging must be enabled
description: Detects writing data into NTFS alternate data streams from powershell.
  Needs Script Block Logging.
detection:
  condition: all of them
  content:
    winlog.event_data.ScriptBlockText|contains:
    - set-content
    - add-content
  event:
    winlog.event_id: 4104
  stream:
    winlog.event_data.ScriptBlockText|contains:
    - -stream
falsepositives:
- unknown
id: 8c521530-5169-495d-a199-0a3a881ad24e
level: high
logsource:
  definition: Script block logging must be enabled
  product: windows
  service: powershell
modified: 2021/08/21
product: windows
references:
- http://www.powertheshell.com/ntfsstreams/
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1564.004/T1564.004.md
service: powershell
status: experimental
tags:
- attack.defense_evasion
- attack.t1564.004
- attack.execution
- attack.t1059.001
title: NTFS Alternate Data Stream
