author: Daniil Yugoslavskiy, oscd.community
date: 2019/10/24
definition: Script block logging must be enabled
description: Dnscat exfiltration tool execution
detection:
  condition: selection
  selection:
    winlog.event_data.ScriptBlockText|contains: Start-Dnscat2
    winlog.event_id: 4104
falsepositives:
- "Legitimate usage of PowerShell Dnscat2 \u2014 DNS Exfiltration tool (unlikely)"
id: a6d67db4-6220-436d-8afc-f3842fe05d43
level: critical
logsource:
  definition: Script block logging must be enabled
  product: windows
  service: powershell
modified: 2020/08/24
product: windows
service: powershell
status: experimental
tags:
- attack.exfiltration
- attack.t1048
- attack.execution
- attack.t1059.001
title: Dnscat Execution
