author: Nikita Nazarov, oscd.community
date: 2020/10/12
definition: Script block logging must be enabled for 4104, Module Logging must be
  enable for 4103
description: Detects Obfuscated Powershell via Stdin in Scripts
detection:
  condition: 1 of them
  selection_1:
    winlog.event_data.ScriptBlockText|re: (?i).*(set).*&&\s?set.*(environment|invoke|\${?input).*&&.*"
    winlog.event_id: 4104
  selection_2:
    Payload|re: (?i).*(set).*&&\s?set.*(environment|invoke|\${?input).*&&.*"
    winlog.event_id: 4103
falsepositives:
- Unknown
id: 86b896ba-ffa1-4fea-83e3-ee28a4c915c7
level: high
logsource:
  definition: Script block logging must be enabled for 4104, Module Logging must be
    enable for 4103
  product: windows
  service: powershell
product: windows
references:
- https://github.com/Neo23x0/sigma/issues/1009
service: powershell
status: experimental
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
title: Invoke-Obfuscation Via Stdin
