author: Daniel Bohannon (@Mandiant/@FireEye), oscd.community
date: 2019/11/08
definition: Script block logging must be enabled for 4104, Module Logging must be
  enabled for 4103
description: "Detects all variations of obfuscated powershell IEX invocation code\
  \ generated by Invoke-Obfuscation framework from the following code block \u2014\
  \ https://github.com/danielbohannon/Invoke-Obfuscation/blob/master/Out-ObfuscatedStringCommand.ps1#L873-L888"
detection:
  condition: ( selection_1 and selection_2 ) or ( selection_3 and selection_4 )
  selection_1:
    winlog.event_id: 4104
  selection_2:
  - winlog.event_data.ScriptBlockText|re: \$PSHome\[\s*\d{1,3}\s*\]\s*\+\s*\$PSHome\[
  - winlog.event_data.ScriptBlockText|re: \$ShellId\[\s*\d{1,3}\s*\]\s*\+\s*\$ShellId\[
  - winlog.event_data.ScriptBlockText|re: \$env:Public\[\s*\d{1,3}\s*\]\s*\+\s*\$env:Public\[
  - winlog.event_data.ScriptBlockText|re: \$env:ComSpec\[(\s*\d{1,3}\s*,){2}
  - winlog.event_data.ScriptBlockText|re: \\\\*mdr\\\\*\W\s*\)\.Name
  - winlog.event_data.ScriptBlockText|re: \$VerbosePreference\.ToString\(
  - winlog.event_data.ScriptBlockText|re: \String\]\s*\$VerbosePreference
  selection_3:
    winlog.event_id: 4103
  selection_4:
  - Payload|re: \$PSHome\[\s*\d{1,3}\s*\]\s*\+\s*\$PSHome\[
  - Payload|re: \$ShellId\[\s*\d{1,3}\s*\]\s*\+\s*\$ShellId\[
  - Payload|re: \$env:Public\[\s*\d{1,3}\s*\]\s*\+\s*\$env:Public\[
  - Payload|re: \$env:ComSpec\[(\s*\d{1,3}\s*,){2}
  - Payload|re: \\\\*mdr\\\\*\W\s*\)\.Name
  - Payload|re: \$VerbosePreference\.ToString\(
  - Payload|re: \String\]\s*\$VerbosePreference
falsepositives:
- Unknown
id: 1b9dc62e-6e9e-42a3-8990-94d7a10007f7
level: high
logsource:
  definition: Script block logging must be enabled for 4104, Module Logging must be
    enabled for 4103
  product: windows
  service: powershell
modified: 2020/08/24
product: windows
service: powershell
status: experimental
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
title: Invoke-Obfuscation Obfuscated IEX Invocation
