author: Sean Metcalf (source), Florian Roth (rule)
date: 2017/03/05
definition: Script block logging must be enabled
description: Detects the use of PSAttack PowerShell hack tool
detection:
  condition: selection
  selection:
    winlog.event_data.ScriptBlockText|contains: PS ATTACK!!!
    winlog.event_id: 4104
falsepositives:
- Pentesters
id: b7ec41a4-042c-4f31-a5db-d0fcde9fa5c5
level: high
logsource:
  definition: Script block logging must be enabled
  product: windows
  service: powershell
modified: 2021/08/21
product: windows
references:
- https://adsecurity.org/?p=2921
service: powershell
status: experimental
tags:
- attack.execution
- attack.t1059.001
title: PowerShell PSAttack
