author: oscd.community, Natalia Shornikova
date: 2020/10/14
definition: Script block logging must be enabled
description: Detects Execution via SyncInvoke in CL_Invocation.ps1 module
detection:
  condition: selection2 | count(ScriptBlockText) by Computer > 2
  selection2:
    winlog.event_data.ScriptBlockText|contains:
    - CL_Invocation.ps1
    - SyncInvoke
    winlog.event_id: 4104
falsepositives:
- Unknown
id: f588e69b-0750-46bb-8f87-0e9320d57536
level: high
logsource:
  definition: Script block logging must be enabled
  product: windows
  service: powershell
modified: 2021/05/21
product: windows
references:
- https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OSScripts/Cl_invocation.yml
- https://twitter.com/bohops/status/948061991012327424
service: powershell
status: experimental
tags:
- attack.defense_evasion
- attack.t1216
title: Execution via CL_Invocation.ps1 (2 Lines)
