author: oscd.community, @redcanary, Zach Stanford @svch0st
date: 2020/10/08
definition: Script block logging must be enabled
description: Detects when when a mounted share is removed. Adversaries may remove
  share connections that are no longer useful in order to clean up traces of their
  operation
detection:
  condition: selection
  selection:
    winlog.event_data.ScriptBlockText|contains:
    - Remove-SmbShare
    - Remove-FileShare
    winlog.event_id: 4104
falsepositives:
- Administrators or Power users may remove their shares via cmd line
id: 66a4d409-451b-4151-94f4-a55d559c49b0
level: medium
logsource:
  definition: Script block logging must be enabled
  product: windows
  service: powershell
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1070.005/T1070.005.md
service: powershell
status: experimental
tags:
- attack.defense_evasion
- attack.t1070.005
title: PowerShell Deleted Mounted Share
