author: Jonathan Cheong, oscd.community
date: 2020/10/15
definition: Script block logging must be enabled for 4104, Module Logging must be
  enabled for 4103
description: Detects Obfuscated use of stdin to execute PowerShell
detection:
  condition: 1 of them
  selection_1:
    winlog.event_data.ScriptBlockText|re: .*cmd.{0,5}(?:\/c|\/r).+powershell.+(?:\$\{?input\}?|noexit).+\"
    winlog.event_id: 4104
  selection_2:
    Payload|re: .*cmd.{0,5}(?:\/c|\/r).+powershell.+(?:\$\{?input\}?|noexit).+\"
    winlog.event_id: 4103
falsepositives:
- Unknown
id: 779c8c12-0eb1-11eb-adc1-0242ac120002
level: high
logsource:
  definition: Script block logging must be enabled for 4104, Module Logging must be
    enabled for 4103
  product: windows
  service: powershell
product: windows
references:
- https://github.com/Neo23x0/sigma/issues/1009
service: powershell
status: experimental
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
title: Invoke-Obfuscation STDIN+ Launcher
