author: Timur Zinniatullin, oscd.community
date: 2019/10/21
definition: Script block logging must be enabled
description: An adversary may compress data (e.g., sensitive documents) that is collected
  prior to exfiltration in order to make it portable and minimize the amount of data
  sent over the network.
detection:
  condition: selection
  selection:
    winlog.event_data.ScriptBlockText|contains|all:
    - -Recurse
    - '|'
    - Compress-Archive
    winlog.event_id: 4104
falsepositives:
- Highly likely if archive operations are done via PowerShell.
id: 6dc5d284-69ea-42cf-9311-fb1c3932a69a
level: low
logsource:
  definition: Script block logging must be enabled
  product: windows
  service: powershell
modified: 2021/07/06
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1560/T1560.md
service: powershell
status: experimental
tags:
- attack.exfiltration
- attack.t1560
title: Data Compressed - PowerShell
