author: frack113
date: 2021/08/23
definition: EnableScriptBlockLogging must be set to enable
description: Adversaries may attempt to gather information about attached peripheral
  devices and components connected to a computer system.
detection:
  condition: selection
  selection:
    winlog.event_data.ScriptBlockText|contains: Win32_PnPEntity
    winlog.event_id: 4104
falsepositives:
- admin script
id: b26647de-4feb-4283-af6b-6117661283c5
level: low
logsource:
  definition: EnableScriptBlockLogging must be set to enable
  product: windows
  service: powershell
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1120/T1120.md
service: powershell
status: experimental
tags:
- attack.discovery
- attack.t1120
title: Powershell Suspicious Win32_PnPEntity
