definition: fields have to be extract from event
detection:
  condition: downloadfile or downloadstring
  downloadfile:
    HostApplication|contains|all:
    - System.Net.WebClient
    - .DownloadFile(
    winlog.event_id: 400
  downloadstring:
    HostApplication|contains|all:
    - System.Net.WebClient
    - .DownloadString(
    winlog.event_id: 400
id: 3236fcd0-b7e3-4433-b4f8-86ad61a9af2d
logsource:
  definition: fields have to be extract from event
  product: windows
  service: powershell-classic
product: windows
service: powershell-classic
