definition: fields have to be extract from event
detection:
  condition: selection
  selection:
    HostApplication|contains:
    - 'powercat '
    - powercat.ps1
    winlog.event_id: 400
id: c5b20776-639a-49bf-94c7-84f912b91c15
logsource:
  definition: fields have to be extract from event
  product: windows
  service: powershell-classic
product: windows
service: powershell-classic
