detection:
  condition: webclient and download
  download:
  - .DownloadFile(
  - .DownloadString(
  webclient:
  - System.Net.WebClient
id: 65531a81-a694-4e31-ae04-f8ba5bc33759
logsource:
  product: windows
  service: powershell
product: windows
service: powershell
