author: Nikita Nazarov, oscd.community
date: 2019/10/08
definition: Script block logging must be enabled for 4104, Module Logging must be
  enabled for 4103
description: Detects Obfuscated Powershell via use Rundll32 in Scripts
detection:
  condition: 1 of them
  selection_1:
    winlog.event_data.ScriptBlockText|re: (?i).*&&.*rundll32.*shell32\.dll.*shellexec_rundll.*(value|invoke|comspec|iex).*"
    winlog.event_id: 4104
  selection_2:
    Payload|re: (?i).*&&.*rundll32.*shell32\.dll.*shellexec_rundll.*(value|invoke|comspec|iex).*"
    winlog.event_id: 4103
falsepositives:
- Unknown
id: a5a30a6e-75ca-4233-8b8c-42e0f2037d3b
level: high
logsource:
  definition: Script block logging must be enabled for 4104, Module Logging must be
    enabled for 4103
  product: windows
  service: powershell
product: windows
references:
- https://github.com/Neo23x0/sigma/issues/1009
service: powershell
status: experimental
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
title: Invoke-Obfuscation Via Use Rundll32
