author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2020/05/02
definition: Script block logging must be enabled for 4104, Module Logging must be
  enabled for 4103
description: A General detection for specific decompress commands in PowerShell logs.
  This could be an adversary decompressing files.
detection:
  condition: selection1 or selection2
  selection1:
    winlog.event_data.ScriptBlockText|contains: Expand-Archive
    winlog.event_id: 4104
  selection2:
    Payload|contains: Expand-Archive
    winlog.event_id: 4103
falsepositives:
- unknown
id: 81fbdce6-ee49-485a-908d-1a728c5dcb09
level: informational
logsource:
  definition: Script block logging must be enabled for 4104, Module Logging must be
    enabled for 4103
  product: windows
  service: powershell
product: windows
references:
- https://github.com/OTRF/detection-hackathon-apt29/issues/8
- https://threathunterplaybook.com/evals/apt29/detections/4.A.3_09F29912-8E93-461E-9E89-3F06F6763383.html
service: powershell
status: experimental
tags:
- attack.defense_evasion
- attack.t1140
title: PowerShell Decompress Commands
