author: Timur Zinniatullin, oscd.community
date: 2020/10/18
definition: Script block logging must be enabled for 4104, Module Logging must be
  enabled for 4103
description: Detects Obfuscated Powershell via RUNDLL LAUNCHER
detection:
  condition: 1 of them
  selection_1:
    winlog.event_data.ScriptBlockText|re: (?i).*rundll32(?:\.exe)?(?:\s+)?shell32\.dll.*shellexec_rundll.*powershell.*\"
    winlog.event_id: 4104
  selection_2:
    Payload|re: (?i).*rundll32(?:\.exe)?(?:\s+)?shell32\.dll.*shellexec_rundll.*powershell.*\"
    winlog.event_id: 4103
falsepositives:
- Unknown
id: e6cb92b4-b470-4eb8-8a9d-d63e8583aae0
level: medium
logsource:
  definition: Script block logging must be enabled for 4104, Module Logging must be
    enabled for 4103
  product: windows
  service: powershell
product: windows
references:
- https://github.com/Neo23x0/sigma/issues/1009
service: powershell
status: experimental
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
title: Invoke-Obfuscation RUNDLL LAUNCHER
