author: Timur Zinniatullin, oscd.community
date: 2019/10/21
definition: Script block logging must be enabled
description: Winlogon.exe is a Windows component responsible for actions at logon/logoff
  as well as the secure attention sequence (SAS) triggered by Ctrl-Alt-Delete. Registry
  entries in HKLM\Software[Wow6432Node]Microsoft\Windows NT\CurrentVersion\Winlogon\
  and HKCU\Software\Microsoft\Windows NT\CurrentVersion\Winlogon\ are used to manage
  additional helper programs and functionalities that support Winlogon. Malicious
  modifications to these Registry keys may cause Winlogon to load and execute malicious
  DLLs and/or executables.
detection:
  condition: selection and selection2
  selection:
    winlog.event_data.ScriptBlockText|contains: CurrentVersion\Winlogon
    winlog.event_id: 4104
  selection2:
    winlog.event_data.ScriptBlockText|contains:
    - Set-ItemProperty
    - New-Item
falsepositives:
- Unknown
id: 851c506b-6b7c-4ce2-8802-c703009d03c0
level: medium
logsource:
  definition: Script block logging must be enabled
  product: windows
  service: powershell
modified: 2020/12/01
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1547.004/T1547.004.md
service: powershell
status: experimental
tags:
- attack.persistence
- attack.t1547.004
title: Winlogon Helper DLL
