author: Bartlomiej Czyz @bczyz1, oscd.community
date: 2020/10/10
definition: Script block logging must be enabled
description: Detects Exfiltration Over Alternative Protocol - ICMP. Adversaries may
  steal data by exfiltrating it over an un-encrypted network protocol other than that
  of the existing command and control channel.
detection:
  condition: selection
  selection:
    winlog.event_data.ScriptBlockText|contains|all:
    - New-Object
    - System.Net.NetworkInformation.Ping
    - .Send(
    winlog.event_id: 4104
falsepositives:
- Legitimate usage of System.Net.NetworkInformation.Ping class
id: 4c4af3cd-2115-479c-8193-6b8bfce9001c
level: medium
logsource:
  definition: Script block logging must be enabled
  product: windows
  service: powershell
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1048.003/T1048.003.md#atomic-test-2---exfiltration-over-alternative-protocol---icmp
service: powershell
status: experimental
tags:
- attack.exfiltration
- attack.t1048.003
title: PowerShell ICMP Exfiltration
