author: Florian Roth (rule), Lee Holmes (idea), Harish Segar (improvements)
date: 2017/03/22
definition: fields have to be extract from event
description: Detects PowerShell downgrade attack by comparing the host versions with
  the actually used engine version 2.0
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.HostVersion|startswith: '2.'
  selection:
    winlog.event_data.EngineVersion|startswith: '2.'
    winlog.event_id: 400
falsepositives:
- Penetration Test
- Unknown
id: 6331d09b-4785-4c13-980f-f96661356249
level: medium
logsource:
  definition: fields have to be extract from event
  product: windows
  service: powershell-classic
product: windows
references:
- http://www.leeholmes.com/blog/2017/03/17/detecting-and-preventing-powershell-downgrade-attacks/
service: powershell-classic
status: experimental
tags:
- attack.defense_evasion
- attack.execution
- attack.t1059.001
title: PowerShell Downgrade Attack
