definition: fields have to be extract from event
detection:
  condition: selection
  selection:
    HostApplication|contains: wsmprovhost.exe
    HostName: ServerRemoteHost
    winlog.event_id: 400
id: 60167e5c-84b2-4c95-a7ac-86281f27c445
logsource:
  definition: fields have to be extract from event
  product: windows
  service: powershell-classic
product: windows
service: powershell-classic
