author: Max Altgelt, Tobias Michalski
date: 2021/08/09
definition: Script Block Logging must be enable
description: Detects Commandlet name for PrintNightmare exploitation.
detection:
  condition: selection
  selection:
    winlog.event_data.ScriptBlockText|contains: Invoke-Nightmare
    winlog.event_id: 4104
falsepositives:
- Unknown
id: 6d3f1399-a81c-4409-aff3-1ecfe9330baf
level: high
logsource:
  definition: Script Block Logging must be enable
  product: windows
  service: powershell
modified: 2021/08/31
product: windows
references:
- https://github.com/calebstewart/CVE-2021-1675
service: powershell
status: test
tags:
- attack.privilege_escalation
title: PrintNightmare Powershell Exploitation
