author: Timur Zinniatullin, oscd.community
date: 2020/10/18
definition: Script block logging must be enabled for 4104, Module Logging must be
  enabled for 4103
description: Detects Obfuscated Powershell via COMPRESS OBFUSCATION
detection:
  condition: 1 of them
  selection_1:
    winlog.event_data.ScriptBlockText|re: (?i).*new-object.*(?:system\.io\.compression\.deflatestream|system\.io\.streamreader).*text\.encoding\]::ascii.*readtoend
    winlog.event_id: 4104
  selection_2:
    Payload|re: (?i).*new-object.*(?:system\.io\.compression\.deflatestream|system\.io\.streamreader).*text\.encoding\]::ascii.*readtoend
    winlog.event_id: 4103
falsepositives:
- unknown
id: 20e5497e-331c-4cd5-8d36-935f6e2a9a07
level: medium
logsource:
  definition: Script block logging must be enabled for 4104, Module Logging must be
    enabled for 4103
  product: windows
  service: powershell
product: windows
references:
- https://github.com/Neo23x0/sigma/issues/1009
service: powershell
status: experimental
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
title: Invoke-Obfuscation COMPRESS OBFUSCATION
