author: John Lambert (idea), Florian Roth (rule)
date: 2017/04/09
definition: Script block logging must be enabled
description: Detects PowerShell calling a credential prompt
detection:
  condition: selection
  selection:
    winlog.event_data.ScriptBlockText|contains: PromptForCredential
    winlog.event_id: 4104
falsepositives:
- Unknown
id: ca8b77a9-d499-4095-b793-5d5f330d450e
level: high
logsource:
  definition: Script block logging must be enabled
  product: windows
  service: powershell
modified: 2021/08/04
product: windows
references:
- https://twitter.com/JohnLaTwC/status/850381440629981184
- https://t.co/ezOTGy1a1G
service: powershell
status: experimental
tags:
- attack.credential_access
- attack.execution
- attack.t1059.001
title: PowerShell Credential Prompt
