author: Max Altgelt, Tobias Michalski
date: 2021/08/09
definition: Script Block Logging must be enable
description: Detects Commandlet names from ShellIntel exploitation scripts.
detection:
  condition: selection
  selection:
    winlog.event_data.ScriptBlockText|contains:
    - Invoke-SMBAutoBrute
    - Invoke-GPOLinks
    - Out-Minidump
    - Invoke-Potato
    winlog.event_id: 4104
falsepositives:
- Unknown
id: 402e1e1d-ad59-47b6-bf80-1ee44985b3a7
level: high
logsource:
  definition: Script Block Logging must be enable
  product: windows
  service: powershell
modified: 2021/08/21
product: windows
references:
- https://github.com/Shellntel/scripts/
service: powershell
status: experimental
tags:
- attack.execution
- attack.t1059.001
title: Malicious ShellIntel PowerShell Commandlets
