definition: Module Logging must be enable
detection:
  condition: selection
  selection:
    ContextInfo|contains:
    - 'powercat '
    - powercat.ps1
    winlog.event_id: 4103
id: bf7286e7-c0be-460b-a7e8-5b2e07ecc2f2
logsource:
  definition: Module Logging must be enable
  product: windows
  service: powershell
product: windows
service: powershell
