author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2020/05/02
definition: Script block logging must be enabled for 4104, Module Logging must be
  enabled for 4103
description: A General detection for the Get-Clipboard commands in PowerShell logs.
  This could be an adversary capturing clipboard contents.
detection:
  condition: selection1 or selection2
  selection1:
    winlog.event_data.ScriptBlockText|contains: Get-Clipboard
    winlog.event_id: 4104
  selection2:
    Payload|contains: Get-Clipboard
    winlog.event_id: 4103
falsepositives:
- unknown
id: 5486f63a-aa4c-488d-9a61-c9192853099f
level: medium
logsource:
  definition: Script block logging must be enabled for 4104, Module Logging must be
    enabled for 4103
  product: windows
  service: powershell
product: windows
references:
- https://github.com/OTRF/detection-hackathon-apt29/issues/16
- https://threathunterplaybook.com/evals/apt29/detections/7.A.2_F4609F7E-C4DB-4327-91D4-59A58C962A02.html
service: powershell
status: experimental
tags:
- attack.collection
- attack.t1115
title: PowerShell Get Clipboard
