author: frack113
date: 2021/07/28
definition: Script block logging must be enabled
description: Once established within a system or network, an adversary may use automated
  techniques for collecting internal data.
detection:
  condition: all of them
  selection_cmd:
    winlog.event_data.ScriptBlockText|contains|all:
    - Get-ChildItem
    - ' -Recurse '
    - ' -Include '
  selection_eventid:
    winlog.event_id: 4104
  selection_ext:
    winlog.event_data.ScriptBlockText|contains:
    - .doc
    - .docx
    - .xls
    - .xlsx
    - .ppt
    - .pptx
    - .rtf
    - .pdf
    - .txt
falsepositives:
- Unknown
id: c1dda054-d638-4c16-afc8-53e007f3fbc5
level: medium
logsource:
  definition: Script block logging must be enabled
  product: windows
  service: powershell
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1119/T1119.md
service: powershell
status: experimental
tags:
- attack.collection
- attack.t1119
title: Automated Collection Command PowerShell
