definition: Module Logging must be enable and fields have to be extract from event
detection:
  condition: selection
  selection:
    ContextInfo|contains|all:
    - ' = ServerRemoteHost '
    - wsmprovhost.exe
    winlog.event_id: 4103
id: 96b9f619-aa91-478f-bacb-c3e50f8df575
logsource:
  definition: Module Logging must be enable and fields have to be extract from event
  product: windows
  service: powershell
product: windows
service: powershell
