author: frack113
date: 2021/08/18
definition: EnableScriptBlockLogging must be set to enable
description: Adversaries may gain persistence and elevate privileges by executing
  malicious content triggered by PowerShell profiles.
detection:
  condition: selection
  selection:
    winlog.event_data.ScriptBlockText|contains:
    - Start-Process
    - '""'
    winlog.event_data.ScriptBlockText|contains|all:
    - Add-Content
    - $profile
    - -Value
    winlog.event_id: 4104
falsepositives:
- Unknown
id: 05b3e303-faf0-4f4a-9b30-46cc13e69152
level: medium
logsource:
  definition: EnableScriptBlockLogging must be set to enable
  product: windows
  service: powershell
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1546.013/T1546.013.md
service: powershell
status: experimental
tags:
- attack.privilege_escalation
- attack.t1546.013
title: Powershell Trigger Profiles by Add_Content
