author: Ilyas Ochkov, Jonhnathan Ribeiro, Daniil Yugoslavskiy, oscd.community
date: 2019/10/25
definition: 4104 Script block logging must be enabled , 4103 Module Logging must be
  enabled
description: Detects keywords that could indicate clearing PowerShell history
detection:
  condition: selection_1 and ( selection_2 or selection_3 ) or selection_4 and ( selection_5
    or selection_6 )
  selection_1:
    winlog.event_id: 4104
  selection_2:
    winlog.event_data.ScriptBlockText|contains:
    - del
    - Remove-Item
    - rm
    winlog.event_data.ScriptBlockText|contains|all:
    - (Get-PSReadlineOption).HistorySavePath
  selection_3:
    winlog.event_data.ScriptBlockText|contains|all:
    - Set-PSReadlineOption
    - "\u2013HistorySaveStyle"
    - SaveNothing
  selection_4:
    winlog.event_id: 4103
  selection_5:
    Payload|contains:
    - del
    - Remove-Item
    - rm
    Payload|contains|all:
    - (Get-PSReadlineOption).HistorySavePath
  selection_6:
    Payload|contains|all:
    - Set-PSReadlineOption
    - "\u2013HistorySaveStyle"
    - SaveNothing
falsepositives:
- Legitimate PowerShell scripts
id: dfba4ce1-e0ea-495f-986e-97140f31af2d
level: medium
logsource:
  definition: 4104 Script block logging must be enabled , 4103 Module Logging must
    be enabled
  product: windows
  service: powershell
modified: 2020/11/28
product: windows
references:
- https://gist.github.com/hook-s3c/7363a856c3cdbadeb71085147f042c1a
service: powershell
status: experimental
tags:
- attack.defense_evasion
- attack.t1070.003
title: Clear PowerShell History
