detection:
  condition: 1 of them
  selection:
    winlog.event_id:
    - 5001
    - 5010
    - 5012
    - 5101
  selection2:
    winlog.event_data.Details: DWORD (0x00000001)
    winlog.event_data.TargetObject:
    - HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Services\WinDefend
    - HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Windows Defender
    - HKEY_LOCAL_MACHINE\SOFTWARE\Policies\Microsoft\Windows Defender
id: fe34868f-6e0e-4882-81f6-c43aa8f15b62
logsource:
  product: windows
  service: windefend
product: windows
service: windefend
