author: Janantha Marasinghe
date: 2021/04/27
definition: null
description: This event was observed on the target host during lateral movement. The
  process name within the event contains the process spawned post compromise. Account
  Name within the event contains the compromised user account name. This event should
  to be correlated with 4624 and 4688 for further intrusion context.
detection:
  condition: selection
  selection:
    ObjectServer: Security
    winlog.event_data.ObjectName: \Device\ConDrv
    winlog.event_data.ObjectType: File
    winlog.event_id: 4674
falsepositives:
- Penetration tests where lateral movement has occurred. This event will be created
  on the target host.
id: 29d31aee-30f4-4006-85a9-a4a02d65306c
level: high
logsource:
  definition: null
  product: windows
  service: security
product: windows
references:
- https://jpcertcc.github.io/ToolAnalysisResultSheet/details/wmiexec-vbs.htm
- https://www.fireeye.com/blog/threat-research/2017/08/monitoring-windows-console-activity-part-one.html
service: security
status: stable
tags:
- attack.lateral_movement
- attack.execution
- attack.t1021
- attack.t1059
title: Lateral Movement Indicator ConDrv
