author: Bhabesh Raj
date: 2021/07/05
description: Detects block of attempt to disable real time protection of Microsoft
  Defender by tamper protection
detection:
  condition: selection
  selection:
    Value|endswith:
    - \Windows Defender\DisableAntiSpyware = 0x1()
    - \Real-Time Protection\DisableRealtimeMonitoring = (Current)
    winlog.event_id:
    - 5013
falsepositives:
- Administrator actions
id: 49e5bc24-8b86-49f1-b743-535f332c2856
level: critical
logsource:
  product: windows
  service: windefend
product: windows
references:
- https://bhabeshraj.com/post/tampering-with-microsoft-defenders-tamper-protection
service: windefend
status: stable
tags:
- attack.defense_evasion
- attack.t1562.001
title: Microsoft Defender Tamper Protection Trigger
