category: registry_event
detection:
  condition: selection2
  selection2:
    winlog.event_data.TargetObject|contains: \Microsoft\Windows Defender\Exclusions
    winlog.event_id: 13
id: a982fc9c-6333-4ffb-a51d-addb04e8b529
logsource:
  category: registry_event
  product: windows
product: windows
