category: registry_event
detection:
  condition: tamper_registry
  tamper_registry:
    winlog.event_data.Details: DWORD (0x00000001)
    winlog.event_data.EventType: SetValue
    winlog.event_data.TargetObject: HKLM\SOFTWARE\Policies\Microsoft\Windows Defender\DisableAntiSpyware
id: a64e4198-c1c8-46a5-bc9c-324c86455fd4
logsource:
  category: registry_event
  product: windows
product: windows
