definition: WMI Namespaces Auditing and SACL should be configured, EventID 5861 and
  5859 detection requires Windows 10, 2012 and higher
detection:
  condition: (wmi_filter_to_consumer_binding and consumer_keywords) or (wmi_filter_registration)
  consumer_keywords:
  - ActiveScriptEventConsumer
  - CommandLineEventConsumer
  - CommandLineTemplate
  wmi_filter_registration:
    winlog.event_id: 5859
  wmi_filter_to_consumer_binding:
    winlog.event_id: 5861
id: 0b7889b4-5577-4521-a60a-3376ee7f9f7b
logsource:
  definition: WMI Namespaces Auditing and SACL should be configured, EventID 5861
    and 5859 detection requires Windows 10, 2012 and higher
  product: windows
  service: wmi
product: windows
service: wmi
