author: Cian Heasley
date: 2020/08/13
description: Windows Defender logs when the history of detected infections is deleted.
  Log file will contain the message "Windows Defender Antivirus has removed history
  of malware and other potentially unwanted software".
detection:
  condition: selection
  selection:
    winlog.event_data.EventType: 4
    winlog.event_id: 1013
falsepositives:
- Deletion of Defender malware detections history for legitimate reasons
fields:
- winlog.event_id
- winlog.event_data.EventType
id: 2afe6582-e149-11ea-87d0-0242ac130003
level: high
logsource:
  product: windows
  service: windefend
modified: 2021/05/30
product: windows
references:
- https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-antivirus/troubleshoot-microsoft-defender-antivirus
service: windefend
status: experimental
tags:
- attack.defense_evasion
- attack.t1070.001
title: Windows Defender Malware Detection History Deletion
