detection:
  condition: wmi_subscription
  wmi_subscription:
    winlog.event_data.ObjectName|contains: subscription
    winlog.event_data.ObjectType: WMI Namespace
    winlog.event_id: 4662
id: f033f3f3-fd24-4995-97d8-a3bb17550a88
logsource:
  product: windows
  service: security
product: windows
service: security
