author: Christian Burkard
date: 2021/08/27
description: Detects removal of an exported Exchange mailbox which could be to cover
  tracks from ProxyShell exploit
detection:
  command:
  - Remove-MailboxExportRequest
  - ' -Identity '
  - ' -Confirm "False"'
  condition: all of command
falsepositives:
- unknown
id: 09570ae5-889e-43ea-aac0-0e1221fb3d95
level: high
logsource:
  product: windows
  service: msexchange-management
product: windows
references:
- https://github.com/rapid7/metasploit-framework/blob/master/modules/exploits/windows/http/exchange_proxyshell_rce.rb#L430
service: msexchange-management
status: experimental
tags:
- attack.defense_evasion
- attack.t1070
title: Remove Exported Mailbox from Exchange Webserver
