author: toffeebr33k
date: 2021/08/09
description: 'An attacker with the iam:UpdateLoginProfile permission on other users
  can change the password used to login to the AWS console on any user that already
  has a login profile setup.

  With this alert, it is used to detect anyone is changing password on behalf of other
  users.

  '
detection:
  condition: selection_source and not filter
  filter:
    userIdentity.arn|contains: requestParameters.userName
  selection_source:
    eventName: UpdateLoginProfile
    eventSource: iam.amazonaws.com
falsepositives:
- Legit User Account Administration
fields:
- userIdentity.arn
- responseElements.accessKey.userName
- errorCode
- errorMessage
id: 055fb148-60f8-462d-ad16-26926ce050f1
level: high
logsource:
  service: cloudtrail
references:
- https://github.com/RhinoSecurityLabs/AWS-IAM-Privilege-Escalation
service: cloudtrail
status: experimental
tags:
- attack.persistence
- attack.t1098
title: AWS User Login Profile Was Modified
