author: Elastic, Austin Songer @austinsonger
date: 2021/07/22
description: Detects when a request has been made to transfer a Route 53 domain to
  another AWS account.
detection:
  condition: selection
  selection:
    eventName: TransferDomainToAnotherAwsAccount
    eventSource: route53.amazonaws.com
falsepositives:
- A domain may be transferred to another AWS account by a system or network administrator.
  Verify whether the user identity, user agent, and/or hostname should be making changes
  in your environment. Domain transfers from unfamiliar users or hosts should be investigated.
  If known behavior is causing false positives, it can be exempted from the rule.
id: b056de1a-6e6e-4e40-a67e-97c9808cf41b
level: low
logsource:
  service: cloudtrail
references:
- https://github.com/elastic/detection-rules/blob/main/rules/integrations/aws/persistence_route_53_domain_transferred_to_another_account.toml
service: cloudtrail
status: experimental
tags:
- attack.persistence
- attack.credential_access
- attack.t1098
title: AWS Route 53 Domain Transferred to Another Account
