author: Austin Songer @austinsonger
date: 2021/08/15
description: Identifies when sensitive information is re-identified in google Cloud.
detection:
  condition: selection
  selection:
    gcp.audit.method_name: projects.content.reidentify
falsepositives:
- Unknown
id: 234f9f48-904b-4736-a34c-55d23919e4b7
level: medium
logsource:
  service: gcp.audit
references:
- https://cloud.google.com/dlp/docs/reference/rest/v2/projects.content/reidentify
service: gcp.audit
status: experimental
tags:
- attack.impact
- attack.t1565
title: Google Cloud Re-identifies Sensitive Information.
