author: Austin Songer @austinsonger
date: 2021/08/14
description: Identifies when a service account is modified in Google Cloud.
detection:
  condition: selection
  selection:
    gcp.audit.method_name|endswith:
    - .serviceAccounts.patch
    - .serviceAccounts.create
    - .serviceAccounts.update
    - .serviceAccounts.enable
    - .serviceAccounts.undelete
falsepositives:
- Service Account being modified may be performed by a system administrator. Verify
  whether the user identity, user agent, and/or hostname should be making changes
  in your environment.
- Service Account modified from unfamiliar users should be investigated. If known
  behavior is causing false positives, it can be exempted from the rule.
id: 6b67c12e-5e40-47c6-b3b0-1e6b571184cc
level: medium
logsource:
  service: gcp.audit
references:
- https://cloud.google.com/iam/docs/reference/rest/v1/projects.serviceAccounts
service: gcp.audit
status: experimental
tags:
- attack.impact
title: Google Cloud Service Account Modified
