author: Florian Roth
date: 2017/11/09
definition: mapping Provider_Name 'Microsoft-Windows-DriverFrameworks-UserMode/Operational'
description: Detects plugged USB devices
detection:
  condition: selection
  selection:
    winlog.event_id:
    - 2003
    - 2100
    - 2102
falsepositives:
- Legitimate administrative activity
id: 1a4bd6e3-4c6e-405d-a9a3-53a116e341d4
level: low
logsource:
  definition: mapping Provider_Name 'Microsoft-Windows-DriverFrameworks-UserMode/Operational'
  product: windows
  service: driver-framework
modified: 2021/11/30
product: windows
references:
- https://df-stream.com/2014/01/the-windows-7-event-log-and-usb-device/
- https://www.techrepublic.com/article/how-to-track-down-usb-flash-drive-usage-in-windows-10s-event-viewer/
service: driver-framework
status: test
tags:
- attack.initial_access
- attack.t1200
title: USB Device Plugged
