author: Florian Roth
category: dns_query
date: 2021/11/09
description: Detects a program that invoked suspicious DNS queries known from Cobalt
  Strike beacons
detection:
  condition: 1 of selection*
  selection1:
    QueryName|startswith:
    - aaa.stage.
    - post.1
  selection2:
    QueryName|contains: .stage.123456.
falsepositives:
- Unknown
fields:
- winlog.event_data.Image
- winlog.event_data.CommandLine
id: f356a9c4-effd-4608-bbf8-408afd5cd006
level: critical
logsource:
  category: dns_query
  product: windows
product: windows
references:
- https://www.icebrg.io/blog/footprints-of-fin7-tracking-actor-patterns
- https://www.sekoia.io/en/hunting-and-detecting-cobalt-strike/
status: experimental
tags:
- attack.command_and_control
- attack.t1071.004
title: Suspicious Cobalt Strike DNS Beaconing
