author: Florian Roth
category: dns_query
date: 2022/01/30
description: Detects DNS queries to a TeamViewer domain only resolved by a TeamViewer
  client by an image that isn't named TeamViewer (sometimes used by threat actors
  for obfuscation)
detection:
  condition: dns_request and not filter
  dns_request:
    QueryName:
    - taf.teamviewer.com
    - udp.ping.teamviewer.com
  filter:
    winlog.event_data.Image|contains: TeamViewer
falsepositives:
- Unknown binary names of TeamViewer
- Other programs that also lookup the observed domain
id: 778ba9a8-45e4-4b80-8e3e-34a419f0b85e
level: medium
logsource:
  category: dns_query
  product: windows
modified: 2022/02/08
product: windows
references:
- https://www.teamviewer.com/en-us/
status: experimental
tags:
- attack.command_and_control
- attack.t1219
title: Suspicious TeamViewer Domain Access
