author: frack113
category: dns_query
date: 2022/08/20
description: Detect suspicious ldap request from non Windows application
detection:
  condition: dns_request and not 1 of filter_*
  dns_request:
    QueryName|startswith: _ldap.
  filter_defender:
    winlog.event_data.Image|endswith: \MsMpEng.exe
    winlog.event_data.Image|startswith: C:\ProgramData\Microsoft\Windows Defender\Platform\
  filter_unknown:
    winlog.event_data.Image: <unknown process>
  filter_windows:
    winlog.event_data.Image|startswith: C:\Windows\
falsepositives:
- Programs that also lookup the observed domain
id: a21bcd7e-38ec-49ad-b69a-9ea17e69509e
level: medium
logsource:
  category: dns_query
  product: windows
modified: 2022/09/08
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1482/T1482.md
status: experimental
tags:
- attack.discovery
- attack.t1482
title: Suspicious Ldap Domain Access
