author: Dmitriy Lifanov, oscd.community
category: dns_query
date: 2019/10/25
description: Detects network connections and DNS queries initiated by Regsvr32.exe
detection:
  condition: selection
  selection:
    winlog.event_data.Image|endswith: \regsvr32.exe
falsepositives:
- unknown
fields:
- winlog.ComputerName
- winlog.event_data.User
- winlog.event_data.Image
- winlog.event_data.DestinationIp
- winlog.event_data.DestinationPort
id: 36e037c4-c228-4866-b6a3-48eb292b9955
level: high
logsource:
  category: dns_query
  product: windows
modified: 2021/09/21
product: windows
references:
- https://pentestlab.blog/2017/05/11/applocker-bypass-regsvr32/
- https://oddvar.moe/2017/12/13/applocker-case-study-how-insecure-is-it-really-part-1/
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1117/T1117.md
related:
- id: c7e91a02-d771-4a6d-a700-42587e0b1095
  type: derived
status: experimental
tags:
- attack.execution
- attack.t1559.001
- attack.defense_evasion
- attack.t1218.010
title: Regsvr32 Network Activity
