author: Oddvar Moe, Sander Wiebing, oscd.community
category: create_stream_hash
date: 2020/10/07
description: Exports the target Registry key and hides it in the specified alternate
  data stream.
detection:
  condition: selection
  selection:
    winlog.event_data.Image|endswith: \regedit.exe
falsepositives:
- Unknown
fields:
- winlog.event_data.TargetFilename
id: 0d7a9363-af70-4e7b-a3b7-1a176b7fbe84
level: high
logsource:
  category: create_stream_hash
  product: windows
modified: 2021/11/27
product: windows
references:
- https://lolbas-project.github.io/lolbas/Binaries/Regedit/
- https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f
status: test
tags:
- attack.defense_evasion
- attack.t1564.004
title: Exports Registry Key To an Alternate Data Stream
