author: Florian Roth
category: create_stream_hash
date: 2022/08/24
definition: 'Requirements: Sysmon config with Imphash logging activated'
description: Detects the download of suspicious file type from a well-known file and
  paste sharing domain
detection:
  condition: all of selection*
  selection_domain:
    Contents|contains:
    - transfer.sh
    - raw.githubusercontent.com
    - gist.githubusercontent.com
    - pastebin.com
    - cdn.discordapp.com/attachments/
    - mediafire.com
    - mega.nz
    - ddns.net
    - .paste.ee
    - .hastebin.com
    - .ghostbin.co/
    - ufile.io
    - storage.googleapis.com
    - anonfiles.com
    - send.exploit.in
  selection_extension:
    winlog.event_data.TargetFilename|contains:
    - .ps1:Zone
    - .bat:Zone
falsepositives:
- Unknown
fields:
- winlog.event_data.TargetFilename
- winlog.event_data.Image
id: ae02ed70-11aa-4a22-b397-c0d0e8f6ea99
level: medium
logsource:
  category: create_stream_hash
  definition: 'Requirements: Sysmon config with Imphash logging activated'
  product: windows
product: windows
references:
- https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventid=90015
status: experimental
tags:
- attack.defense_evasion
- attack.s0139
- attack.t1564.004
title: Unusual File Download from File Sharing Domain
