author: Nasreddine Bencherchali
category: create_stream_hash
date: 2022/09/07
description: Detects the download of suspicious file type from URLs with IP
detection:
  condition: all of selection*
  selection_domain:
    Contents|contains:
    - ://1
    - ://2
    - ://3
    - ://4
    - ://5
    - ://6
    - ://7
    - ://8
    - ://9
  selection_extension:
    winlog.event_data.TargetFilename|contains:
    - .ps1:Zone
    - .bat:Zone
    - .exe:Zone
    - .vbe:Zone
    - .vbs:Zone
    - .dll:Zone
falsepositives:
- Unknown
id: 025bd229-fd1f-4fdb-97ab-20006e1a5368
level: high
logsource:
  category: create_stream_hash
  product: windows
product: windows
references:
- https://github.com/trustedsec/SysmonCommunityGuide/blob/adcdfee20999f422b974c8d4149bf4c361237db7/chapters/file-stream-creation-hash.md
status: experimental
tags:
- attack.defense_evasion
- attack.t1564.004
title: Unusual File Download from Direct IP Address
