author: Alejandro Ortuno, oscd.community
category: process_creation
date: 2020/10/21
description: Detects execution of AppleScript of the macOS scripting language AppleScript.
detection:
  condition: selection
  selection:
    CommandLine|contains|all:
    - -e
    Image|endswith:
    - /osascript
falsepositives:
- Application installers might contain scripts as part of the installation process.
id: 1bc2e6c5-0885-472b-bed6-be5ea8eace55
level: medium
logsource:
  category: process_creation
  product: macos
product: macos
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1059.002/T1059.002.md
status: experimental
tags:
- attack.execution
- attack.t1059.002
title: MacOS Scripting Interpreter AppleScript
