author: Alejandro Ortuno, oscd.community
category: process_creation
date: 2020/10/21
description: Detects enumeration of local or remote network services.
detection:
  condition: (selection_1 and not filter) or selection_2
  filter:
    CommandLine|contains: l
  selection_1:
    Image|endswith:
    - /nc
    - /netcat
  selection_2:
    Image|endswith:
    - /nmap
    - /telnet
falsepositives:
- Legitimate administration activities
id: 84bae5d4-b518-4ae0-b331-6d4afd34d00f
level: low
logsource:
  category: process_creation
  product: macos
product: macos
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1046/T1046.md
status: experimental
tags:
- attack.discovery
- attack.t1046
title: MacOS Network Service Scanning
