author: remotephone, oscd.community
category: process_creation
date: 2020/10/11
description: Detects deletion of local audit logs
detection:
  condition: selection1 and (selection2 or selection3)
  selection1:
    Image|endswith: /rm
  selection2:
    CommandLine|contains: /var/log
  selection3:
    Commandline|contains|all:
    - /Users/
    - /Library/Logs/
falsepositives:
- Legitimate administration activities
id: acf61bd8-d814-4272-81f0-a7a269aa69aa
level: medium
logsource:
  category: process_creation
  product: macos
modified: 2021/08/14
product: macos
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1070.002/T1070.002.md
status: experimental
tags:
- attack.defense_evasion
- attack.t1070.002
title: Indicator Removal on Host - Clear Mac System Logs
