author: remotephone, oscd.community
category: process_creation
date: 2020/10/06
description: Detects enumeration of local network configuration
detection:
  condition: selection1 or selection2
  selection1:
    Image:
    - /usr/sbin/netstat
    - /sbin/ifconfig
    - /usr/sbin/ipconfig
    - /usr/libexec/ApplicationFirewall/socketfilterfw
    - /usr/sbin/networksetup
    - /usr/sbin/arp
  selection2:
    Commandline|contains|all:
    - read
    - /Library/Preferences/com.apple.alf
    Image: /usr/bin/defaults
falsepositives:
- Legitimate administration activities
id: 58800443-f9fc-4d55-ae0c-98a3966dfb97
level: informational
logsource:
  category: process_creation
  product: macos
product: macos
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1016/T1016.md
status: experimental
tags:
- attack.discovery
- attack.t1016
title: System Network Discovery - macOS
