author: Mikhail Larin, oscd.community
category: process_creation
date: 2020/10/17
description: Detects commandline operations on shell history files
detection:
  condition: selection
  selection:
    CommandLine|contains:
    - .bash_history
    - .zsh_history
    - .zhistory
    - .history
    - .sh_history
    - fish_history
falsepositives:
- Legitimate administrative activity
- Ligitimate software, cleaning hist file
id: 508a9374-ad52-4789-b568-fc358def2c65
level: medium
logsource:
  category: process_creation
  product: macos
product: macos
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1552.003/T1552.003.md
status: experimental
tags:
- attack.credential_access
- attack.t1552.003
title: Suspicious History File Operations
