author: Igor Fits, Mikhail Larin, oscd.community
category: process_creation
date: 2020/10/19
description: Adversaries may shutdown/reboot systems to interrupt access to, or aid
  in the destruction of, those systems.
detection:
  condition: selection
  selection:
    Image|endswith:
    - /shutdown
    - /reboot
    - /halt
falsepositives:
- Legitimate administrative activity
id: 40b1fbe2-18ea-4ee7-be47-0294285811de
level: informational
logsource:
  category: process_creation
  product: macos
product: macos
references:
- hhttps://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1529/T1529.md
status: experimental
tags:
- attack.impact
- attack.t1529
title: System Shutdown/Reboot
