author: Daniil Yugoslavskiy, oscd.community
category: process_creation
date: 2020/10/19
description: Detects usage of system utilities to discover system network connections
detection:
  condition: selection
  selection:
    Image:
    - /usr/bin/who
    - /usr/bin/w
    - /usr/bin/last
    - /usr/sbin/lsof
    - /usr/sbin/netstat
falsepositives:
- Legitimate activities
id: 9a7a0393-2144-4626-9bf1-7c2f5a7321db
level: informational
logsource:
  category: process_creation
  product: macos
product: macos
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1049/T1049.md
status: experimental
tags:
- attack.discovery
- attack.t1049
title: System Network Connections Discovery
