author: Austin Clark
category: accounting
date: 2019/08/12
description: Various protocols maybe used to put data on the device for exfil or infil
detection:
  condition: keywords
  keywords:
  - tftp
  - rcp
  - puts
  - copy
  - configure replace
  - archive tar
falsepositives:
- Generally used to copy configs or IOS images
fields:
- CmdSet
id: 5e51acb2-bcbe-435b-99c6-0e3cd5e2aa59
level: low
logsource:
  category: accounting
  product: cisco
  service: aaa
modified: 2020/09/02
product: cisco
service: aaa
status: experimental
tags:
- attack.collection
- attack.lateral_movement
- attack.command_and_control
- attack.exfiltration
- attack.t1074
- attack.t1105
- attack.t1560.001
title: Cisco Stage Data
