author: Austin Clark
category: accounting
date: 2019/08/12
description: Show when private keys are being exported from the device, or when new
  certificates are installed
detection:
  condition: keywords
  keywords:
  - crypto pki export
  - crypto pki import
  - crypto pki trustpoint
falsepositives:
- Not commonly run by administrators. Also whitelist your known good certificates
fields:
- src
- CmdSet
- User
- Privilege_Level
- Remote_Address
id: 1f978c6a-4415-47fb-aca5-736a44d7ca3d
level: high
logsource:
  category: accounting
  product: cisco
  service: aaa
product: cisco
service: aaa
status: experimental
tags:
- attack.credential_access
- attack.defense_evasion
- attack.t1553.004
- attack.t1552.004
title: Cisco Crypto Commands
