author: Florian Roth
date: 2018/01/23
description: Detects program executions in suspicious non-program folders related
  to malware or hacking activity
detection:
  condition: selection
  selection:
    exe|startswith:
    - /tmp/
    - /var/www/
    - /home/*/public_html/
    - /usr/local/apache2/
    - /usr/local/httpd/
    - /var/apache/
    - /srv/www/
    - /home/httpd/html/
    - /srv/http/
    - /usr/share/nginx/html/
    - /var/lib/pgsql/data/
    - /usr/local/mysql/data/
    - /var/lib/mysql/
    - /var/vsftpd/
    - /etc/bind/
    - /var/named/
    type: SYSCALL
falsepositives:
- Admin activity (especially in /tmp folders)
- Crazy web applications
id: a39d7fa7-3fbd-4dc2-97e1-d87f546b1bbc
level: medium
logsource:
  product: linux
  service: auditd
product: linux
references:
- Internal Research
service: auditd
status: experimental
tags:
- attack.t1587
- attack.t1584
- attack.resource_development
title: Program Executions in Suspicious Folders
