author: Pawel Mazur
date: 2021/09/06
description: Detects adversary creating hidden file or directory, by detecting directories
  or files with . as the first character
detection:
  arguments:
  - a1|contains: /.
  - a1|startswith: .
  - a2|contains: /.
  - a2|startswith: .
  commands:
    a0:
    - mkdir
    - touch
    - vim
    - nano
    - vi
    type: EXECVE
  condition: commands and arguments
falsepositives:
- Unknown
id: d08722cd-3d09-449a-80b4-83ea2d9d4616
level: low
logsource:
  product: linux
  service: auditd
product: linux
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1564.001/T1564.001.md
- https://attack.mitre.org/techniques/T1564/001/
service: auditd
status: experimental
tags:
- attack.defense_evasion
- attack.t1564.001
title: Hidden Files and Directories
