author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2021/09/17
description: Rule to detect the use of the SCX RunAsProvider Invoke_ExecuteShellCommand
  to execute any UNIX/Linux command using the /bin/sh shell. SCXcore, started as the
  Microsoft Operations Manager UNIX/Linux Agent, is now used in a host of products
  including Microsoft Operations Manager. Microsoft Azure, and Microsoft Operations
  Management Suite.
detection:
  condition: selection
  selection:
    SYSCALL: execve
    comm: sh
    cwd: /var/opt/microsoft/scx/tmp
    type: SYSCALL
    uid: '0'
falsepositives:
- Legitimate use of SCX RunAsProvider Invoke_ExecuteShellCommand.
id: 045b5f9c-49f7-4419-a236-9854fb3c827a
level: high
logsource:
  product: linux
  service: auditd
product: linux
references:
- https://www.wiz.io/blog/omigod-critical-vulnerabilities-in-omi-azure
- https://github.com/Azure/Azure-Sentinel/pull/3059
service: auditd
status: experimental
tags:
- attack.privilege_escalation
- attack.initial_access
- attack.execution
- attack.t1068
- attack.t1190
- attack.t1203
title: OMIGOD SCX RunAsProvider ExecuteShellCommand
