author: Pawel Mazur
date: 2021/05/24
description: Detect attempt to enable auditing of TTY input
detection:
  condition: path_events or tty_events
  path_events:
    name:
    - /etc/pam.d/system-auth
    - /etc/pam.d/password-auth
    type: PATH
  tty_events:
    type:
    - TTY
    - USER_TTY
falsepositives:
- Administrative work
id: 49aae26c-450e-448b-911d-b3c13d178dfc
level: high
logsource:
  product: linux
  service: auditd
product: linux
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1056.001/T1056.001.md
- https://attack.mitre.org/techniques/T1003/
- https://linux.die.net/man/8/pam_tty_audit
- https://access.redhat.com/documentation/en-us/red_hat_enterprise_linux/6/html/security_guide/sec-configuring_pam_for_auditing
- https://access.redhat.com/articles/4409591#audit-record-types-2
service: auditd
status: experimental
tags:
- attack.credential_access
- attack.t1003
- attack.t1056.001
title: Linux Keylogging with Pam.d
