author: Marie Euler
date: 2020/05/18
description: Detects suspicious activities as declared by Florian Roth in its 'Best
  Practice Auditd Configuration'. This includes the detection of the following commands;
  wget, curl, base64, nc, netcat, ncat, ssh, socat, wireshark, rawshark, rdesktop,
  nmap. These commands match a few techniques from the tactics "Command and Control",
  including not exhaustively the following; Application Layer Protocol (T1071), Non-Application
  Layer Protocol (T1095), Data Encoding (T1132)
detection:
  condition: selection
  selection:
    key:
    - susp_activity
falsepositives:
- Admin or User activity
id: f7158a64-6204-4d6d-868a-6e6378b467e0
level: medium
logsource:
  product: linux
  service: auditd
product: linux
references:
- https://github.com/Neo23x0/auditd
service: auditd
status: experimental
tags:
- attack.command_and_control
title: Suspicious C2 Activities
