author: E.M. Anhaus (originally from Atomic Blue Detections, Tony Lambert), oscd.community
date: 2019/10/24
description: Identifies modification of ld.so.preload for shared object injection.
  This technique is used by attackers to load arbitrary code into processes.
detection:
  condition: selection
  selection:
    name: /etc/ld.so.preload
    type: PATH
falsepositives:
- Unknown
id: 4b3cb710-5e83-4715-8c45-8b2b5b3e5751
level: high
logsource:
  product: linux
  service: auditd
modified: 2019/11/11
product: linux
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1574.006/T1574.006.md
- https://eqllib.readthedocs.io/en/latest/analytics/fd9b987a-1101-4ed3-bda6-a70300eaf57e.html
service: auditd
status: experimental
tags:
- attack.defense_evasion
- attack.t1574.006
title: Modification of ld.so.preload
