author: Igor Fits, oscd.community
date: 2020/10/15
description: Detection use of the command "split" to split files into parts and possible
  transfer.
detection:
  condition: selection
  selection:
    comm: split
    type: SYSCALL
falsepositives:
- Legitimate administrative activity
id: 2dad0cba-c62a-4a4f-949f-5f6ecd619769
level: low
logsource:
  product: linux
  service: auditd
modified: 2021/11/27
product: linux
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1030/T1030.md
service: auditd
status: test
tags:
- attack.exfiltration
- attack.t1030
title: Split A File Into Pieces
