author: Pawel Mazur
date: 2021/11/18
description: Detects attempts to post the file with the usage of wget utility. The
  adversary can bypass the permission restriction with the misconfigured sudo permission
  for wget utility which could allow them to read files like /etc/shadow.
detection:
  condition: selection
  selection:
    a0: wget
    a1|startswith: --post-file=
    type: EXECVE
falsepositives:
- Legitimate usage of wget utility to post a file
id: cb39d16b-b3b6-4a7a-8222-1cf24b686ffc
level: medium
logsource:
  product: linux
  service: auditd
product: linux
references:
- https://attack.mitre.org/tactics/TA0010/
- https://linux.die.net/man/1/wget
- https://gtfobins.github.io/gtfobins/wget/
service: auditd
status: experimental
tags:
- attack.exfiltration
- attack.t1048.003
title: Data Exfiltration with Wget
