author: Mikhail Larin, oscd.community
date: 2020/10/17
description: Detects commandline operations on shell history files
detection:
  condition: execve and history
  execve:
    type: EXECVE
  history:
  - .bash_history
  - .zsh_history
  - .zhistory
  - .history
  - .sh_history
  - fish_history
falsepositives:
- Legitimate administrative activity
- Legitimate software, cleaning hist file
fields:
- a0
- a1
- a2
- a3
- key
id: eae8ce9f-bde9-47a6-8e79-f20d18419910
level: medium
logsource:
  product: linux
  service: auditd
modified: 2021/11/27
product: linux
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1552.003/T1552.003.md
service: auditd
status: test
tags:
- attack.credential_access
- attack.t1552.003
title: Suspicious History File Operations
