author: "\xD6mer G\xFCnal, oscd.community"
date: 2020/10/08
description: Detects password policy discovery commands
detection:
  condition: selection
  selection:
    name:
    - /etc/pam.d/common-password
    - /etc/security/pwquality.conf
    - /etc/pam.d/system-auth
    - /etc/login.defs
    type: PATH
falsepositives:
- Legitimate administration activities
id: ca94a6db-8106-4737-9ed2-3e3bb826af0a
level: low
logsource:
  product: linux
  service: auditd
modified: 2021/09/14
product: linux
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1201/T1201.md
service: auditd
status: stable
tags:
- attack.discovery
- attack.t1201
title: Password Policy Discovery
