author: Alejandro Ortuno, oscd.community
date: 2020/10/21
definition: Configure these rules https://github.com/Neo23x0/auditd/blob/master/audit.rules#L182-L183
description: Detects enumeration of local or remote network services.
detection:
  condition: selection
  selection:
    exe|endswith:
    - /telnet
    - /nmap
    - /netcat
    - /nc
    key: network_connect_4
    type: SYSCALL
falsepositives:
- Legitimate administration activities
id: 3761e026-f259-44e6-8826-719ed8079408
level: low
logsource:
  definition: Configure these rules https://github.com/Neo23x0/auditd/blob/master/audit.rules#L182-L183
  product: linux
  service: auditd
modified: 2021/09/14
product: linux
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1046/T1046.md
related:
- id: 3e102cd9-a70d-4a7a-9508-403963092f31
  type: derived
service: auditd
status: experimental
tags:
- attack.discovery
- attack.t1046
title: Linux Network Service Scanning
