author: Timur Zinniatullin, oscd.community
date: 2019/10/21
description: An adversary may compress data (e.g., sensitive documents) that is collected
  prior to exfiltration in order to make it portable and minimize the amount of data
  sent over the network.
detection:
  condition: 1 of them
  selection1:
    a0: zip
    type: execve
  selection2:
    a0: gzip
    a1: -f
    type: execve
  selection3:
    a0: tar
    a1|contains: -c
    type: execve
falsepositives:
- Legitimate use of archiving tools by legitimate user.
id: a3b5e3e9-1b49-4119-8b8e-0344a01f21ee
level: low
logsource:
  product: linux
  service: auditd
modified: 2019/11/04
product: linux
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1560.001/T1560.001.md
service: auditd
status: experimental
tags:
- attack.exfiltration
- attack.t1560.001
title: Data Compressed
