author: Pawel Mazur
date: 2021/09/11
description: Detects embeding of files with usage of steghide binary, the adversaries
  may use this technique to prevent the detection of hidden information.
detection:
  Steghide:
    a0: steghide
    a1: embed
    a2:
    - -cf
    - -ef
    a4:
    - -cf
    - -ef
    type: EXECVE
  condition: Steghide
falsepositives:
- None
id: ce446a9e-30b9-4483-8e38-d2c9ad0a2280
level: low
logsource:
  product: linux
  service: auditd
product: linux
references:
- https://attack.mitre.org/techniques/T1027/003/
- https://vitux.com/how-to-hide-confidential-files-in-images-on-debian-using-steganography/
service: auditd
status: experimental
tags:
- attack.defense_evasion
- attack.t1027.003
title: Steganography Hide Files with Steghide
