author: Pawel Mazur
date: 2022/02/03
description: Detects a creation of systemd services which could be used by adversaries
  to execute malicious code.
detection:
  condition: path and 1 of name_*
  name_1:
    name|startswith:
    - /usr/lib/systemd/system/
    - /etc/systemd/system/
  name_2:
    name|contains: /.config/systemd/user/
  path:
    nametype: CREATE
    type: PATH
falsepositives:
- Admin work like legit service installs.
id: 1bac86ba-41aa-4f62-9d6b-405eac99b485
level: medium
logsource:
  product: linux
  service: auditd
modified: 2022/02/06
product: linux
references:
- https://attack.mitre.org/techniques/T1543/002/
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1543.002/T1543.002.md
service: auditd
status: experimental
tags:
- attack.persistence
- attack.t1543.002
title: Systemd Service Creation
