author: Rafal Piasecki
date: 2022/08/10
description: All TCP traffic on particular port from attacker is routed to different
  port. ex. '/sbin/iptables -t nat -D PREROUTING -p tcp -s 192.168.1.1 --dport 22
  -j REDIRECT --to-ports 42392' The traffic looks like encrypted SSH communications
  going to TCP port 22, but in reality is being directed to the shell port once it
  hits the iptables rule for the attacker host only.
detection:
  cmd:
    a0|endswith: iptables
    a1: -t
    a2: nat
    type: EXECVE
  condition: cmd and keywords
  keywords:
  - --to-ports 42
  - --to-ports 43
falsepositives:
- Legitimate ports redirect
id: 70b4156e-50fc-4523-aa50-c9dddf1993fc
level: medium
logsource:
  product: linux
  service: auditd
product: linux
references:
- https://www.sandflysecurity.com/blog/bpfdoor-an-evasive-linux-backdoor-technical-analysis/
- https://www.elastic.co/security-labs/a-peek-behind-the-bpfdoor
service: auditd
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.004
title: Bpfdoor TCP Ports Redirect
