author: frack113
category: registry_delete
date: 2021/06/07
definition: key must be add to the sysmon configuration to works
description: Remove the AMSI Provider registry key in HKLM\Software\Microsoft\AMSI
  to disable AMSI inspection
detection:
  condition: selection
  selection:
    winlog.event_data.EventType: DeleteKey
    winlog.event_data.TargetObject|endswith:
    - '{2781761E-28E0-4109-99FE-B9D127C57AFE}'
    - '{A7C452EF-8E9F-42EB-9F2B-245613CA0DC9}'
falsepositives:
- Unlikely
id: 41d1058a-aea7-4952-9293-29eaaf516465
level: high
logsource:
  category: registry_delete
  definition: key must be add to the sysmon configuration to works
  product: windows
modified: 2022/03/26
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md
- https://seclists.org/fulldisclosure/2020/Mar/45
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001
title: Removal Of Amsi Provider Reg Key
