author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
category: registry_delete
date: 2020/05/02
description: A General detection to trigger for processes removing .*\shell\open\command
  registry keys. Registry keys that might have been used for COM hijacking activities.
detection:
  condition: selection and not 1 of filter_*
  filter_dropbox:
    winlog.event_data.Image|endswith: \Dropbox.exe
    winlog.event_data.TargetObject|startswith: HKCR\Dropbox.
  filter_integrator:
    winlog.event_data.Image: C:\Program Files (x86)\Microsoft Office\root\integration\integrator.exe
  filter_office:
    winlog.event_data.Image|endswith: \OfficeClickToRun.exe
    winlog.event_data.Image|startswith:
    - C:\Program Files\Common Files\Microsoft Shared\ClickToRun\
    - C:\Program Files\Common Files\Microsoft Shared\ClickToRun\Updates\
  filter_svchost:
    winlog.event_data.Image: C:\Windows\system32\svchost.exe
  selection:
    winlog.event_data.EventType: DeleteKey
    winlog.event_data.TargetObject|endswith: \shell\open\command
falsepositives:
- Unknown
id: 96f697b0-b499-4e5d-9908-a67bec11cdb6
level: medium
logsource:
  category: registry_delete
  product: windows
modified: 2022/03/26
product: windows
references:
- https://github.com/OTRF/detection-hackathon-apt29/issues/7
- https://threathunterplaybook.com/evals/apt29/detections/3.C.1_22A46621-7A92-48C1-81BF-B3937EB4FDC3.html
- https://docs.microsoft.com/en-us/windows/win32/shell/launch
- https://docs.microsoft.com/en-us/windows/win32/api/shobjidl_core/nn-shobjidl_core-iexecutecommand
- https://docs.microsoft.com/en-us/windows/win32/shell/shell-and-managed-code
status: test
tags:
- attack.defense_evasion
- attack.t1112
title: Removal of Potential COM Hijacking Registry Keys
