author: '@neu5ron, @Antonlovesdnb, Mike Remen'
date: 2021/08/17
description: "Detects usage of the windows RPC library Encrypting File System Remote\
  \ Protocol (MS-EFSRPC). Variations of this RPC are used within the attack refereed\
  \ to as PetitPotam.\nThe usage of this RPC function should be rare if ever used\
  \ at all.\nThus usage of this function is uncommon enough that any usage of this\
  \ RPC function should warrant further investigation to determine if it is legitimate.\n\
  \ View surrounding logs (within a few minutes before and after) from the Source\
  \ IP to. Logs from from the Source IP would include dce_rpc, smb_mapping, smb_files,\
  \ rdp, ntlm, kerberos, etc..'\n"
detection:
  condition: selection
  selection:
    operation|startswith:
    - Efs
    - efs
falsepositives:
- Uncommon but legitimate windows administrator or software tasks that make use of
  the Encrypting File System RPC Calls. Verify if this is common activity (see description).
fields:
- id.orig_h
- id.resp_h
- id.resp_p
- operation
- endpoint
- named_pipe
- uid
id: 4096842a-8f9f-4d36-92b4-d0b2a62f9b2a
level: medium
logsource:
  product: zeek
  service: dce_rpc
product: zeek
references:
- https://github.com/topotam/PetitPotam/blob/d83ac8f2dd34654628c17490f99106eb128e7d1e/PetitPotam/PetitPotam.cpp
- https://msrc.microsoft.com/update-guide/vulnerability/ADV210003
- https://vx-underground.org/archive/Symantec/windows-vista-network-attack-07-en.pdf
- https://threatpost.com/microsoft-petitpotam-poc/168163/
service: dce_rpc
status: experimental
tags:
- attack.t1557.001
- attack.t1187
title: Potential PetitPotam Attack Via EFS RPC Calls
