author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2020/05/02
description: A General detection for WebDav user-agent being used to PUT files on
  a WebDav network share. This could be an indicator of exfiltration.
detection:
  condition: selection and not filter
  filter:
    id.resp_h:
    - 192.168.0.0/16
    - 172.16.0.0/12
    - 10.0.0.0/8
  selection:
    method: PUT
    user_agent|contains: WebDAV
falsepositives:
- Unknown
id: 705072a5-bb6f-4ced-95b6-ecfa6602090b
level: low
logsource:
  product: zeek
  service: http
modified: 2021/11/27
product: zeek
references:
- https://github.com/OTRF/detection-hackathon-apt29/issues/17
service: http
status: test
tags:
- attack.exfiltration
- attack.t1048.003
title: WebDav Put Request
