author: Samir Bousseaden, @neu5ron
date: 2020/04/02
description: Detects known sensitive file extensions via Zeek
detection:
  condition: selection
  selection:
    name|endswith:
    - .pst
    - .ost
    - .msg
    - .nst
    - .oab
    - .edb
    - .nsf
    - .bak
    - .dmp
    - .kirbi
    - \groups.xml
    - .rdp
falsepositives:
- Help Desk operator doing backup or re-imaging end user machine or backup software
- Users working with these data types or exchanging message files
fields:
- ComputerName
- SubjectDomainName
- SubjectUserName
- RelativeTargetName
id: 286b47ed-f6fe-40b3-b3a8-35129acd43bc
level: medium
logsource:
  product: zeek
  service: smb_files
modified: 2021/11/27
product: zeek
references:
- https://github.com/neo23x0/sigma/blob/d42e87edd741dd646db946f30964f331f92f50e6/rules/windows/builtin/win_susp_raccess_sensitive_fext.yml
service: smb_files
status: test
tags:
- attack.collection
title: Suspicious Access to Sensitive File Extensions - Zeek
