author: Samir Bousseaden, @neu5ron
date: 2020/04/02
description: detects execution of psexec or paexec with renamed service name, this
  rule helps to filter out the noise if psexec is used for legit purposes or if attacker
  uses a different psexec client other than sysinternal one
detection:
  condition: selection1 and not selection2
  selection1:
    name|endswith:
    - -stdin
    - -stdout
    - -stderr
    path|contains|all:
    - \\
    - \IPC$
  selection2:
    name|contains|all:
    - \\
    - \IPC$
    path|startswith: PSEXESVC
falsepositives:
- Unknown
id: f1b3a22a-45e6-4004-afb5-4291f9c21166
level: high
logsource:
  product: zeek
  service: smb_files
modified: 2021/11/27
product: zeek
references:
- https://github.com/neo23x0/sigma/blob/d42e87edd741dd646db946f30964f331f92f50e6/rules/windows/builtin/win_susp_psexec.yml
service: smb_files
status: test
tags:
- attack.lateral_movement
- attack.t1021.002
title: Suspicious PsExec Execution - Zeek
