author: Austin Songer @austinsonger
date: 2021/09/12
description: Detects when unauthorized access to app occurs.
detection:
  condition: selection
  selection:
    displaymessage:
    - User attempted unauthorized access to app
falsepositives:
- User might of believe that they had access.
id: 6cc2b61b-d97e-42ef-a9dd-8aa8dc951657
level: medium
logsource:
  service: okta
modified: 2021/09/22
references:
- https://developer.okta.com/docs/reference/api/system-log/
- https://developer.okta.com/docs/reference/api/event-types/
service: okta
status: experimental
tags:
- attack.impact
title: Okta Unauthorized Access to App
