author: Austin Songer @austinsonger
date: 2021/09/12
description: Detects when an the Administrator role is assigned to an user or group.
detection:
  condition: selection
  selection:
    eventtype:
    - group.privilege.grant
    - user.account.privilege.grant
falsepositives:
- Administrator roles could be assigned to users or group by other admin users.
id: 413d4a81-6c98-4479-9863-014785fd579c
level: medium
logsource:
  service: okta
modified: 2021/09/22
references:
- https://developer.okta.com/docs/reference/api/system-log/
- https://developer.okta.com/docs/reference/api/event-types/
service: okta
status: experimental
tags:
- attack.impact
title: Okta Admin Role Assigned to an User or Group
