author: Austin Songer @austinsonger
date: 2021/09/12
description: Detects when an Policy Rule is Modified or Deleted.
detection:
  condition: selection
  selection:
    eventtype:
    - policy.rule.update
    - policy.rule.delete
falsepositives:
- Unknown
id: 0c97c1d3-4057-45c9-b148-1de94b631931
level: medium
logsource:
  service: okta
modified: 2021/09/22
references:
- https://developer.okta.com/docs/reference/api/system-log/
- https://developer.okta.com/docs/reference/api/event-types/
service: okta
status: experimental
tags:
- attack.impact
title: Okta Policy Rule Modified or Deleted
