author: Florian Roth
date: 2019/01/22
description: Detects an issue in apache logs that reports threading related errors
detection:
  condition: keywords
  keywords:
  - '__pthread_tpp_change_priority: Assertion `new_prio == -1 || (new_prio >= fifo_min_prio
    && new_prio <= fifo_max_prio)'
falsepositives:
- https://bz.apache.org/bugzilla/show_bug.cgi?id=46185
id: e9a2b582-3f6a-48ac-b4a1-6849cdc50b3c
level: medium
logsource:
  product: linux
product: linux
references:
- https://github.com/hannob/apache-uaf/blob/master/README.md
status: experimental
title: Apache Threading Error
