author: Nasreddine Bencherchali
category: file_create
date: 2022/07/05
description: Detects the creation of "ebpfbackdoor" files in both "cron.d" and "sudoers.d"
  directories. Which both are related to the TripleCross persistence method
detection:
  condition: selection
  selection:
    TargetFilename|endswith: ebpfbackdoor
falsepositives:
- Unlikely
id: 1a2ea919-d11d-4d1e-8535-06cda13be20f
level: high
logsource:
  category: file_create
  product: linux
product: linux
references:
- https://github.com/h3xduck/TripleCross/blob/12629558b8b0a27a5488a0b98f1ea7042e76f8ab/apps/deployer.sh
status: experimental
tags:
- attack.persistence
- attack.defense_evasion
- attack.t1053.003
title: Triple Cross eBPF Rootkit Default Persistence
