author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research), MSTIC
category: file_create
date: 2021/10/15
description: Detects creation of cron file or files in Cron directories which could
  indicates potential persistence.
detection:
  condition: 1 of selection*
  selection1:
    TargetFilename|startswith:
    - /etc/cron.d/
    - /etc/cron.daily/
    - /etc/cron.hourly/
    - /etc/cron.monthly/
    - /etc/cron.weekly/
    - /var/spool/cron/crontabs/
  selection2:
    TargetFilename|contains:
    - /etc/cron.allow
    - /etc/cron.deny
    - /etc/crontab
falsepositives:
- Any legitimate cron file.
id: 6c4e2f43-d94d-4ead-b64d-97e53fa2bd05
level: medium
logsource:
  category: file_create
  product: linux
product: linux
references:
- https://github.com/microsoft/MSTIC-Sysmon/blob/f1477c0512b0747c1455283069c21faec758e29d/linux/configs/attack-based/persistence/T1053.003_Cron_Activity.xml
status: experimental
tags:
- attack.persistence
- attack.t1053.003
title: Persistence Via Cron Files
