author: Nasreddine Bencherchali
category: file_create
date: 2022/07/05
description: Detects the creation of the file "rootlog" which is used by the TripleCross
  rootkit as a way to check if the backdoor is already running.
detection:
  condition: selection
  selection:
    TargetFilename: /tmp/rootlog
falsepositives:
- Unlikely
id: c0239255-822c-4630-b7f1-35362bcb8f44
level: high
logsource:
  category: file_create
  product: linux
product: linux
references:
- https://github.com/h3xduck/TripleCross/blob/1f1c3e0958af8ad9f6ebe10ab442e75de33e91de/src/helpers/execve_hijack.c#L33
status: experimental
tags:
- attack.defense_evasion
title: Triple Cross eBPF Rootkit Default LockFile
