author: Nasreddine Bencherchali
category: file_create
date: 2022/07/05
description: Detects creation of sudoers file or files in "sudoers.d" directory which
  can be used a potential method to persiste privileges for a specific user.
detection:
  condition: selection
  selection:
    TargetFilename|startswith: /etc/sudoers.d/
falsepositives:
- Creation of legitimate files in sudoers.d folder part of administrator work
id: ddb26b76-4447-4807-871f-1b035b2bfa5d
level: medium
logsource:
  category: file_create
  product: linux
product: linux
references:
- https://github.com/h3xduck/TripleCross/blob/1f1c3e0958af8ad9f6ebe10ab442e75de33e91de/apps/deployer.sh
status: experimental
tags:
- attack.persistence
- attack.t1053.003
title: Persistence Via Sudoers Files
