author: Bjoern Kimminich
category: application
date: 2017/11/27
description: Detects SQL error messages that indicate probing for an injection attack
detection:
  condition: keywords
  keywords:
  - quoted string not properly terminated
  - You have an error in your SQL syntax
  - Unclosed quotation mark
  - 'near "*": syntax error'
  - SELECTs to the left and right of UNION do not have the same number of result columns
falsepositives:
- Application bugs
id: 8a670c6d-7189-4b1c-8017-a417ca84a086
level: high
logsource:
  category: application
  product: linux
modified: 2020/09/01
product: linux
references:
- http://www.sqlinjection.net/errors
status: experimental
tags:
- attack.initial_access
- attack.t1190
title: Suspicious SQL Error Messages
