author: Thomas Patzke
category: application
date: 2017/08/12
description: Generic rule for SQL exceptions in Python according to PEP 249
detection:
  condition: exceptions
  exceptions:
  - DataError
  - IntegrityError
  - ProgrammingError
  - OperationalError
falsepositives:
- Application bugs
- Penetration testing
id: 19aefed0-ffd4-47dc-a7fc-f8b1425e84f9
level: medium
logsource:
  category: application
  product: linux
modified: 2020/09/01
product: linux
references:
- https://www.python.org/dev/peps/pep-0249/#exceptions
status: stable
tags:
- attack.initial_access
- attack.t1190
title: Python SQL Exceptions
