author: Thomas Patzke
category: application
date: 2017/08/06
description: Detects suspicious Ruby on Rails exceptions that could indicate exploitation
  attempts
detection:
  condition: keywords
  keywords:
  - ActionController::InvalidAuthenticityToken
  - ActionController::InvalidCrossOriginRequest
  - ActionController::MethodNotAllowed
  - ActionController::BadRequest
  - ActionController::ParameterMissing
falsepositives:
- Application bugs
- Penetration testing
id: 0d2c3d4c-4b48-4ac3-8f23-ea845746bb1a
level: medium
logsource:
  category: application
  product: linux
modified: 2020/09/01
product: linux
references:
- http://edgeguides.rubyonrails.org/security.html
- http://guides.rubyonrails.org/action_controller_overview.html
- https://stackoverflow.com/questions/25892194/does-rails-come-with-a-not-authorized-exception
- https://github.com/rails/rails/blob/master/actionpack/lib/action_dispatch/middleware/exception_wrapper.rb
status: stable
tags:
- attack.initial_access
- attack.t1190
title: Ruby on Rails Framework Exceptions
