author: Thomas Patzke
category: application
date: 2017/08/05
description: Detects suspicious Django web application framework exceptions that could
  indicate exploitation attempts
detection:
  condition: keywords
  keywords:
  - SuspiciousOperation
  - DisallowedHost
  - DisallowedModelAdminLookup
  - DisallowedModelAdminToField
  - DisallowedRedirect
  - InvalidSessionKey
  - RequestDataTooBig
  - SuspiciousFileOperation
  - SuspiciousMultipartForm
  - SuspiciousSession
  - TooManyFieldsSent
  - PermissionDenied
falsepositives:
- Application bugs
- Penetration testing
id: fd435618-981e-4a7c-81f8-f78ce480d616
level: medium
logsource:
  category: application
  product: linux
modified: 2020/09/01
product: linux
references:
- https://docs.djangoproject.com/en/1.11/ref/exceptions/
- https://docs.djangoproject.com/en/1.11/topics/logging/#django-security
status: stable
tags:
- attack.initial_access
- attack.t1190
title: Django Framework Exceptions
