author: oscd.community, Natalia Shornikova
date: 2020/10/06
description: Detects Accessing to lsass.exe by Powershell
detection:
  condition: selection
  selection:
    winlog.event_data.SourceImage|endswith: \powershell.exe
    winlog.event_data.TargetImage|endswith: \lsass.exe
    winlog.event_id:
    - 8
    - 10
falsepositives:
- Unknown
id: 3f07b9d1-2082-4c56-9277-613a621983cc
level: high
logsource:
  product: windows
  service: sysmon
modified: 2021/05/24
product: windows
references:
- https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse
service: sysmon
status: experimental
tags:
- attack.credential_access
- attack.t1003.001
title: Accessing WinAPI in PowerShell for Credentials Dumping
