category: image_load
detection:
  condition: selection
  selection:
    winlog.event_data.ImageLoaded: C:\Windows\oci.dll
    winlog.event_data.Image|endswith: msdtc.exe
id: 35a7dc42-bc6f-46e0-9f83-81f8e56c8d4b
logsource:
  category: image_load
  product: windows
product: windows
