category: process_creation
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|re: (?i).*schtasks.*(-|\/)r.*\\\\Application Experience\\\\Microsoft
      Compatibility Appraiser.*
id: f548a603-c9f2-4c89-b511-b089f7e94549
logsource:
  category: process_creation
  product: windows
product: windows
