category: registry_event
detection:
  condition: selection
  selection:
    winlog.event_data.Details|re: .*(.sh|.exe|.dll|.bin|.bat|.cmd|.js|.ps|.vb|.jar|.hta|.msi|.vbs)$
    winlog.event_data.TargetObject|contains:
    - HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Windows NT\CurrentVersion\AppCompatFlags\TelemetryController\
id: 4e8d5fd3-c959-441f-a941-f73d0cdcdca5
logsource:
  category: registry_event
  product: windows
product: windows
