author: Nasreddine Bencherchali, Wietze Beukema (project and research)
category: image_load
date: 2022/08/17
description: Detects DLL sideloading of DLLs that are part of Microsoft Office from
  non standard location
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.ImageLoaded|startswith:
    - C:\Program Files\Microsoft Office\OFFICE
    - C:\Program Files (x86)\Microsoft Office\OFFICE
    - C:\Program Files\Microsoft Office\Root\OFFICE
    - C:\Program Files (x86)\Microsoft Office\Root\OFFICE
  selection:
    winlog.event_data.ImageLoaded|endswith: \outllib.dll
falsepositives:
- Unlikely
id: 829a3bdf-34da-4051-9cf4-8ed221a8ae4f
level: medium
logsource:
  category: image_load
  product: windows
product: windows
references:
- https://hijacklibs.net/
status: experimental
tags:
- attack.defense_evasion
- attack.persistence
- attack.privilege_escalation
- attack.t1574.001
- attack.t1574.002
title: Microsoft Office DLL Sideload
