author: Bhabesh Raj
category: image_load
date: 2022/08/02
description: Detects loading of Microsoft Defender's DLLs by its processes (MpCmdRun
  and NisSrv) from the non-default directory which may be an attempt to sideload arbitrary
  DLL
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.ImageLoaded|startswith:
    - C:\Program Files\Windows Defender\
    - C:\Program Files (x86)\Windows Defender\
    - C:\ProgramData\Microsoft\Windows Defender\Platform\
  selection:
    winlog.event_data.ImageLoaded|endswith: \mpclient.dll
    winlog.event_data.Image|endswith:
    - \MpCmdRun.exe
    - \NisSrv.exe
falsepositives:
- Very unlikely
id: 418dc89a-9808-4b87-b1d7-e5ae0cb6effc
level: high
logsource:
  category: image_load
  product: windows
modified: 2022/08/17
product: windows
references:
- https://www.sentinelone.com/blog/living-off-windows-defender-lockbit-ransomware-sideloads-cobalt-strike-through-microsoft-security-tool
status: experimental
tags:
- attack.defense_evasion
- attack.t1574.002
title: Microsoft Defender Loading DLL from Nondefault Path
