author: Greg (rule)
category: image_load
date: 2022/06/17
description: Detects both of CVE-2022-30190 / Follina and DogWalk vulnerability exploiting
  msdt.exe binary to load sdiageng.dll binary
detection:
  condition: selection
  selection:
    winlog.event_data.ImageLoaded|endswith: \sdiageng.dll
    winlog.event_data.Image|endswith: \msdt.exe
falsepositives:
- Unknown
id: ec8c4047-fad9-416a-8c81-0f479353d7f6
level: high
logsource:
  category: image_load
  product: windows
product: windows
references:
- https://www.securonix.com/blog/detecting-microsoft-msdt-dogwalk/
status: experimental
tags:
- attack.defense_evasion
- attack.t1202
- cve.2022.30190
title: MSDT.exe Loading Diagnostic Library
