author: Markus Neis, @markus_neis
category: image_load
date: 2021/07/07
description: Detects the image load of vss_ps.dll by uncommon executables using OriginalFileName
  datapoint
detection:
  condition: selection and not 1 of filter_*
  filter_legit:
    winlog.event_data.Image|contains: c:\windows\
    winlog.event_data.Image|endswith:
    - \svchost.exe
    - \msiexec.exe
    - \vssvc.exe
    - \srtasks.exe
    - \tiworker.exe
    - \dllhost.exe
    - \searchindexer.exe
    - \dismhost.exe
    - \taskhostw.exe
    - \clussvc.exe
    - \thor64.exe
    - \thor.exe
    - \rundll32.exe
    - \inetsrv\iissetup.exe
    - \inetsrv\appcmd.exe
  filter_update:
    winlog.event_data.CommandLine|contains: \dismhost.exe {
    winlog.event_data.CommandLine|startswith: C:\$WinREAgent\Scratch\
  selection:
    winlog.event_data.ImageLoaded|endswith: \vss_ps.dll
falsepositives:
- Unknown
id: 333cdbe8-27bb-4246-bf82-b41a0dca4b70
level: high
logsource:
  category: image_load
  product: windows
modified: 2022/07/27
product: windows
references:
- 1bd85e1caa1415ebdc8852c91e37bbb7
- https://twitter.com/am0nsec/status/1412232114980982787
status: experimental
tags:
- attack.defense_evasion
- attack.impact
- attack.t1490
title: Image Load of VSS_PS.dll by Uncommon Executable
