author: Patrick St. John, OTR (Open Threat Research)
category: image_load
date: 2020/05/03
description: Detects the image load of Python Core indicative of a Python script bundled
  with Py2Exe.
detection:
  condition: selection and not filter
  filter:
  - winlog.event_data.Image|contains:
    - Python
  - winlog.event_data.Image|startswith:
    - C:\Program Files\
    - C:\Program Files (x86)\
  selection:
    winlog.event_data.Description: Python Core
falsepositives:
- Legit Py2Exe Binaries
fields:
- winlog.event_data.Description
id: cbb56d62-4060-40f7-9466-d8aaf3123f83
level: medium
logsource:
  category: image_load
  product: windows
modified: 2021/12/05
product: windows
references:
- https://www.py2exe.org/
- https://unit42.paloaltonetworks.com/unit-42-technical-analysis-seaduke/
status: experimental
tags:
- attack.defense_evasion
- attack.t1027.002
title: Python Py2Exe Image Load
