author: Nasreddine Bencherchali
category: image_load
date: 2022/08/30
description: Detects cmstp loading "dll" or "ocx" files from suspicious locations
detection:
  condition: selection
  selection:
    winlog.event_data.ImageLoaded|contains:
    - \Users\
    - \AppData\Local\Temp\
    - \PerfLogs\
    - \Windows\Temp\
    winlog.event_data.ImageLoaded|endswith:
    - .dll
    - .ocx
    winlog.event_data.Image|endswith: \cmstp.exe
falsepositives:
- Unikely
id: 75e508f7-932d-4ebc-af77-269237a84ce1
level: high
logsource:
  category: image_load
  product: windows
product: windows
references:
- https://github.com/vadim-hunter/Detection-Ideas-Rules/blob/02bcbfc2bfb8b4da601bb30de0344ae453aa1afe/TTPs/Defense%20Evasion/T1218%20-%20Signed%20Binary%20Proxy%20Execution/T1218.003%20-%20CMSTP/Procedures.yaml
status: experimental
tags:
- attack.defense_evasion
- attack.t1218.003
title: Cmstp Suspicious DLL Load
