author: Florian Roth
category: image_load
date: 2021/09/27
description: Detects DLL image load activity as used by FoggyWeb backdoor loader
detection:
  condition: selection
  selection:
    winlog.event_data.Image: C:\Windows\ADFS\version.dll
falsepositives:
- Unlikely
id: 640dc51c-7713-4faa-8a0e-e7c0d9d4654c
level: critical
logsource:
  category: image_load
  product: windows
product: windows
references:
- https://www.microsoft.com/security/blog/2021/09/27/foggyweb-targeted-nobelium-malware-leads-to-persistent-backdoor/
status: experimental
tags:
- attack.resource_development
- attack.t1587
title: FoggyWeb Backdoor DLL Loading
