author: Markus Neis
category: image_load
date: 2018/01/07
description: Detects Loading of samlib.dll, WinSCard.dll from untypical process e.g.
  through process hollowing by Mimikatz
detection:
  condition: selection
  selection:
    winlog.event_data.ImageLoaded|endswith:
    - \samlib.dll
    - \WinSCard.dll
    winlog.event_data.Image|endswith: \notepad.exe
falsepositives:
- Very likely, needs more tuning
id: e32ce4f5-46c6-4c47-ba69-5de3c9193cd7
level: high
logsource:
  category: image_load
  product: windows
modified: 2021/11/27
product: windows
references:
- https://cyberwardog.blogspot.com/2017/03/chronicles-of-threat-hunter-hunting-for.html
status: test
tags:
- attack.defense_evasion
- attack.t1574.002
title: Possible Process Hollowing Image Loading
