author: Antonlovesdnb
category: image_load
date: 2020/02/19
description: Detects CLR DLL being loaded by an Office Product
detection:
  condition: selection
  selection:
    winlog.event_data.ImageLoaded|contains: \clr.dll
    winlog.event_data.Image|endswith:
    - \winword.exe
    - \powerpnt.exe
    - \excel.exe
    - \outlook.exe
falsepositives:
- Alerts on legitimate macro usage as well, will need to filter as appropriate
id: d13c43f0-f66b-4279-8b2c-5912077c1780
level: high
logsource:
  category: image_load
  product: windows
modified: 2021/11/27
product: windows
references:
- https://medium.com/threatpunter/detecting-adversary-tradecraft-with-image-load-event-logging-and-eql-8de93338c16
status: test
tags:
- attack.execution
- attack.t1204.002
title: CLR DLL Loaded Via Office Applications
