author: Nasreddine Bencherchali
category: image_load
date: 2022/07/17
description: Detects when a system process (ie located in system32, syswow64...etc)
  loads a DLL from a suspicious location such as %temp%
detection:
  condition: selection and not filter
  filter:
  - winlog.event_data.Image|endswith: \msiexec.exe
  - winlog.event_data.ImageLoaded|startswith:
    - C:\Program Files\
    - C:\Program Files (x86)\
  selection:
    winlog.event_data.ImageLoaded|contains:
    - \Users\Public\
    - \Desktop\
    - \Downloads\
    - \AppData\Local\Temp\
    - C:\PerfLogs\
    winlog.event_data.Image|startswith: C:\Windows\
falsepositives:
- Unknown
id: 9e9a9002-56c4-40fd-9eff-e4b09bfa5f6c
level: high
logsource:
  category: image_load
  product: windows
modified: 2022/09/03
product: windows
references:
- https://github.com/hackerhouse-opensource/iscsicpl_bypassUAC (Idea)
status: experimental
tags:
- attack.defense_evasion
- attack.t1070
title: DLL Load By System Process From Suspicious Locations
