author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
category: image_load
date: 2020/06/24
description: Detects signs of potential use of the WSMAN provider from uncommon processes
  locally and remote execution.
detection:
  commandline_null:
    winlog.event_data.CommandLine: null
  condition: ( request_client or respond_server ) and not 1 of filter* and not ( svchost
    and commandline_null )
  filter_citrix:
    winlog.event_data.Image|startswith: C:\Program Files\Citrix\
  filter_general:
    winlog.event_data.Image|endswith:
    - \powershell.exe
    - C:\Windows\System32\sdiagnhost.exe
    - C:\Windows\System32\services.exe
  filter_mscorsvw:
    winlog.event_data.Image|endswith: \mscorsvw.exe
    winlog.event_data.Image|startswith:
    - C:\Windows\Microsoft.NET\Framework64\v
    - C:\Windows\Microsoft.NET\Framework\v
  filter_nextron:
    winlog.event_data.Image|startswith: C:\Windows\Temp\asgard2-agent\
  filter_svchost:
    winlog.event_data.CommandLine|contains:
    - svchost.exe -k netsvcs -p -s BITS
    - svchost.exe -k GraphicsPerfSvcGroup -s GraphicsPerfSvc
    - svchost.exe -k NetworkService -p -s Wecsvc
    - svchost.exe -k netsvcs
  filter_svr_2019:
    winlog.event_data.Image:
    - C:\Windows\System32\Configure-SMRemoting.exe
    - C:\Windows\System32\ServerManager.exe
  request_client:
  - winlog.event_data.ImageLoaded|endswith:
    - \WsmSvc.dll
    - \WsmAuto.dll
    - \Microsoft.WSMan.Management.ni.dll
  - winlog.event_data.OriginalFileName:
    - WsmSvc.dll
    - WSMANAUTOMATION.DLL
    - Microsoft.WSMan.Management.dll
  respond_server:
    winlog.event_data.Image|endswith: \svchost.exe
    winlog.event_data.OriginalFileName: WsmWmiPl.dll
  svchost:
    winlog.event_data.Image|endswith: \svchost.exe
falsepositives:
- Unknown
id: ad1f4bb9-8dfb-4765-adb6-2a7cfb6c0f94
level: medium
logsource:
  category: image_load
  product: windows
modified: 2022/07/18
product: windows
references:
- https://twitter.com/chadtilbury/status/1275851297770610688
- https://bohops.com/2020/05/12/ws-management-com-another-approach-for-winrm-lateral-movement/
- https://docs.microsoft.com/en-us/windows/win32/winrm/windows-remote-management-architecture
- https://github.com/bohops/WSMan-WinRM
status: experimental
tags:
- attack.execution
- attack.t1059.001
- attack.lateral_movement
- attack.t1021.003
title: Suspicious WSMAN Provider Image Loads
