author: Nasreddine Bencherchali, Wietze Beukema (project and research)
category: image_load
date: 2022/08/17
description: Detects DLL sideloading of DLLs that are part of web browsers
detection:
  condition: selection_chrome and not filter_chrome
  filter_chrome:
  - winlog.event_data.ImageLoaded|contains: \AppData\local\Google\Chrome\Application\
  - winlog.event_data.ImageLoaded|startswith:
    - C:\Program Files\Google\Chrome\Application\
    - C:\Program Files (x86)\Google\Chrome\Application\
  selection_chrome:
    winlog.event_data.ImageLoaded|endswith: \chrome_frame_helper.dll
falsepositives:
- Unknown
id: 72ca7c75-bf85-45cd-aca7-255d360e423c
level: medium
logsource:
  category: image_load
  product: windows
product: windows
references:
- https://hijacklibs.net/
status: experimental
tags:
- attack.defense_evasion
- attack.persistence
- attack.privilege_escalation
- attack.t1574.001
- attack.t1574.002
title: Web Browsers DLL Sideloading
