author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
category: image_load
date: 2020/05/02
description: A General detection for processes loading System.Drawing.ni.dll. This
  could be an indicator of potential Screen Capture.
detection:
  condition: selection and not 1 of filter*
  filter:
    winlog.event_data.Image|startswith:
    - C:\Program Files\
    - C:\Program Files (x86)\
    - C:\Windows\System32\
    - C:\Windows\Microsoft.NET\
    - C:\Windows\ImmersiveControlPanel\
  filter2:
    winlog.event_data.Image: C:\Windows\System32\NhNotifSys.exe
  filter3:
    winlog.event_data.Image|endswith:
    - \AppData\Local\NhNotifSys\nahimic\nahimicNotifSys.exe
    - \GitHubDesktop\Update.exe
    winlog.event_data.Image|startswith: C:\Users\
  selection:
    winlog.event_data.ImageLoaded|endswith: \System.Drawing.ni.dll
falsepositives:
- Unknown
id: 666ecfc7-229d-42b8-821e-1a8f8cb7057c
level: low
logsource:
  category: image_load
  product: windows
modified: 2022/08/13
product: windows
references:
- https://github.com/OTRF/detection-hackathon-apt29/issues/16
- https://threathunterplaybook.com/evals/apt29/detections/7.A.1_3B4E5808-3C71-406A-B181-17B0CE3178C9.html
status: experimental
tags:
- attack.collection
- attack.t1113
title: Suspicious System.Drawing Load
