author: Tom Kern, oscd.community, Natalia Shornikova, Tim Shelton
category: image_load
date: 2019/11/14
description: Detects loading of essential DLL used by PowerShell, but not by the process
  powershell.exe. Detects meterpreter's "load powershell" extension.
detection:
  condition: selection and not 1 of filter*
  filter:
  - winlog.event_data.Image: C:\Windows\System32\dsac.exe
  - winlog.event_data.Image|endswith:
    - \powershell.exe
    - \powershell_ise.exe
    - \WINDOWS\System32\sdiagnhost.exe
    - \mscorsvw.exe
    - \WINDOWS\System32\RemoteFXvGPUDisablement.exe
    - \sqlps.exe
    - \wsmprovhost.exe
    - \winrshost.exe
    - \syncappvpublishingserver.exe
    - \runscripthelper.exe
    - \ServerManager.exe
    - \Microsoft SQL Server Management Studio *\Common*\IDE\Ssms.exe
    - \IDE\devenv.exe
    - \ServiceHub.VSDetouredHost.exe
    - \ServiceHub.SettingsHost.exe
    - \ServiceHub.Host.CLR.x86.exe
    - \Citrix\ConfigSync\ConfigSyncRun.exe
  - winlog.event_data.Image|startswith:
    - C:\Program Files (x86)\Microsoft Visual Studio\
    - C:\Program Files\Microsoft Visual Studio\
  filter_nextron:
    winlog.event_data.Image|endswith:
    - \thor64.exe
    - \thor.exe
    winlog.event_data.Image|startswith: C:\Windows\Temp\asgard2-agent\
  selection:
    winlog.event_data.ImageLoaded|endswith:
    - \System.Management.Automation.Dll
    - \System.Management.Automation.ni.Dll
enrichment:
- EN_0001_cache_sysmon_event_id_1_info
- EN_0003_enrich_other_sysmon_events_with_event_id_1_data
falsepositives:
- Used by some .NET binaries, minimal on user workstation.
- Used by Microsoft SQL Server Management Studio
id: 092bc4b9-3d1d-43b4-a6b4-8c8acd83522f
level: medium
logsource:
  category: image_load
  product: windows
modified: 2022/04/21
product: windows
references:
- https://adsecurity.org/?p=2921
- https://github.com/p3nt4/PowerShdll
related:
- id: 867613fb-fa60-4497-a017-a82df74a172c
  type: obsoletes
status: experimental
tags:
- attack.t1059.001
- attack.execution
title: In-memory PowerShell
