author: Nasreddine Bencherchali, Wietze Beukema (project and research)
category: image_load
date: 2022/08/17
description: Detects DLL sideloading of DLLs that are part of antivirus software suchas
  McAfee, Symantec...etc
detection:
  condition: (selection_bitdefender and not filter_bitdefender) or (selection_fsecure
    and not filter_fsecure) or (selection_mcafee and not filter_mcafee)
  filter_bitdefender:
    winlog.event_data.ImageLoaded|startswith:
    - C:\Program Files\Bitdefender Antivirus Free\
    - C:\Program Files (x86)\Bitdefender Antivirus Free\
  filter_fsecure:
    winlog.event_data.ImageLoaded|startswith:
    - C:\Program Files\F-Secure\Anti-Virus\
    - C:\Program Files (x86)\F-Secure\Anti-Virus\
  filter_mcafee:
    winlog.event_data.ImageLoaded|startswith:
    - C:\Program Files\McAfee\
    - C:\Program Files (x86)\McAfee\
  selection_bitdefender:
    winlog.event_data.ImageLoaded|endswith: \log.dll
  selection_fsecure:
    winlog.event_data.ImageLoaded|endswith: \qrt.dll
  selection_mcafee:
    winlog.event_data.ImageLoaded|endswith:
    - \ashldres.dll
    - \lockdown.dll
    - \vsodscpl.dll
falsepositives:
- Unknown
id: 552b6b65-df37-4d3e-a258-f2fc4771ae54
level: medium
logsource:
  category: image_load
  product: windows
product: windows
references:
- https://hijacklibs.net/
status: experimental
tags:
- attack.defense_evasion
- attack.persistence
- attack.privilege_escalation
- attack.t1574.001
- attack.t1574.002
title: Antivirus Software DLL Sideloading
