author: Nasreddine Bencherchali
category: image_load
date: 2022/07/17
description: Detects the "iscsicpl.exe" UAC bypass technique that leverages a DLL
  Search Order hijacking technique to load a custom DLL's from temp or a any user
  controlled location in the users %PATH%
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.ImageLoaded|contains|all:
    - C:\Windows\
    - iscsiexe.dll
  selection:
    winlog.event_data.Image: C:\Windows\SysWOW64\iscsicpl.exe
    winlog.event_data.ImageLoaded|endswith: \iscsiexe.dll
falsepositives:
- Unknown
id: 9ed5959a-c43c-4c59-84e3-d28628429456
level: high
logsource:
  category: image_load
  product: windows
modified: 2022/07/25
product: windows
references:
- https://github.com/hackerhouse-opensource/iscsicpl_bypassUAC
- https://twitter.com/wdormann/status/1547583317410607110
status: experimental
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1548.002
title: UAC Bypass Using Iscsicpl - ImageLoad
