author: omkar72, oscd.community
category: image_load
date: 2020/10/14
description: Detects CLR DLL being loaded by an scripting applications
detection:
  condition: selection
  selection:
    winlog.event_data.ImageLoaded|endswith:
    - \clr.dll
    - \mscoree.dll
    - \mscorlib.dll
    winlog.event_data.Image|endswith:
    - \wscript.exe
    - \cscript.exe
    - \mshta.exe
falsepositives:
- Unknown
id: 4508a70e-97ef-4300-b62b-ff27992990ea
level: high
logsource:
  category: image_load
  product: windows
modified: 2021/11/27
product: windows
references:
- https://github.com/tyranid/DotNetToJScript
- https://thewover.github.io/Introducing-Donut/
- https://blog.menasec.net/2019/07/interesting-difr-traces-of-net-clr.html
status: test
tags:
- attack.execution
- attack.privilege_escalation
- attack.t1055
title: CLR DLL Loaded Via Scripting Applications
