author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
category: image_load
date: 2020/10/12
description: Detects a threat actor creating a file named `wbemcomn.dll` in the `C:\Windows\System32\wbem\`
  directory over the network and loading it for a WMI DLL Hijack scenario.
detection:
  condition: selection
  selection:
    winlog.event_data.ImageLoaded|endswith: \wbem\wbemcomn.dll
    winlog.event_data.Image|endswith: \wmiprvse.exe
falsepositives:
- Unknown
id: 7707a579-e0d8-4886-a853-ce47e4575aaa
level: critical
logsource:
  category: image_load
  product: windows
modified: 2021/09/09
product: windows
references:
- https://threathunterplaybook.com/notebooks/windows/08_lateral_movement/WIN-201009173318.html
status: experimental
tags:
- attack.execution
- attack.t1047
- attack.lateral_movement
- attack.t1021.002
title: Wmiprvse Wbemcomn DLL Hijack
