author: Florian Roth
category: image_load
date: 2021/09/07
description: Detects an image load pattern as seen when a tool named PRIVATELOG is
  used and rarely observed under legitimate circumstances
detection:
  condition: selection
  selection:
    winlog.event_data.ImageLoaded|endswith: \clfsw32.dll
    winlog.event_data.Image|endswith: \svchost.exe
falsepositives:
- Rarely observed
id: 33a2d1dd-f3b0-40bd-8baf-7974468927cc
level: high
logsource:
  category: image_load
  product: windows
product: windows
references:
- https://www.fireeye.com/blog/threat-research/2021/09/unknown-actor-using-clfs-log-files-for-stealth.html
status: experimental
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1055
title: APT PRIVATELOG Image Load Pattern
