author: Teymur Kheirkhabarov, oscd.community
category: image_load
date: 2019/10/22
description: Loading unsigned image (DLL, EXE) into LSASS process
detection:
  condition: selection
  selection:
    winlog.event_data.Image|endswith: \lsass.exe
    winlog.event_data.Signed: 'false'
falsepositives:
- Valid user connecting using RDP
id: 857c8db3-c89b-42fb-882b-f681c7cf4da2
level: medium
logsource:
  category: image_load
  product: windows
modified: 2020/08/23
product: windows
references:
- https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
status: experimental
tags:
- attack.credential_access
- attack.t1003.001
title: Unsigned Image Loaded Into LSASS Process
