author: Roberto Rodriguez @Cyb3rWard0g
category: image_load
date: 2019/08/10
description: Detects non wmiprvse loading WMI modules
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.Image|endswith:
    - \WmiPrvSE.exe
    - \WmiApSrv.exe
    - \svchost.exe
    - \DeviceCensus.exe
    - \CompatTelRunner.exe
    - \sdiagnhost.exe
    - \SIHClient.exe
    - \ngentask.exe
    - \windows\system32\taskhostw.exe
    - \windows\system32\MoUsoCoreWorker.exe
    - \windows\system32\wbem\WMIADAP.exe
  selection:
    winlog.event_data.ImageLoaded|endswith:
    - \wmiclnt.dll
    - \WmiApRpl.dll
    - \wmiprov.dll
    - \wmiutils.dll
    - \wbemcomn.dll
    - \wbemprox.dll
    - \WMINet_Utils.dll
    - \wbemsvc.dll
    - \fastprox.dll
falsepositives:
- Unknown
fields:
- winlog.ComputerName
- winlog.event_data.User
- winlog.event_data.Image
- winlog.event_data.ImageLoaded
id: 671bb7e3-a020-4824-a00e-2ee5b55f385e
level: high
logsource:
  category: image_load
  product: windows
modified: 2021/08/18
product: windows
references:
- https://threathunterplaybook.com/notebooks/windows/02_execution/WIN-190811201010.html
status: experimental
tags:
- attack.execution
- attack.t1047
title: WMI Modules Loaded
