author: sigma
category: image_load
date: 2017/03/13
description: Detects certain DLL loads when Mimikatz gets executed
detection:
  condition: selector | near dllload1 and dllload2 and not exclusion
  dllload1:
    winlog.event_data.ImageLoaded|endswith: \vaultcli.dll
  dllload2:
    winlog.event_data.ImageLoaded|endswith: \wlanapi.dll
  exclusion:
    winlog.event_data.ImageLoaded:
    - ntdsapi.dll
    - netapi32.dll
    - imm32.dll
    - samlib.dll
    - combase.dll
    - srvcli.dll
    - shcore.dll
    - ntasn1.dll
    - cryptdll.dll
    - logoncli.dll
  selector:
    winlog.event_data.Image: C:\Windows\System32\rundll32.exe
  timeframe: 30s
falsepositives:
- unknown
id: c0478ead-5336-46c2-bd5e-b4c84bc3a36e
level: medium
logsource:
  category: image_load
  product: windows
product: windows
references:
- https://securityriskadvisors.com/blog/post/detecting-in-memory-mimikatz/
status: experimental
tags:
- attack.s0002
- attack.t1003
- attack.lateral_movement
- attack.credential_access
- car.2019-04-004
title: Mimikatz In-Memory
