author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
category: image_load
date: 2020/09/02
description: Detects signs of the WMI script host process %SystemRoot%\system32\wbem\scrcons.exe
  functionality being used via images being loaded by a process.
detection:
  condition: selection
  selection:
    winlog.event_data.ImageLoaded|endswith:
    - \vbscript.dll
    - \wbemdisp.dll
    - \wshom.ocx
    - \scrrun.dll
    winlog.event_data.Image|endswith: \scrcons.exe
falsepositives:
- Unknown
id: b439f47d-ef52-4b29-9a2f-57d8a96cb6b8
level: high
logsource:
  category: image_load
  product: windows
product: windows
references:
- https://twitter.com/HunterPlaybook/status/1301207718355759107
- https://www.mdsec.co.uk/2020/09/i-like-to-move-it-windows-lateral-movement-part-1-wmi-event-subscription/
- https://threathunterplaybook.com/notebooks/windows/08_lateral_movement/WIN-200902020333.html
status: experimental
tags:
- attack.lateral_movement
- attack.privilege_escalation
- attack.persistence
- attack.t1546.003
title: WMI Script Host Process Image Loaded
