author: FPT.EagleEye, Thomas Patzke (improvements)
category: image_load
date: 2021/06/29
description: Detect DLL Load from Spooler Service backup folder
detection:
  condition: selection
  selection:
    winlog.event_data.ImageLoaded|contains: \Windows\System32\spool\drivers\x64\3\
    winlog.event_data.ImageLoaded|endswith: .dll
    winlog.event_data.Image|endswith: spoolsv.exe
falsepositives:
- Loading of legitimate driver
id: 02fb90de-c321-4e63-a6b9-25f4b03dfd14
level: informational
logsource:
  category: image_load
  product: windows
modified: 2021/08/24
product: windows
references:
- https://github.com/hhlxf/PrintNightmare
status: experimental
tags:
- attack.persistence
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1574
- cve.2021.1675
- cve.2021.34527
title: Windows Spooler Service Suspicious Binary Load
