author: oscd.community, Dmitry Uchakin
category: image_load
date: 2020/10/06
description: Attempts to load dismcore.dll after dropping it
detection:
  condition: selection
  filter:
    winlog.event_data.ImageLoaded:
    - C:\Windows\System32\Dism\dismcore.dll
  selection:
    winlog.event_data.ImageLoaded|endswith:
    - \dismcore.dll
    winlog.event_data.Image|endswith:
    - \dism.exe
falsepositives:
- Pentests
- Actions of a legitimate telnet client
id: a5ea83a7-05a5-44c1-be2e-addccbbd8c03
level: high
logsource:
  category: image_load
  product: windows
product: windows
references:
- https://steemit.com/utopian-io/@ah101/uac-bypassing-utility
status: experimental
tags:
- attack.persistence
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1548.002
- attack.t1574.002
title: UAC Bypass With Fake DLL
