author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
category: image_load
date: 2020/06/24
description: Detects signs of potential use of the WSMAN provider from uncommon processes
  locally and remote execution.
detection:
  condition: (request_client and not filter_ps) or respond_server
  filter_ps:
    winlog.event_data.Image|endswith: \powershell.exe
  request_client:
  - winlog.event_data.ImageLoaded|endswith:
    - \WsmSvc.dll
    - \WsmAuto.dll
    - \Microsoft.WSMan.Management.ni.dll
  - winlog.event_data.OriginalFileName:
    - WsmSvc.dll
    - WSMANAUTOMATION.DLL
    - Microsoft.WSMan.Management.dll
  respond_server:
    winlog.event_data.Image|endswith: \svchost.exe
    winlog.event_data.OriginalFileName: WsmWmiPl.dll
falsepositives:
- Unknown
id: ad1f4bb9-8dfb-4765-adb6-2a7cfb6c0f94
level: medium
logsource:
  category: image_load
  product: windows
product: windows
references:
- https://twitter.com/chadtilbury/status/1275851297770610688
- https://bohops.com/2020/05/12/ws-management-com-another-approach-for-winrm-lateral-movement/
- https://docs.microsoft.com/en-us/windows/win32/winrm/windows-remote-management-architecture
- https://github.com/bohops/WSMan-WinRM
status: experimental
tags:
- attack.execution
- attack.t1059.001
- attack.lateral_movement
- attack.t1021.003
title: Suspicious WSMAN Provider Image Loads
