author: Perez Diego (@darkquassar), oscd.community, Ecco
category: image_load
date: 2019/10/27
description: Detects the load of dbghelp/dbgcore DLL (used to make memory dumps) by
  suspicious processes. Tools like ProcessHacker and some attacker tradecract use
  MiniDumpWriteDump API found in dbghelp.dll or dbgcore.dll. As an example, SilentTrynity
  C2 Framework has a module that leverages this API to dump the contents of Lsass.exe
  and transfer it over the network back to the attacker's machine.
detection:
  condition: (signedprocess and not filter) or (unsignedprocess and not filter)
  filter:
    winlog.event_data.Image|contains: Visual Studio
  signedprocess:
    winlog.event_data.ImageLoaded|endswith:
    - \dbghelp.dll
    - \dbgcore.dll
    winlog.event_data.Image|endswith:
    - \msbuild.exe
    - \cmd.exe
    - \svchost.exe
    - \rundll32.exe
    - \powershell.exe
    - \word.exe
    - \excel.exe
    - \powerpnt.exe
    - \outlook.exe
    - \monitoringhost.exe
    - \wmic.exe
    - \bash.exe
    - \wscript.exe
    - \cscript.exe
    - \mshta.exe
    - \regsvr32.exe
    - \schtasks.exe
    - \dnx.exe
    - \regsvcs.exe
    - \sc.exe
    - \scriptrunner.exe
  unsignedprocess:
    winlog.event_data.ImageLoaded|endswith:
    - \dbghelp.dll
    - \dbgcore.dll
    winlog.event_data.Signed: 'FALSE'
falsepositives:
- Penetration tests
fields:
- winlog.ComputerName
- winlog.event_data.User
- winlog.event_data.Image
- winlog.event_data.ImageLoaded
id: 0e277796-5f23-4e49-a490-483131d4f6e1
level: high
logsource:
  category: image_load
  product: windows
modified: 2020/08/23
product: windows
references:
- https://docs.microsoft.com/en-us/windows/win32/api/minidumpapiset/nf-minidumpapiset-minidumpwritedump
- https://www.pinvoke.net/default.aspx/dbghelp/MiniDumpWriteDump.html
- https://medium.com/@fsx30/bypass-edrs-memory-protection-introduction-to-hooking-2efb21acffd6
status: experimental
tags:
- attack.credential_access
- attack.t1003.001
title: Load of dbghelp/dbgcore DLL from Suspicious Process
