author: Antonlovesdnb
category: image_load
date: 2020/02/19
description: Detects any assembly DLL being loaded by an Office Product
detection:
  condition: selection
  selection:
    winlog.event_data.ImageLoaded|startswith:
    - C:\Windows\assembly\
    winlog.event_data.Image|endswith:
    - \winword.exe
    - \powerpnt.exe
    - \excel.exe
    - \outlook.exe
falsepositives:
- Alerts on legitimate macro usage as well, will need to filter as appropriate
id: ff0f2b05-09db-4095-b96d-1b75ca24894a
level: high
logsource:
  category: image_load
  product: windows
modified: 2020/08/23
product: windows
references:
- https://medium.com/threatpunter/detecting-adversary-tradecraft-with-image-load-event-logging-and-eql-8de93338c16
status: experimental
tags:
- attack.execution
- attack.t1204.002
title: dotNET DLL Loaded Via Office Applications
