author: YochanaHenderson, '@Yochana-H'
date: 2022/08/03
description: Detect when a user has reset their password in Azure AD
detection:
  condition: selection and filter
  filter:
    ActivityType|contains: Password reset
    Target|contains: UPN
  selection:
    Category: UserManagement
    Initiatedby: UPN
    Status: Success
falsepositives:
- If this was approved by System Administrator or confirmed user action.
id: 340ee172-4b67-4fb4-832f-f961bdc1f3aa
level: medium
logsource:
  product: azure
  service: auditlogs
product: azure
references:
- https://docs.microsoft.com/en-us/azure/active-directory/fundamentals/security-operations-privileged-accounts
service: auditlogs
status: experimental
tags:
- attack.t1078
title: Password Reset By User Account
