author: AlertIQ
date: 2022/03/24
description: User has indicated they haven't instigated the MFA prompt and could indicate
  an attacker has the password for the account.
detection:
  condition: selection
  selection:
    AuthenticationRequirement: multiFactorAuthentication
    Status|contains: MFA Denied
falsepositives:
- Users actually login but miss-click into the Deny button when MFA prompt.
id: e40f4962-b02b-4192-9bfe-245f7ece1f99
level: medium
logsource:
  product: azure
  service: signinlogs
product: azure
references:
- https://www.microsoft.com/security/blog/2022/03/22/dev-0537-criminal-actor-targeting-organizations-for-data-exfiltration-and-destruction/
service: signinlogs
status: experimental
tags:
- attack.initial_access
- attack.t1078.004
title: Multifactor Authentication Denied
