author: Bailey Bercik '@baileybercik', Mark Morowczynski '@markmorow'
date: 2022/07/28
description: Detects when highly privileged delegated permissions are granted on behalf
  of all users
detection:
  condition: selection
  selection:
    properties.message: Add delegated permission grant
falsepositives:
- When the permission is legitimately needed for the app
id: a6355fbe-f36f-45d8-8efc-ab42465cbc52
level: high
logsource:
  product: azure
  service: auditlogs
product: azure
references:
- https://docs.microsoft.com/en-us/azure/active-directory/fundamentals/security-operations-applications#application-granted-highly-privileged-permissions
service: auditlogs
status: experimental
tags:
- attack.privilege_escalation
title: Delegated Permissions Granted For All Users
