author: '@ionsor'
date: 2022/02/08
description: Detection for when multi factor authentication has been disabled, which
  might indicate a malicious activity to bypass authentication mechanisms.
detection:
  condition: selection
  selection:
    eventName: Disable Strong Authentication.
    eventSource: AzureActiveDirectory
    status: success
falsepositives:
- Authorized modification by administrators
id: 7ea78478-a4f9-42a6-9dcd-f861816122bf
level: medium
logsource:
  product: azure
  service: activitylogs
product: azure
references:
- https://attack.mitre.org/techniques/T1556/
- https://docs.microsoft.com/en-us/azure/active-directory/authentication/howto-mfa-userstates
service: activitylogs
status: experimental
tags:
- attack.persistence
- attack.t1556
title: Disabled MFA to Bypass Authentication Mechanisms
