author: sawwinnnaung
date: 2020/05/07
description: Identifies IPs from which users grant access to other users on azure
  resources and alerts when a previously unseen source IP address is used.
detection:
  condition: keywords
  keywords:
  - Microsoft.DocumentDB/databaseAccounts/listKeys/action
  - Microsoft.Maps/accounts/listKeys/action
  - Microsoft.Media/mediaservices/listKeys/action
  - Microsoft.CognitiveServices/accounts/listKeys/action
  - Microsoft.Storage/storageAccounts/listKeys/action
  - Microsoft.Compute/snapshots/write
  - Microsoft.Network/networkSecurityGroups/write
falsepositives:
- Valid change
id: c1182e02-49a3-481c-b3de-0fadc4091488
level: medium
logsource:
  product: azure
  service: azureactivity
modified: 2021/11/27
product: azure
references:
- https://github.com/Azure/Azure-Sentinel/blob/e534407884b1ec5371efc9f76ead282176c9e8bb/Detections/AzureActivity/RareOperations.yaml
service: azureactivity
status: test
tags:
- attack.t1003
title: Rare Subscription-level Operations In Azure
