author: Corissa Koopmans, '@corissalea'
date: 2022/04/21
description: Define a baseline threshold and then monitor and adjust to suit your
  organizational behaviors and limit false alerts from being generated.
detection:
  condition: selection and not filter_computer | count(TargetUserName) by IpAddress
    > 10
  filter_computer:
    TargetUserName|endswith: $
  selection:
    ResultDescription: Invalid username or password or Invalid on-premises username
      or password.
    ResultType: 50126
falsepositives:
- Failed Azure AD Connect Synchronization
- Service account use with an incorrect password specified
- Misconfigured systems
- Vulnerability scanners
id: dff74231-dbed-42ab-ba49-83289be2ac3a
level: high
logsource:
  product: azure
  service: signinlogs
product: azure
references:
- https://docs.microsoft.com/en-us/azure/active-directory/fundamentals/security-operations-privileged-accounts#things-to-monitor
service: signinlogs
status: experimental
tags:
- attack.credential_access
- attack.t1110
title: Sign-in Failure Bad Password Threshold
