author: Austin Songer
date: 2021/08/16
description: Identifies when a suppression rule is created in Azure. Adversary's could
  attempt this to evade detection.
detection:
  condition: selection
  selection:
    operationName: MICROSOFT.SECURITY/ALERTSSUPPRESSIONRULES/WRITE
falsepositives:
- Suppression Rule being created may be performed by a system administrator.
- Verify whether the user identity, user agent, and/or hostname should be making changes
  in your environment.
- Suppression Rule created from unfamiliar users should be investigated. If known
  behavior is causing false positives, it can be exempted from the rule.
id: 92cc3e5d-eb57-419d-8c16-5c63f325a401
level: medium
logsource:
  product: azure
  service: activitylogs
modified: 2022/08/23
product: azure
references:
- https://docs.microsoft.com/en-us/azure/role-based-access-control/resource-provider-operations
service: activitylogs
status: experimental
tags:
- attack.impact
title: Azure Suppression Rule Created
