author: "Rapha\xEBl CALVET, @MetallicHack"
date: 2021/10/04
description: User Added to an Administrator's Azure AD Role
detection:
  condition: selection
  selection:
    ModifiedProperties{}.NewValue|endswith:
    - Admins
    - Administrator
    Operation: Add member to role.
    Workload: AzureActiveDirectory
falsepositives:
- PIM (Privileged Identity Management) generates this event each time 'eligible role'
  is enabled.
id: ebbeb024-5b1d-4e16-9c0c-917f86c708a7
level: medium
logsource:
  product: azure
  service: activitylogs
product: azure
references:
- https://attack.mitre.org/techniques/T1098/003/
- https://m365internals.com/2021/07/13/what-ive-learned-from-doing-a-year-of-cloud-forensics-in-azure-ad/
service: activitylogs
status: experimental
tags:
- attack.persistence
- attack.t1098.003
title: User Added to an Administrator's Azure AD Role
