author: Mark Morowczynski '@markmorow', Yochana Henderson, '@Yochana-H'
date: 2022/08/09
description: Detects when PIM alerts are set to disabled.
detection:
  condition: selection
  selection:
    properties.message: Disable PIM Alert
falsepositives:
- Administrator disabling PIM alerts as an active choice.
id: aeaef14c-e5bf-4690-a9c8-835caad458bd
level: high
logsource:
  product: azure
  service: auditlogs
product: azure
references:
- https://docs.microsoft.com/en-us/azure/active-directory/fundamentals/security-operations-privileged-identity-management#azure-ad-roles-assignment
service: auditlogs
status: experimental
tags:
- attack.defense_evasion
- attack.t1484
title: PIM Alert Setting Changes To Disabled
