author: AlertIQ
date: 2021/10/10
description: Detect failed attempts to sign in to disabled accounts.
detection:
  condition: selection
  selection:
    ResultDescription: User account is disabled. The account has been disabled by
      an administrator.
    ResultType: 50057
falsepositives:
- Unknown
id: 908655e0-25cf-4ae1-b775-1c8ce9cf43d8
level: medium
logsource:
  product: azure
  service: signinlogs
product: azure
references:
- https://docs.microsoft.com/en-us/azure/active-directory/fundamentals/security-operations-privileged-accounts
service: signinlogs
status: experimental
tags:
- attack.initial_access
- attack.t1078
title: Login to Disabled Account
