author: Austin Songer @austinsonger
date: 2021/08/08
description: Identifies when a VPN connection is modified or deleted.
detection:
  condition: selection
  selection:
    operationName:
    - MICROSOFT.NETWORK/VPNGATEWAYS/VPNCONNECTIONS/WRITE
    - MICROSOFT.NETWORK/VPNGATEWAYS/VPNCONNECTIONS/DELETE
falsepositives:
- VPN Connection being modified or deleted may be performed by a system administrator.
  Verify whether the user identity, user agent, and/or hostname should be making changes
  in your environment.
- VPN Connection modified or deleted from unfamiliar users should be investigated.
  If known behavior is causing false positives, it can be exempted from the rule.
id: 61171ffc-d79c-4ae5-8e10-9323dba19cd3
level: medium
logsource:
  product: azure
  service: activitylogs
modified: 2022/08/23
product: azure
references:
- https://docs.microsoft.com/en-us/azure/role-based-access-control/resource-provider-operations
service: activitylogs
status: experimental
tags:
- attack.impact
title: Azure VPN Connection Modified or Deleted
