author: Michael Epping, '@mepples21'
date: 2022/06/28
description: Monitor and alert for Bitlocker key retrieval.
detection:
  condition: selection
  selection:
    Category: KeyManagement
    OperationName: Read BitLocker key
falsepositives:
- Unknown
id: a0413867-daf3-43dd-9245-734b3a787942
level: medium
logsource:
  product: azure
  service: auditlogs
product: azure
references:
- https://docs.microsoft.com/en-us/azure/active-directory/fundamentals/security-operations-devices#bitlocker-key-retrieval
service: auditlogs
status: experimental
tags:
- attack.valid_accounts
- attack.t1078
title: Bitlocker Key Retrieval
