author: Mark Morowczynski '@markmorow', Bailey Bercik '@baileybercik'
date: 2022/06/02
description: Detects when a new owner is added to an application. This gives that
  account privileges to make modifications and configuration changes to the application.
detection:
  condition: selection
  selection:
    properties.message: Add owner to application
falsepositives:
- When a new application owner is added by an administrator
id: 74298991-9fc4-460e-a92e-511aa60baec1
level: medium
logsource:
  product: azure
  service: auditlogs
product: azure
references:
- https://docs.microsoft.com/en-us/azure/active-directory/fundamentals/security-operations-applications#new-owner
service: auditlogs
status: experimental
tags:
- attack.t1528
- attack.persistence
- attack.credential_access
- attack.defense_evasion
title: Added Owner To Application
