author: MikeDuddington, '@dudders1'
date: 2022/07/28
description: Detects guest users being invited to tenant by non-approved inviters
detection:
  condition: selection and not filter
  filter:
    InitiatedBy|contains: <approved guest inviter use OR for multiple>
  selection:
    Category: UserManagement
    OperationName: Invite external user
falsepositives:
- If this was approved by System Administrator.
id: 4ad97bf5-a514-41a4-abd3-4f3455ad4865
level: medium
logsource:
  product: azure
  service: auditlogs
product: azure
references:
- https://docs.microsoft.com/en-gb/azure/active-directory/fundamentals/security-operations-user-accounts#monitoring-external-user-sign-ins
service: auditlogs
status: experimental
tags:
- attack.t1078
title: Guest Users Invited To Tenant By Non Approved Inviters
