author: MikeDuddington, '@dudders1'
date: 2022/07/28
description: Detect when authentications to important application(s) only required
  single-factor authentication
detection:
  condition: selection
  selection:
    AppId: Insert Application ID use OR for multiple
    AuthenticationRequirement: singleFactorAuthentication
    Status: Success
falsepositives:
- If this was approved by System Administrator.
id: f272fb46-25f2-422c-b667-45837994980f
level: medium
logsource:
  product: azure
  service: signinlogs
product: azure
references:
- https://docs.microsoft.com/en-gb/azure/active-directory/fundamentals/security-operations-user-accounts
service: signinlogs
status: experimental
tags:
- attack.t1078
title: Authentications To Important Apps Using Single Factor Authentication
