author: Austin Songer @austinsonger
date: 2021/11/26
description: Detects when there is a interruption in the authentication process.
detection:
  condition: selection1 or selection2 or selection3
  selection1:
    ResultDescription: Device authentication is required
    ResultType: 50097
  selection2:
    ResultDescription: DeviceAuthenticationFailed
    ResultType: 50155
  selection3:
    ResultDescription: ExternalSecurityChallenge - External security challenge was
      not satisfied
    ResultType: 50158
falsepositives:
- Unknown
id: 8366030e-7216-476b-9927-271d79f13cf3
level: medium
logsource:
  product: azure
  service: signinlogs
product: azure
references:
- https://docs.microsoft.com/en-us/azure/active-directory/fundamentals/security-operations-privileged-accounts
service: signinlogs
status: experimental
tags:
- attack.initial_access
- attack.t1078
title: Azure Unusual Authentication Interruption
