author: Austin Songer @austinsonger
date: 2021/09/02
description: Identifies when a service principal is created in Azure.
detection:
  condition: selection
  selection:
    properties.message: Add service principal
falsepositives:
- Service principal being created may be performed by a system administrator.
- Verify whether the user identity, user agent, and/or hostname should be making changes
  in your environment.
- Service principal created from unfamiliar users should be investigated. If known
  behavior is causing false positives, it can be exempted from the rule.
id: 0ddcff6d-d262-40b0-804b-80eb592de8e3
level: medium
logsource:
  product: azure
  service: activitylogs
product: azure
references:
- https://docs.microsoft.com/en-us/azure/active-directory/reports-monitoring/reference-audit-activities#application-proxy
service: activitylogs
status: experimental
tags:
- attack.defense_evasion
title: Azure Service Principal Created
