author: MikeDuddington, '@dudders1'
date: 2022/06/30
description: Detect when users in your Azure AD tenant are authenticating to other
  Azure AD Tenants.
detection:
  condition: selection and not filter
  filter:
    ResourceTenantId|contains: HomeTenantID
  selection:
    HomeTenantId: HomeTenantID
    Status: Success
falsepositives:
- If this was approved by System Administrator.
id: 5f521e4b-0105-4b72-845b-2198a54487b9
level: medium
logsource:
  product: azure
  service: signinlogs
product: azure
references:
- https://docs.microsoft.com/en-gb/azure/active-directory/fundamentals/security-operations-user-accounts#monitoring-external-user-sign-ins
service: signinlogs
status: experimental
tags:
- attack.t1078
title: Users Authenticating To Other Azure AD Tenants
