author: AlertIQ
date: 2021/10/10
description: Identifies user login with multifactor authentication failures, which
  might be an indication an attacker has the password for the account but can't pass
  the MFA challenge.
detection:
  condition: selection or selection1
  selection:
    ResultDescription|contains: Strong Auth required
    ResultType: 50074
  selection1:
    ResultDescription|contains: Authentication failed during strong authentication
      request
    ResultType: 500121
falsepositives:
- Unknown
id: 5496ff55-42ec-4369-81cb-00f417029e25
level: medium
logsource:
  product: azure
  service: signinlogs
product: azure
references:
- https://docs.microsoft.com/en-us/azure/active-directory/fundamentals/security-operations-privileged-accounts
service: signinlogs
status: experimental
tags:
- attack.initial_access
- attack.t1078.004
title: Multifactor Authentication Interrupted
