author: Mark Morowczynski '@markmorow', Yochana Henderson, '@Yochana-H'
date: 2022/08/06
description: Detects when a user is added to a privileged role.
detection:
  condition: selection
  selection:
    properties.message:
    - Add eligible member (permanent)
    - Add eligible member (eligible)
falsepositives:
- Legtimate administrator actions of adding members from a role
id: 49a268a4-72f4-4e38-8a7b-885be690c5b5
level: high
logsource:
  product: azure
  service: auditlogs
product: azure
references:
- https://docs.microsoft.com/en-us/azure/active-directory/fundamentals/security-operations-privileged-identity-management#azure-ad-roles-assignment
service: auditlogs
status: experimental
tags:
- attack.persistence
- attack.t1098
title: User Added To Privilege Role
