author: Mark Morowczynski '@markmorow', Bailey Bercik '@baileybercik'
date: 2022/05/26
description: Detects when a new credential is added to an existing application. Any
  additional credentials added outside of expected processes could be a malicious
  actor using those credentials.
detection:
  condition: selection
  selection:
    properties.message:
    - Update Application-Certificates and secrets management
    - Update Service principal/Update Application
falsepositives:
- When credentials are added/removed as part of the normal working hours/workflows
id: cbb67ecc-fb70-4467-9350-c910bdf7c628
level: high
logsource:
  product: azure
  service: auditlogs
product: azure
references:
- https://docs.microsoft.com/en-us/azure/active-directory/fundamentals/security-operations-applications#application-credentials
service: auditlogs
status: experimental
tags:
- attack.t1098
- attack.persistence
title: Added Credentials to Existing Application
