author: Mark Morowczynski '@markmorow', Yochana Henderson, '@Yochana-H'
date: 2022/08/05
description: Detects when a user is removed from a privileged role. Bulk changes should
  be investigated.
detection:
  condition: selection
  selection:
    properties.message:
    - Remove eligible member (permanent)
    - Remove eligible member (eligible)
falsepositives:
- Legtimate administrator actions of removing members from a role
id: 102e11e3-2db5-4c9e-bc26-357d42585d21
level: high
logsource:
  product: azure
  service: auditlogs
product: azure
references:
- https://docs.microsoft.com/en-us/azure/active-directory/fundamentals/security-operations-privileged-identity-management#azure-ad-roles-assignment
service: auditlogs
status: experimental
tags:
- attack.persistence
- attack.t1098
title: Bulk Deletion Changes To Privileged Account Permissions
