author: frack113
category: file_delete
date: 2022/01/02
description: Adversaries may delete or remove built-in operating system data and turn
  off services designed to aid in the recovery of a corrupted system to prevent recovery.
detection:
  condition: selection
  selection:
    winlog.event_data.Image|endswith: \cmd.exe
    winlog.event_data.TargetFilename|endswith:
    - .VHD
    - .bac
    - .bak
    - .wbcat
    - .bkf
    - .set
    - .win
    - .dsk
falsepositives:
- Legitime usage
id: 06125661-3814-4e03-bfa2-1e4411c60ac3
level: medium
logsource:
  category: file_delete
  product: windows
modified: 2022/06/02
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1490/T1490.md#atomic-test-6---windows---delete-backup-files
status: experimental
tags:
- attack.impact
- attack.t1490
title: Deletes Backup Files
