author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
category: file_delete
date: 2020/05/02
description: A General detection to trigger for the deletion of files by Sysinternals
  SDelete. It looks for the common name pattern used to rename files.
detection:
  condition: selection
  selection:
    winlog.event_data.TargetFilename|endswith:
    - .AAA
    - .ZZZ
falsepositives:
- Legitime usage of SDelete
id: 6ddab845-b1b8-49c2-bbf7-1a11967f64bc
level: medium
logsource:
  category: file_delete
  product: windows
modified: 2021/11/27
product: windows
references:
- https://github.com/OTRF/detection-hackathon-apt29/issues/9
- https://threathunterplaybook.com/evals/apt29/detections/4.B.4_83D62033-105A-4A02-8B75-DAB52D8D51EC.html
status: test
tags:
- attack.defense_evasion
- attack.t1070.004
title: Sysinternals SDelete File Deletion
