author: Cedric MAURUGEON
category: file_delete
date: 2021/09/29
description: Detects the deletion of a prefetch file (AntiForensic)
detection:
  condition: selection and not exception
  exception:
    winlog.event_data.Image: C:\windows\system32\svchost.exe
    winlog.event_data.User: NT AUTHORITY\SYSTEM
  selection:
    winlog.event_data.TargetFilename|endswith: .pf
    winlog.event_data.TargetFilename|startswith: C:\Windows\Prefetch\
falsepositives:
- Unknown
id: 0a1f9d29-6465-4776-b091-7f43b26e4c89
level: high
logsource:
  category: file_delete
  product: windows
product: windows
status: experimental
tags:
- attack.defense_evasion
- attack.t1070.004
title: Prefetch File Deletion
