author: Bhabesh Raj
category: file_delete
date: 2021/07/01
description: Detect DLL deletions from Spooler Service driver folder
detection:
  condition: selection
  selection:
    winlog.event_data.Image|endswith: spoolsv.exe
    winlog.event_data.TargetFilename|contains: C:\Windows\System32\spool\drivers\x64\3\
falsepositives:
- Unknown
id: 5b2bbc47-dead-4ef7-8908-0cf73fcbecbf
level: high
logsource:
  category: file_delete
  product: windows
modified: 2021/08/24
product: windows
references:
- https://github.com/hhlxf/PrintNightmare
- https://github.com/cube0x0/CVE-2021-1675
status: experimental
tags:
- attack.persistence
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1574
- cve.2021.1675
title: Windows Spooler Service Suspicious File Deletion
