author: Alexandr Yampolskyi, SOC Prime
date: 2019/03/19
description: Host Without Firewall. Alert means not complied. Sigma for Qualys vulnerability
  scanner. Scan type - Vulnerability Management.
detection:
  condition: selection
  selection:
    event.category: Security Policy
    host.scan.vuln_name: Firewall Product Not Detected*
id: 6b2066c8-3dc7-4db7-9db0-6cc1d7b0dde9
level: low
logsource:
  product: qualys
modified: 2021/05/30
product: qualys
references:
- https://www.cisecurity.org/controls/cis-controls-list/
- https://www.pcisecuritystandards.org/documents/PCI_DSS_v3-2-1.pdf
- https://nvlpubs.nist.gov/nistpubs/CSWP/NIST.CSWP.04162018.pdf
status: stable
title: Host Without Firewall
