author: Diego Perez (@darkquassar), Markus Neis, Swisscom (Improve Rule)
category: process_creation
date: 2019/02/22
description: Detection for mshta.exe suspicious execution patterns sometimes involving
  file polyglotism
detection:
  condition: selection1
  selection1:
    winlog.event_data.CommandLine|contains:
    - vbscript
    - .jpg
    - .png
    - .lnk
    - .xls
    - .doc
    - .zip
    winlog.event_data.Image|endswith: \mshta.exe
falsepositives:
- False positives depend on scripts and administrative tools used in the monitored
  environment
id: cc7abbd0-762b-41e3-8a26-57ad50d2eea3
level: high
logsource:
  category: process_creation
  product: windows
modified: 2020/08/23
product: windows
references:
- http://blog.sevagas.com/?Hacking-around-HTA-files
- https://0x00sec.org/t/clientside-exploitation-in-2018-how-pentesting-has-changed/7356
- https://docs.microsoft.com/en-us/dotnet/standard/data/xml/xslt-stylesheet-scripting-using-msxsl-script
- https://medium.com/tsscyber/pentesting-and-hta-bypassing-powershell-constrained-language-mode-53a42856c997
status: experimental
tags:
- attack.defense_evasion
- attack.t1140
- attack.t1218.005
title: MSHTA Suspicious Execution 01
