author: Roberto Rodriguez @Cyb3rWard0g
date: 2019/08/10
description: Detects anyone attempting a backup for the DPAPI Master Key. This events
  gets generated at the source and not the Domain Controller.
detection:
  condition: selection
  selection:
    winlog.event_id: 4692
falsepositives:
- Unknown
fields:
- winlog.ComputerName
- winlog.event_data.SubjectDomainName
- winlog.event_data.SubjectUserName
id: 39a94fd1-8c9a-4ff6-bf22-c058762f8014
level: critical
logsource:
  product: windows
  service: security
product: windows
references:
- https://threathunterplaybook.com/notebooks/windows/06_credential_access/WIN-190620024610.html
service: security
status: experimental
tags:
- attack.credential_access
- attack.t1003.004
title: DPAPI Domain Master Key Backup Attempt
