author: Samir Bousseaden
date: 2019/04/03
definition: The advanced audit policy setting "Object Access > Audit Detailed File
  Share" must be configured for Success/Failure
description: This detection excludes known namped pipes accessible remotely and notify
  on newly observed ones, may help to detect lateral movement and remote exec using
  named pipes
detection:
  condition: selection1 and not selection2
  selection1:
    winlog.event_data.ShareName: \\*\IPC$
    winlog.event_id: 5145
  selection2:
    winlog.event_data.RelativeTargetName:
    - atsvc
    - samr
    - lsarpc
    - winreg
    - netlogon
    - srvsvc
    - protected_storage
    - wkssvc
    - browser
    - netdfs
    - svcctl
    - spoolss
    - ntsvcs
    - LSM_API_service
    - HydraLsPipe
    - TermSrv_API_service
    - MsFteWds
    winlog.event_data.ShareName: \\*\IPC$
    winlog.event_id: 5145
falsepositives:
- update the excluded named pipe to filter out any newly observed legit named pipe
id: 52d8b0c6-53d6-439a-9e41-52ad442ad9ad
level: high
logsource:
  definition: The advanced audit policy setting "Object Access > Audit Detailed File
    Share" must be configured for Success/Failure
  product: windows
  service: security
product: windows
references:
- https://twitter.com/menasec1/status/1104489274387451904
service: security
tags:
- attack.lateral_movement
- attack.t1021.002
title: First Time Seen Remote Named Pipe
