author: Samir Bousseaden
date: 2019/02/16
description: Detects svchost hosting RDP termsvcs communicating with the loopback
  address
detection:
  condition: selection and ( sourceRDP or destinationRDP )
  destinationRDP:
    DestPort: 3389
    SourceAddress:
    - 127.*
    - ::1
  selection:
    winlog.event_id: 5156
  sourceRDP:
    DestAddress:
    - 127.*
    - ::1
    winlog.event_data.SourcePort: 3389
falsepositives:
- unknown
id: 5bed80b6-b3e8-428e-a3ae-d3c757589e41
level: high
logsource:
  product: windows
  service: security
modified: 2021/07/06
product: windows
references:
- https://twitter.com/SBousseaden/status/1096148422984384514
- https://github.com/sbousseaden/EVTX-ATTACK-SAMPLES/blob/master/Command%20and%20Control/DE_RDP_Tunnel_5156.evtx
service: security
status: experimental
tags:
- attack.defense_evasion
- attack.command_and_control
- attack.lateral_movement
- attack.t1090.001
- attack.t1090.002
- attack.t1021.001
- car.2013-07-002
title: RDP over Reverse SSH Tunnel WFP
