author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2020/07/14
description: Potential threat actor tampering with Sysmon manifest and eventually
  disabling it
detection:
  condition: selection1 or selection2
  selection1:
    NewValue: '0'
    winlog.event_data.ObjectName|contains:
    - WINEVT\Publishers\{5770385f-c22a-43e0-bf4c-06f5698ffbd9}
    - WINEVT\Channels\Microsoft-Windows-Sysmon/Operational
    winlog.event_data.ObjectValueName: Enabled
    winlog.event_id: 4657
  selection2:
    winlog.event_data.AccessMask: 65536
    winlog.event_data.ObjectName|contains:
    - WINEVT\Publishers\{5770385f-c22a-43e0-bf4c-06f5698ffbd9}
    - WINEVT\Channels\Microsoft-Windows-Sysmon/Operational
    winlog.event_id: 4663
falsepositives:
- unknown
id: 18beca67-ab3e-4ee3-ba7a-a46ca8d7d0cc
level: critical
logsource:
  product: windows
  service: security
product: windows
references:
- https://twitter.com/Flangvik/status/1283054508084473861
- https://twitter.com/SecurityJosh/status/1283027365770276866
- https://securityjosh.github.io/2020/04/23/Mute-Sysmon.html
- https://gist.github.com/Cyb3rWard0g/cf08c38c61f7e46e8404b38201ca01c8
service: security
status: experimental
tags:
- attack.defense_evasion
- attack.t1112
title: Sysmon Channel Reference Deletion
