author: Thomas Patzke
date: 2019/12/04
description: Detection of logins performed with WMI
detection:
  condition: selection
  selection:
    winlog.event_data.ProcessName|endswith: \WmiPrvSE.exe
    winlog.event_id: 4624
falsepositives:
- Monitoring tools
- Legitimate system administration
id: 5af54681-df95-4c26-854f-2565e13cfab0
level: low
logsource:
  product: windows
  service: security
product: windows
service: security
status: stable
tags:
- attack.execution
- attack.t1047
title: Login with WMI
