author: James Pemberton / @4A616D6573
date: 2019/10/31
description: Detects the creation of suspicious accounts similar to ANONYMOUS LOGON,
  such as using additional spaces. Created as an covering detection for exclusion
  of Logon Type 3 from ANONYMOUS LOGON accounts.
detection:
  condition: selection
  selection:
    SamAccountName|contains|all:
    - ANONYMOUS
    - LOGON
    winlog.event_id: 4720
falsepositives:
- Unknown
id: 1bbf25b9-8038-4154-a50b-118f2a32be27
level: high
logsource:
  product: windows
  service: security
modified: 2021/07/06
product: windows
references:
- https://twitter.com/SBousseaden/status/1189469425482829824
service: security
status: experimental
tags:
- attack.persistence
- attack.t1136.001
- attack.t1136.002
title: Suspicious Windows ANONYMOUS LOGON Local Account Created
