author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research), MSTIC
date: 2021/08/26
description: 'This detection uses Windows security events to detect suspicious access
  attempts to the registry key of Azure AD Health monitoring agent.

  This detection requires an access control entry (ACE) on the system access control
  list (SACL) of the following securable object HKLM\SOFTWARE\Microsoft\Microsoft
  Online\Reporting\MonitoringAgent.

  '
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.ProcessName|contains:
    - Microsoft.Identity.Health.Adfs.DiagnosticsAgent.exe
    - Microsoft.Identity.Health.Adfs.InsightsService.exe
    - Microsoft.Identity.Health.Adfs.MonitoringAgent.Startup.exe
    - Microsoft.Identity.Health.Adfs.PshSurrogate.exe
    - Microsoft.Identity.Health.Common.Clients.ResourceMonitor.exe
  selection:
    winlog.event_data.ObjectName: \REGISTRY\MACHINE\SOFTWARE\Microsoft\Microsoft Online\Reporting\MonitoringAgent
    winlog.event_data.ObjectType: Key
    winlog.event_id:
    - 4656
    - 4663
falsepositives:
- Unknown
id: ff151c33-45fa-475d-af4f-c2f93571f4fe
level: medium
logsource:
  product: windows
  service: security
product: windows
references:
- https://o365blog.com/post/hybridhealthagent/
- https://github.com/OTRF/Set-AuditRule/blob/master/rules/registry/aad_connect_health_monitoring_agent.yml
service: security
status: experimental
tags:
- attack.discovery
- attack.t1012
title: Azure AD Health Monitoring Agent Registry Keys Access
