author: Daniel Bohannon (@Mandiant/@FireEye), oscd.community
date: 2019/11/08
description: "Detects all variations of obfuscated powershell IEX invocation code\
  \ generated by Invoke-Obfuscation framework from the following code block \u2014\
  \ https://github.com/danielbohannon/Invoke-Obfuscation/blob/master/Out-ObfuscatedStringCommand.ps1#L873-L888"
detection:
  condition: selection and selection_1
  selection:
    winlog.event_id: 4697
  selection_1:
  - winlog.event_data.ServiceFileName|re: \$PSHome\[\s*\d{1,3}\s*\]\s*\+\s*\$PSHome\[
  - winlog.event_data.ServiceFileName|re: \$ShellId\[\s*\d{1,3}\s*\]\s*\+\s*\$ShellId\[
  - winlog.event_data.ServiceFileName|re: \$env:Public\[\s*\d{1,3}\s*\]\s*\+\s*\$env:Public\[
  - winlog.event_data.ServiceFileName|re: \$env:ComSpec\[(\s*\d{1,3}\s*,){2}
  - winlog.event_data.ServiceFileName|re: \\*mdr\*\W\s*\)\.Name
  - winlog.event_data.ServiceFileName|re: \$VerbosePreference\.ToString\(
  - winlog.event_data.ServiceFileName|re: \String\]\s*\$VerbosePreference
falsepositives:
- Unknown
id: fd0f5778-d3cb-4c9a-9695-66759d04702a
level: high
logsource:
  product: windows
  service: security
modified: 2021/09/16
product: windows
related:
- id: 51aa9387-1c53-4153-91cc-d73c59ae1ca9
  type: derived
service: security
status: experimental
tags:
- attack.defense_evasion
- attack.t1027
title: Invoke-Obfuscation Obfuscated IEX Invocation
