author: Daniil Yugoslavskiy, Ian Davis, oscd.community
date: 2019/10/24
description: Well-known TAP software installation. Possible preparation for data exfiltration
  using tunnelling techniques
detection:
  condition: selection
  selection:
    winlog.event_data.ServiceFileName|contains: tap0901
    winlog.event_id: 4697
falsepositives:
- Legitimate OpenVPN TAP insntallation
id: 9c8afa4d-0022-48f0-9456-3712466f9701
level: medium
logsource:
  product: windows
  service: security
modified: 2021/09/21
product: windows
related:
- id: 8e4cf0e5-aa5d-4dc3-beff-dc26917744a9
  type: derived
service: security
status: experimental
tags:
- attack.exfiltration
- attack.t1048
title: Tap Driver Installation
