author: Florian Roth
date: 2017/02/19
description: This detection method points out highly relevant Antivirus events
detection:
  condition: keywords and not filter
  filter:
  - Keygen
  - Crack
  keywords:
  - HTool-
  - Hacktool
  - ASP/Backdoor
  - JSP/Backdoor
  - PHP/Backdoor
  - Backdoor.ASP
  - Backdoor.JSP
  - Backdoor.PHP
  - Webshell
  - Portscan
  - Mimikatz
  - WinCred
  - PlugX
  - Korplug
  - Pwdump
  - Chopper
  - WmiExec
  - Xscan
  - Clearlog
  - ASPXSpy
falsepositives:
- Some software piracy tools (key generators, cracks) are classified as hack tools
id: 78bc5783-81d9-4d73-ac97-59f6db4f72a8
level: high
logsource:
  product: windows
  service: application
modified: 2021/07/28
product: windows
service: application
tags:
- attack.resource_development
- attack.t1588
title: Relevant Anti-Virus Event
