author: Max Altgelt
date: 2022/04/06
description: Detects logon events that specify new credentials
detection:
  condition: selection
  selection:
    winlog.event_data.LogonType: 9
    winlog.event_id: 4624
falsepositives:
- Legitimate remote administration activity
id: def8b624-e08f-4ae1-8612-1ba21190da6b
level: low
logsource:
  product: windows
  service: security
product: windows
references:
- https://go.recordedfuture.com/hubfs/reports/mtp-2021-0914.pdf
service: security
status: experimental
title: Outgoing Logon with New Credentials
