author: Dimitrios Slamaris
date: 2017/06/09
description: Detects a possible remote NTLM hash change through SAMR API SamiChangePasswordUser()
  or SamSetInformationUser(). "Audit User Account Management" in "Advanced Audit Policy
  Configuration" has to be enabled in your local security policy / GPO to see this
  events.
detection:
  condition: ( passwordchanged and not passwordchanged_filter ) | near samrpipe
  passwordchanged:
    winlog.event_id: 4738
  passwordchanged_filter:
    PasswordLastSet: null
  samrpipe:
    winlog.event_data.RelativeTargetName: samr
    winlog.event_id: 5145
  timeframe: 15s
id: 7818b381-5eb1-4641-bea5-ef9e4cfb5951
level: medium
logsource:
  product: windows
  service: security
product: windows
service: security
tags:
- attack.credential_access
- attack.t1212
title: Possible Remote Password Change Through SAMR
