author: Jonathan Cheong, oscd.community
date: 2020/10/13
description: Detects Obfuscated use of Clip.exe to execute PowerShell
detection:
  condition: selection and selection_eventid
  selection:
    winlog.event_data.ImagePath|re: .*cmd.{0,5}(?:\/c|\/r).+clip(?:\.exe)?.{0,4}&&.+clipboard]::\(\s\\\"\{\d\}.+\-f.+\"
  selection_eventid:
    winlog.event_id: 7045
falsepositives:
- Unknown
id: f7385ee2-0e0c-11eb-adc1-0242ac120002
level: high
logsource:
  product: windows
  service: system
modified: 2021/09/16
product: windows
references:
- https://github.com/Neo23x0/sigma/issues/1009
service: system
status: experimental
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
title: Invoke-Obfuscation CLIP+ Launcher
