author: Nikita Nazarov, oscd.community
date: 2020/10/16
definition: Script block logging must be enabled
description: Adversaries may attempt to enumerate software for a variety of reasons,
  such as figuring out what security measures are present or if the compromised system
  has a version of software that is vulnerable.
detection:
  condition: selection
  selection:
    winlog.event_data.ScriptBlockText|contains|all:
    - get-itemProperty
    - \software\
    - select-object
    - format-table
    winlog.event_id: 4104
falsepositives:
- Legitimate administration activities
id: 2650dd1a-eb2a-412d-ac36-83f06c4f2282
level: medium
logsource:
  definition: Script block logging must be enabled
  product: windows
  service: powershell
modified: 2021/09/21
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1518/T1518.md
- https://github.com/harleyQu1nn/AggressorScripts
service: powershell
status: experimental
tags:
- attack.discovery
- attack.t1518
title: Detected Windows Software Discovery
