author: Bartlomiej Czyz, Relativity
date: 2021/01/21
description: Detects usage of Metasploit SMB PsExec (exploit/windows/smb/psexec) and
  Impacket psexec.py by triggering on specific service installation
detection:
  condition: selection and selection_1 and not filter
  filter:
    winlog.event_data.ServiceName: PSEXESVC
  selection:
    winlog.event_id: 4697
  selection_1:
    ServiceStartType: '3'
    ServiceType: '0x10'
    winlog.event_data.ServiceFileName|re: ^%systemroot%\\[a-zA-Z]{8}\.exe$
    winlog.event_data.ServiceName|re: (^[a-zA-Z]{4}$)|(^[a-zA-Z]{8}$)|(^[a-zA-Z]{16}$)
falsepositives:
- Possible, different agents with a 8 character binary and a 4, 8 or 16 character
  service name
fields:
- winlog.ComputerName
- winlog.event_data.SubjectDomainName
- winlog.event_data.SubjectUserName
- winlog.event_data.ServiceName
- winlog.event_data.ServiceFileName
id: 6fb63b40-e02a-403e-9ffd-3bcc1d749442
level: high
logsource:
  product: windows
  service: security
modified: 2021/07/23
product: windows
references:
- https://bczyz1.github.io/2021/01/30/psexec.html
related:
- id: 1a17ce75-ff0d-4f02-9709-2b7bb5618cf0
  type: derived
service: security
tags:
- attack.lateral_movement
- attack.t1021.002
- attack.t1570
- attack.execution
- attack.t1569.002
title: Metasploit Or Impacket Service Installation Via SMB PsExec
