author: Teymur Kheirkhabarov, Ecco, Florian Roth
date: 2019/10/26
description: Detects the use of getsystem Meterpreter/Cobalt Strike command by detecting
  a specific service installation
detection:
  condition: selection_id and selection
  selection:
  - winlog.event_data.ServiceFileName|contains|all:
    - cmd
    - /c
    - echo
    - \pipe\
  - winlog.event_data.ServiceFileName|contains|all:
    - '%COMSPEC%'
    - /c
    - echo
    - \pipe\
  - winlog.event_data.ServiceFileName|contains|all:
    - cmd.exe
    - /c
    - echo
    - \pipe\
  - winlog.event_data.ServiceFileName|contains|all:
    - rundll32
    - .dll,a
    - '/p:'
  selection_id:
    winlog.event_id: 4697
falsepositives:
- Highly unlikely
fields:
- winlog.ComputerName
- winlog.event_data.SubjectDomainName
- winlog.event_data.SubjectUserName
- winlog.event_data.ServiceFileName
id: ecbc5e16-58e0-4521-9c60-eb9a7ea4ad34
level: critical
logsource:
  product: windows
  service: security
modified: 2021/09/21
product: windows
references:
- https://speakerdeck.com/heirhabarov/hunting-for-privilege-escalation-in-windows-environment
- https://blog.cobaltstrike.com/2014/04/02/what-happens-when-i-type-getsystem/
related:
- id: 843544a7-56e0-4dcc-a44f-5cc266dd97d6
  type: derived
service: security
tags:
- attack.privilege_escalation
- attack.t1134.001
- attack.t1134.002
title: Meterpreter or Cobalt Strike Getsystem Service Installation
