author: '@neu5ron'
date: 2019/02/05
definition: 'Requirements: Audit Policy : System > Audit Security State Change, Group
  Policy : Computer Configuration\Windows Settings\Security Settings\Advanced Audit
  Policy Configuration\Audit Policies\System\Audit Security State Change'
description: Detect scenarios where a potentially unauthorized application or user
  is modifying the system time.
detection:
  condition: selection and not ( filter1 or filter2 or filter3 )
  filter1:
    winlog.event_data.ProcessName: C:\Program Files\VMware\VMware Tools\vmtoolsd.exe
  filter2:
    winlog.event_data.ProcessName: C:\Windows\System32\VBoxService.exe
  filter3:
    winlog.event_data.ProcessName: C:\Windows\System32\svchost.exe
    winlog.event_data.SubjectUserSid: S-1-5-19
  selection:
    winlog.event_id: 4616
falsepositives:
- HyperV or other virtualization technologies with binary not listed in filter portion
  of detection
id: faa031b5-21ed-4e02-8881-2591f98d82ed
level: medium
logsource:
  definition: 'Requirements: Audit Policy : System > Audit Security State Change,
    Group Policy : Computer Configuration\Windows Settings\Security Settings\Advanced
    Audit Policy Configuration\Audit Policies\System\Audit Security State Change'
  product: windows
  service: security
modified: 2020/01/27
product: windows
references:
- Private Cuckoo Sandbox (from many years ago, no longer have hash, NDA as well)
- Live environment caused by malware
- https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4616
service: security
status: experimental
tags:
- attack.defense_evasion
- attack.t1070.006
title: Unauthorized System Time Modification
