author: Florian Roth
date: 2017/05/09
description: This rule detects a suspicious crash of the Microsoft Malware Protection
  Engine
detection:
  condition: 1 of selection* and all of keywords
  keywords:
  - MsMpEng.exe
  - mpengine.dll
  selection1:
    Provider_Name: Application Error
    winlog.event_id: 1000
  selection2:
    Provider_Name: Windows Error Reporting
    winlog.event_id: 1001
falsepositives:
- MsMpEng.exe can crash when C:\ is full
id: 6c82cf5c-090d-4d57-9188-533577631108
level: high
logsource:
  product: windows
  service: application
modified: 2021/10/13
product: windows
references:
- https://bugs.chromium.org/p/project-zero/issues/detail?id=1252&desc=5
- https://technet.microsoft.com/en-us/library/security/4022344
service: application
status: experimental
tags:
- attack.defense_evasion
- attack.t1211
- attack.t1562.001
title: Microsoft Malware Protection Engine Crash
