author: Roberto Rodriguez @Cyb3rWard0g, Open Threat Research (OTR)
date: 2020/10/20
description: Detects the registration of the security event source VSSAudit. It would
  usually trigger when volume shadow copy operations happen.
detection:
  condition: selection_one or selection_two
  selection_one:
    AuditSourceName: VSSAudit
    winlog.event_id: 4904
  selection_two:
    AuditSourceName: VSSAudit
    winlog.event_id: 4905
falsepositives:
- Legitimate use of VSSVC. Maybe backup operations. It would usually be done by C:\Windows\System32\VSSVC.exe.
id: e9faba72-4974-4ab2-a4c5-46e25ad59e9b
level: medium
logsource:
  product: windows
  service: security
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1003.002/T1003.002.md#atomic-test-3---esentutlexe-sam-copy
service: security
status: experimental
tags:
- attack.credential_access
- attack.t1003.002
title: VSSAudit Security Event Source Registration
