author: Mauricio Velazco, Michael Haag
date: 2021/09/02
definition: The advanced audit policy setting "Object Access > Detailed File Share"
  must be configured for Success/Failure
description: Detect PetitPotam coerced authentication activity.
detection:
  condition: selection
  selection:
    winlog.event_data.RelativeTargetName: lsarpc
    winlog.event_data.ShareName|endswith: \IPC$
    winlog.event_data.ShareName|startswith: \\
    winlog.event_data.SubjectUserName: ANONYMOUS LOGON
    winlog.event_id: 5145
falsepositives:
- Unknown. Feedback welcomed.
id: 1ce8c8a3-2723-48ed-8246-906ac91061a6
level: high
logsource:
  definition: The advanced audit policy setting "Object Access > Detailed File Share"
    must be configured for Success/Failure
  product: windows
  service: security
product: windows
references:
- https://github.com/topotam/PetitPotam
- https://github.com/splunk/security_content/blob/0dd6de32de2118b2818550df9e65255f4109a56d/detections/endpoint/petitpotam_network_share_access_request.yml
service: security
tags:
- attack.credential_access
- attack.t1187
title: Possible PetitPotam Coerce Authentication Attempt
