author: Teymur Kheirkhabarov, oscd.community
date: 2019/10/22
description: Remote registry management using REG utility from non-admin workstation
detection:
  condition: selection_1 and not selection_2
  selection_1:
    winlog.event_data.RelativeTargetName|contains: \winreg
    winlog.event_id: 5145
  selection_2:
    winlog.event_data.IpAddress: '%Admins_Workstations%'
falsepositives:
- Legitimate usage of remote registry management by administrator
id: 68fcba0d-73a5-475e-a915-e8b4c576827e
level: medium
logsource:
  product: windows
  service: security
modified: 2020/08/23
product: windows
references:
- https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
service: security
status: experimental
tags:
- attack.defense_evasion
- attack.t1112
- attack.discovery
- attack.t1012
- attack.credential_access
- attack.t1552.002
- attack.s0075
title: Remote Registry Management Using Reg Utility
