author: Mauricio Velazco
date: 2021/06/01
description: Detects failed logins with multiple invalid domain accounts from a single
  source system using the NTLM protocol.
detection:
  condition:
  - selection1 and not filter | count(TargetUserName) by Workstation > 10
  filter:
    winlog.event_data.TargetUserName: '*$'
  selection1:
    winlog.event_data.Status: '*0xC0000064'
    winlog.event_id: 4776
  timeframe: 24h
falsepositives:
- Terminal servers
- Jump servers
- Other multiuser systems like Citrix server farms
- Workstations with frequently changing users
id: 56d62ef8-3462-4890-9859-7b41e541f8d5
level: medium
logsource:
  product: windows
  service: security
modified: 2021/07/07
product: windows
references:
- https://docs.splunk.com/Documentation/ESSOC/3.22.0/stories/UseCase#Active_directory_password_spraying
service: security
tags:
- attack.t1110.003
- attack.initial_access
- attack.privilege_escalation
title: Invalid Users Failing To Authenticate From Single Source Using NTLM
