author: Roberto Rodriguez @Cyb3rWard0g, Open Threat Research (OTR)
date: 2020/10/12
description: Detects a threat actor creating a file named `wbemcomn.dll` in the `C:\Windows\System32\wbem\`
  directory over the network for a WMI DLL Hijack scenario.
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.SubjectUserName|endswith: $
  selection:
    winlog.event_data.RelativeTargetName|endswith: \wbem\wbemcomn.dll
    winlog.event_id: 5145
falsepositives:
- Unknown
id: f6c68d5f-e101-4b86-8c84-7d96851fd65c
level: critical
logsource:
  product: windows
  service: security
product: windows
references:
- https://threathunterplaybook.com/notebooks/windows/08_lateral_movement/WIN-201009173318.html
service: security
status: experimental
tags:
- attack.execution
- attack.t1047
- attack.lateral_movement
- attack.t1021.002
title: T1047 Wmiprvse Wbemcomn DLL Hijack
