author: Maxime Thiebaut (@0xThiebaut)
date: 2020/03/30
definition: Requires the "Read all properties" permission on the user object to be
  audited for the "Everyone" principal
description: Detects access to a domain user from a non-machine account
detection:
  condition: selection and not filter
  filter:
  - winlog.event_data.SubjectUserName|endswith: $
  - winlog.event_data.SubjectUserName|startswith: MSOL_
  selection:
    winlog.event_data.ObjectType|contains: bf967aba-0de6-11d0-a285-00aa003049e2
    winlog.event_id: 4662
falsepositives:
- Administrators configuring new users.
id: ab6bffca-beff-4baa-af11-6733f296d57a
level: medium
logsource:
  definition: Requires the "Read all properties" permission on the user object to
    be audited for the "Everyone" principal
  product: windows
  service: security
modified: 2021/08/09
product: windows
references:
- https://www.specterops.io/assets/resources/an_ace_up_the_sleeve.pdf
- http://www.stuffithoughtiknew.com/2019/02/detecting-bloodhound.html
- https://docs.microsoft.com/en-us/windows/win32/adschema/attributes-all
service: security
status: experimental
tags:
- attack.discovery
- attack.t1087.002
title: AD User Enumeration
