author: Teymur Kheirkhabarov, oscd.community
category: raw_access_thread
date: 2019/10/22
description: Raw disk access using illegitimate tools, possible defence evasion
detection:
  condition: not filter_1 and not filter_2
  filter_1:
    winlog.event_data.Device|contains: floppy
  filter_2:
    winlog.event_data.Image|endswith:
    - \wmiprvse.exe
    - \sdiagnhost.exe
    - \searchindexer.exe
    - \csrss.exe
    - \defrag.exe
    - \smss.exe
    - \vssvc.exe
    - \compattelrunner.exe
    - \wininit.exe
    - \autochk.exe
    - \taskhost.exe
    - \dfsrs.exe
    - \vds.exe
    - \lsass.exe
falsepositives:
- Legitimate Administrator using tool for raw access or ongoing forensic investigation
fields:
- winlog.ComputerName
- winlog.event_data.Image
- winlog.event_data.ProcessId
- winlog.event_data.Device
id: db809f10-56ce-4420-8c86-d6a7d793c79c
level: medium
logsource:
  category: raw_access_thread
  product: windows
modified: 2021/08/14
product: windows
references:
- https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
status: experimental
tags:
- attack.defense_evasion
- attack.t1006
title: Raw Disk Access Using Illegitimate Tools
