author: Teymur Kheirkhabarov, oscd.community
category: raw_access_thread
date: 2019/10/22
description: Raw disk access using illegitimate tools, possible defence evasion
detection:
  condition: not 1 of filter_*
  filter_1:
    winlog.event_data.Device|contains: floppy
  filter_2:
    winlog.event_data.Image|startswith:
    - C:\Windows\System32\
    - C:\Windows\SystemApps\
    - C:\Windows\WinSxS\
    - C:\Windows\servicing\
    - C:\Windows\CCM\
    - C:\Windows\uus\
    - C:\Windows\WinSxs\
  filter_3:
    ProcessId: 4
  filter_Keybase:
    winlog.event_data.Image|endswith: \Keybase\upd.exe
  filter_appdata:
    winlog.event_data.Image|contains|all:
    - C:\Users\
    - \AppData\
    - \Microsoft\
  filter_nextron:
    winlog.event_data.Image|endswith: \thor.exe
    winlog.event_data.Image|startswith: C:\Windows\Temp\asgard2-agent\
  filter_programfiles:
    winlog.event_data.Image|startswith:
    - C:\Program Files\
    - C:\Program Files (x86)\
  filter_specific:
    winlog.event_data.Image:
    - C:\Windows\UUS\amd64\MoUsoCoreWorker.exe
    - C:\Windows\explorer.exe
  filter_startmenu_xphost:
    winlog.event_data.Image|endswith: \StartMenuExperienceHost.exe
    winlog.event_data.Image|startswith: C:\Windows\SystemApps\Microsoft.Windows.StartMenuExperienceHost
  filter_system:
    winlog.event_data.Image:
    - System
    - Registry
  filter_windefender:
    winlog.event_data.Image|endswith: \MsMpEng.exe
    winlog.event_data.Image|startswith: C:\ProgramData\Microsoft\Windows Defender\Platform\
falsepositives:
- Legitimate Administrator using tool for raw access or ongoing forensic investigation
fields:
- winlog.ComputerName
- winlog.event_data.Image
- winlog.event_data.ProcessId
- winlog.event_data.Device
id: db809f10-56ce-4420-8c86-d6a7d793c79c
level: low
logsource:
  category: raw_access_thread
  product: windows
modified: 2022/03/15
product: windows
references:
- https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
status: test
tags:
- attack.defense_evasion
- attack.t1006
title: Raw Disk Access Using Illegitimate Tools
