author: Austin Songer @austinsonger
date: 2021/08/08
description: Identifies when a network security configuration is modified or deleted.
detection:
  condition: selection
  selection:
    properties.message:
    - MICROSOFT.NETWORK/NETWORKSECURITYGROUPS/WRITE
    - MICROSOFT.NETWORK/NETWORKSECURITYGROUPS/DELETE
    - MICROSOFT.NETWORK/NETWORKSECURITYGROUPS/SECURITYRULES/WRITE
    - MICROSOFT.NETWORK/NETWORKSECURITYGROUPS/SECURITYRULES/DELETE
    - MICROSOFT.NETWORK/NETWORKSECURITYGROUPS/JOIN/ACTION
    - MICROSOFT.NETWORK/NETWORKSECURITYGROUPS/PROVIDERS/MICROSOFT.INSIGHTS/DIAGNOSTICSETTINGS/WRITE
falsepositives:
- Network Security Configuration being modified or deleted may be performed by a system
  administrator. Verify whether the user identity, user agent, and/or hostname should
  be making changes in your environment.
- Network Security Configuration modified or deleted from unfamiliar users should
  be investigated. If known behavior is causing false positives, it can be exempted
  from the rule.
id: d22b4df4-5a67-4859-a578-8c9a0b5af9df
level: medium
logsource:
  service: azure.activitylogs
references:
- https://docs.microsoft.com/en-us/azure/role-based-access-control/resource-provider-operations
service: azure.activitylogs
status: experimental
tags:
- attack.impact
title: Azure Network Security Configuration Modified or Deleted
