author: Austin Songer
date: 2021/08/16
description: Identifies when a application security group is modified or deleted.
detection:
  condition: selection
  selection:
    properties.message:
    - MICROSOFT.NETWORK/APPLICATIONSECURITYGROUPS/WRITE
    - MICROSOFT.NETWORK/APPLICATIONSECURITYGROUPS/DELETE
falsepositives:
- Application security group being modified or deleted may be performed by a system
  administrator.
- Verify whether the user identity, user agent, and/or hostname should be making changes
  in your environment.
- Application security group modified or deleted from unfamiliar users should be investigated.
  If known behavior is causing false positives, it can be exempted from the rule.
id: 835747f1-9329-40b5-9cc3-97d465754ce6
level: medium
logsource:
  service: azure.activitylogs
references:
- https://docs.microsoft.com/en-us/azure/role-based-access-control/resource-provider-operations
service: azure.activitylogs
status: experimental
tags:
- attack.impact
title: Azure Application Security Group Modified or Deleted
