author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research), MSTIC
date: 2021/08/26
description: 'This detection uses AzureActivity logs (Administrative category) to
  identify the deletion of an Azure AD Hybrid health AD FS service instance in a tenant.

  A threat actor can create a new AD Health ADFS service and create a fake server
  to spoof AD FS signing logs.

  The health AD FS service can then be deleted after it is not longer needed via HTTP
  requests to Azure.

  '
detection:
  condition: selection
  selection:
    CategoryValue: Administrative
    OperationNameValue: Microsoft.ADHybridHealthService/services/delete
    ResourceId|contains: AdFederationService
    ResourceProviderValue: Microsoft.ADHybridHealthService
falsepositives:
- legitimate AAD Health AD FS service instances being deleted in a tenant
id: 48739819-8230-4ee3-a8ea-e0289d1fb0ff
level: medium
logsource:
  service: AzureActivity
references:
- https://o365blog.com/post/hybridhealthagent/
service: AzureActivity
status: experimental
tags:
- attack.defense_evasion
- attack.t1578.003
title: Azure Active Directory Hybrid Health AD FS Service Delete
