author: Alina Stepchenkova, Group-IB, oscd.community
date: 2019/11/01
description: Detects Silence empireDNSagent
detection:
  condition: empire and dnscat
  dnscat:
    winlog.event_data.ScriptBlockText|contains|all:
    - set type=$LookupType`nserver
    - $Command | nslookup 2>&1 | Out-String
    - New-RandomDNSField
    - '[Convert]::ToString($SYNOptions, 16)'
    - $Session.Dead = $True
    - $Session["Driver"] -eq
  empire:
    winlog.event_data.ScriptBlockText|contains|all:
    - System.Diagnostics.Process
    - Stop-Computer
    - Restart-Computer
    - Exception in execution
    - $cmdargs
    - Close-Dnscat2Tunnel
falsepositives:
- Unknown
id: 3ceb2083-a27f-449a-be33-14ec1b7cc973
level: critical
logsource:
  product: windows
  service: powershell
modified: 2020/09/01
product: windows
service: powershell
status: experimental
tags:
- attack.execution
- attack.t1059.001
- attack.command_and_control
- attack.t1071.004
- attack.t1572
- attack.impact
- attack.t1529
- attack.g0091
- attack.s0363
title: Silence.EDA Detection
