author: Markus Neis
category: proxy
date: 2019/11/12
description: Detects Malleable OneDrive Profile
detection:
  condition: selection and not filter
  filter:
    http.url|contains: ://onedrive.live.com/
    http.url|startswith: http
  selection:
    http.hostname: onedrive.live.com
    http.http_method: GET
    http.url|endswith: ?manifest=wac
falsepositives:
- Unknown
id: c9b33401-cc6a-4cf6-83bb-57ddcb2407fc
level: high
logsource:
  category: proxy
  product: suricata
  service: http
modified: 2020/11/28
product: suricata
references:
- https://github.com/rsmudge/Malleable-C2-Profiles/blob/master/normal/onedrive_getonly.profile
service: http
status: experimental
tags:
- attack.defense_evasion
- attack.command_and_control
- attack.t1071.001
title: CobaltStrike Malleable OneDrive Browsing Traffic Profile
