author: Markus Neis
category: proxy
date: 2019/11/12
description: Detects Malleable Amazon Profile
detection:
  condition: selection1 or selection2
  selection1:
    cs-cookie|endswith: =csm-hit=s-24KU11BB82RZSYGJ3BDK|1419899012996
    http.hostname: www.amazon.com
    http.http_method: GET
    http.http_user_agent: Mozilla/5.0 (Windows NT 6.1; WOW64; Trident/7.0; rv:11.0)
      like Gecko
    http.url: /s/ref=nb_sb_noss_1/167-3294888-0262949/field-keywords=books
  selection2:
    http.hostname: www.amazon.com
    http.http_method: POST
    http.http_user_agent: Mozilla/5.0 (Windows NT 6.1; WOW64; Trident/7.0; rv:11.0)
      like Gecko
    http.url: /N4215/adj/amzn.us.sr.aps
falsepositives:
- Unknown
id: 953b895e-5cc9-454b-b183-7f3db555452e
level: high
logsource:
  category: proxy
  product: suricata
  service: http
modified: 2020/09/02
product: suricata
references:
- https://github.com/rsmudge/Malleable-C2-Profiles/blob/master/normal/amazon.profile
- https://www.hybrid-analysis.com/sample/ee5eca8648e45e2fea9dac0d920ef1a1792d8690c41ee7f20343de1927cc88b9?environmentId=100
service: http
status: experimental
tags:
- attack.defense_evasion
- attack.command_and_control
- attack.t1071.001
title: CobaltStrike Malleable Amazon Browsing Traffic Profile
