author: Thomas Patzke
category: proxy
date: 2019/11/12
description: Detects suspicious user agent string of APT40 Dropbox tool
detection:
  condition: selection
  selection:
    http.hostname: api.dropbox.com
    http.http_user_agent: Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML,
      like Gecko) Chrome/36.0.1985.143 Safari/537.36
falsepositives:
- Old browsers
fields:
- src_ip
- http.url
id: 5ba715b6-71b7-44fd-8245-f66893e81b3d
level: high
logsource:
  category: proxy
  product: suricata
  service: http
modified: 2020/09/02
product: suricata
references:
- Internal research from Florian Roth
service: http
status: experimental
tags:
- attack.command_and_control
- attack.t1071.001
- attack.exfiltration
- attack.t1567.002
title: APT40 Dropbox Tool User Agent
