author: Tobias Michalski
date: 2021/06/08
description: Detects a failed installation of a Exchange Transport Agent
detection:
  condition: selection
  selection:
    Data|contains: Install-TransportAgent
    winlog.event_id: 6
falsepositives:
- Legitimate installations of exchange TransportAgents. AssemblyPath is a good indicator
  for this.
fields:
- AssemblyPath
id: c7d16cae-aaf3-42e5-9c1c-fb8553faa6fa
level: high
logsource:
  product: windows
  service: msexchange-management
modified: 2022/07/12
product: windows
references:
- https://twitter.com/blueteamsec1/status/1401290874202382336?s=20
service: msexchange-management
status: experimental
tags:
- attack.persistence
- attack.t1505.002
title: Failed MSExchange Transport Agent Installation
