author: frack113
category: ps_script
date: 2021/08/23
definition: Script block logging must be enabled
description: Adversaries may attempt to gather information about attached peripheral
  devices and components connected to a computer system.
detection:
  condition: selection
  selection:
    winlog.event_data.ScriptBlockText|contains: Win32_PnPEntity
falsepositives:
- Admin script
id: b26647de-4feb-4283-af6b-6117661283c5
level: low
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
modified: 2021/10/16
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1120/T1120.md
status: experimental
tags:
- attack.discovery
- attack.t1120
title: Powershell Suspicious Win32_PnPEntity
