author: frack113
category: ps_script
date: 2022/01/15
definition: Script block logging must be enabled
description: Powershell Remove-Item  with -Path to delete a file or a folder with
  "-Recurse"
detection:
  condition: selection and not filter_reg
  filter_reg:
    winlog.event_data.ScriptBlockText|contains:
    - HKCU:\
    - HKLM:\
  selection:
    winlog.event_data.ScriptBlockText|contains|all:
    - Remove-Item
    - '-Path '
falsepositives:
- Legitimate PowerShell scripts
id: b8af5f36-1361-4ebe-9e76-e36128d947bf
level: low
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
modified: 2022/03/17
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1070.004/T1070.004.md
- https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.management/Remove-Item?view=powershell-5.1&viewFallbackFrom=powershell-7
status: experimental
tags:
- attack.defense_evasion
- attack.t1070.004
title: Use Remove-Item to Delete File
