author: Sean Metcalf (source), Florian Roth (rule)
category: ps_script
date: 2017/03/05
definition: Script block logging must be enabled
description: Detects the use of PSAttack PowerShell hack tool
detection:
  condition: selection
  selection:
    winlog.event_data.ScriptBlockText|contains: PS ATTACK!!!
falsepositives:
- Unknown
id: b7ec41a4-042c-4f31-a5db-d0fcde9fa5c5
level: high
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
modified: 2021/10/16
product: windows
references:
- https://adsecurity.org/?p=2921
status: experimental
tags:
- attack.execution
- attack.t1059.001
title: PowerShell PSAttack
