author: oscd.community, @redcanary, Zach Stanford @svch0st
category: ps_script
date: 2020/10/10
definition: Script block logging must be enabled
description: Adversaries may install a root certificate on a compromised system to
  avoid warnings when connecting to adversary controlled web servers.
detection:
  condition: 1 of selection*
  selection1:
    winlog.event_data.ScriptBlockText|contains|all:
    - Move-Item
    - Cert:\LocalMachine\Root
  selection2:
    winlog.event_data.ScriptBlockText|contains|all:
    - Import-Certificate
    - Cert:\LocalMachine\Root
falsepositives:
- Help Desk or IT may need to manually add a corporate Root CA on occasion. Need to
  test if GPO push doesn't trigger FP
id: 42821614-9264-4761-acfc-5772c3286f76
level: medium
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
modified: 2021/12/04
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1553.004/T1553.004.md
status: experimental
tags:
- attack.defense_evasion
- attack.t1553.004
title: Root Certificate Installed
