author: Florian Roth (rule)
category: ps_script
date: 2017/03/12
definition: Script block logging must be enabled
description: Detects suspicious PowerShell invocation command parameters
detection:
  condition: all of selection*
  selection_encoded:
    winlog.event_data.ScriptBlockText|contains:
    - ' -enc '
    - ' -EncodedCommand '
  selection_hidden:
    winlog.event_data.ScriptBlockText|contains:
    - ' -w hidden '
    - ' -window hidden '
    - ' -windowstyle hidden '
  selection_noninteractive:
    winlog.event_data.ScriptBlockText|contains:
    - ' -noni '
    - ' -noninteractive '
falsepositives:
- Very special / sneaky PowerShell scripts
id: ed965133-513f-41d9-a441-e38076a0798f
level: high
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
modified: 2021/12/02
product: windows
related:
- id: 3d304fda-78aa-43ed-975c-d740798a49c1
  type: derived
status: experimental
tags:
- attack.execution
- attack.t1059.001
title: Suspicious PowerShell Invocations - Generic
