author: frack113
category: ps_script
date: 2021/12/28
definition: Script block logging must be enabled
description: 'Adversaries may abuse Microsoft Office add-ins to obtain persistence
  on a compromised system.

  Office add-ins can be used to add functionality to Office programs

  '
detection:
  condition: selection
  selection:
    winlog.event_data.ScriptBlockText|contains|all:
    - 'new-object '
    - '-ComObject '
    - .application
    - .RegisterXLL
falsepositives:
- Unknown
id: 36fbec91-fa1b-4d5d-8df1-8d8edcb632ad
level: high
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1137.006/T1137.006.md
status: experimental
tags:
- attack.persistence
- attack.t1137.006
title: Code Executed Via Office Add-in XLL File
