author: frack113
category: ps_script
date: 2022/01/06
definition: Script block logging must be enabled
description: 'Adversaries may abuse PowerShell commands and scripts for execution.

  PowerShell is a powerful interactive command-line interface and scripting environment
  included in the Windows operating system

  '
detection:
  condition: selection
  selection:
    winlog.event_data.ScriptBlockText|contains|all:
    - New-PSSession
    - '-ComputerName '
falsepositives:
- Legitimate administrative script
id: a0edd39f-a0c6-4c17-8141-261f958e8d8f
level: medium
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1059.001/T1059.001.md#atomic-test-10---powershell-invoke-downloadcradle
- https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.core/new-pssession?view=powershell-7.2
status: experimental
tags:
- attack.execution
- attack.t1059.001
title: PowerShell Remote Session Creation
