author: frack113
category: ps_script
date: 2021/12/20
definition: Script block logging must be enabled
description: 'Adversaries may search for common password storage locations to obtain
  user credentials.

  Passwords are stored in several places on a system, depending on the operating system
  or application holding the credentials.

  '
detection:
  condition: 1 of selection_*
  selection_kiddie:
    winlog.event_data.ScriptBlockText|contains:
    - Get-PasswordVaultCredentials
    - Get-CredManCreds
  selection_rename_Password:
    winlog.event_data.ScriptBlockText|contains|all:
    - New-Object
    - Windows.Security.Credentials.PasswordVault
  selection_rename_credman:
    winlog.event_data.ScriptBlockText|contains|all:
    - New-Object
    - Microsoft.CSharp.CSharpCodeProvider
    - '[System.Runtime.InteropServices.RuntimeEnvironment]::GetRuntimeDirectory())'
    - Collections.ArrayList
    - System.CodeDom.Compiler.CompilerParameters
falsepositives:
- Unknown
id: 99c49d9c-34ea-45f7-84a7-4751ae6b2cbc
level: medium
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1555/T1555.md
status: experimental
tags:
- attack.credential_access
- attack.t1555
title: Dump Credentials from Windows Credential Manager With PowerShell
