author: frack113
category: ps_script
date: 2022/01/02
definition: Script block logging must be enabled
description: 'Adversaries may abuse the Windows command shell for execution.

  The Windows command shell ([cmd](https://attack.mitre.org/software/S0106)) is the
  primary command prompt on Windows systems.

  The Windows command prompt can be used to control almost any aspect of a system,
  with various permission levels required for different subsets of commands.

  Batch files (ex: .bat or .cmd) also provide the shell with a list of sequential
  commands to run, as well as normal scripting operations such as conditionals and
  loops.

  Common uses of batch files include long or repetitive tasks, or the need to run
  the same set of commands on multiple system

  '
detection:
  condition: all of selection_*
  selection_batch:
    winlog.event_data.ScriptBlockText|contains:
    - .cmd
    - .bat
  selection_start:
    winlog.event_data.ScriptBlockText|contains: Start-Process
falsepositives:
- Legitimate administration script
id: b5522a23-82da-44e5-9c8b-e10ed8955f88
level: medium
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1059.003/T1059.003.md#atomic-test-1---create-and-execute-batch-script
status: experimental
tags:
- attack.execution
- attack.t1059.003
title: Powershell Execute Batch Script
