author: frack113
category: ps_script
date: 2021/12/15
definition: Script block logging must be enabled
description: 'Adversaries may enumerate files and directories or may search in specific
  locations of a host or network share for certain information within a file system.

  Adversaries may use the information from [File and Directory Discovery](https://attack.mitre.org/techniques/T1083)
  during automated discovery to shape follow-on behaviors, including whether or not
  the adversary fully infects the target and/or attempts specific actions.

  '
detection:
  condition: selection and recurse
  recurse:
    winlog.event_data.ScriptBlockText|contains: -recurse
  selection:
    winlog.event_data.ScriptBlockText|contains:
    - ls
    - get-childitem
    - gci
falsepositives:
- Unknown
id: d23f2ba5-9da0-4463-8908-8ee47f614bb9
level: low
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1083/T1083.md
status: experimental
tags:
- attack.discovery
- attack.t1083
title: Powershell File and Directory Discovery
