author: Timur Zinniatullin, oscd.community
category: ps_script
date: 2020/10/18
definition: Script block logging must be enabled
description: Detects Obfuscated Powershell via COMPRESS OBFUSCATION
detection:
  condition: selection_4104
  selection_4104:
    winlog.event_data.ScriptBlockText|contains:
    - system.io.compression.deflatestream
    - system.io.streamreader
    winlog.event_data.ScriptBlockText|contains|all:
    - new-object
    - text.encoding]::ascii
    winlog.event_data.ScriptBlockText|endswith: readtoend
falsepositives:
- Unknown
id: 20e5497e-331c-4cd5-8d36-935f6e2a9a07
level: medium
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
modified: 2022/03/08
product: windows
references:
- https://github.com/Neo23x0/sigma/issues/1009
status: experimental
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
title: Invoke-Obfuscation COMPRESS OBFUSCATION
