author: frack113, elhoim
category: ps_script
date: 2022/01/16
definition: Script block logging must be enabled
description: Detects powershell scripts attempting to disable scheduled scanning and
  other parts of windows defender atp or set default actions to allow.
detection:
  condition: all of selection_options_disabling* or selection_default_actions_allow
  selection_default_actions_allow:
    winlog.event_data.ScriptBlockText|contains:
    - LowThreatDefaultAction
    - ModerateThreatDefaultAction
    - HighThreatDefaultAction
    winlog.event_data.ScriptBlockText|contains|all:
    - Set-MpPreference
    - Allow
  selection_options_disabling_function:
    winlog.event_data.ScriptBlockText|contains:
    - DisableRealtimeMonitoring 1
    - DisableBehaviorMonitoring 1
    - DisableScriptScanning 1
    - DisableArchiveScanning 1
    - DisableBlockAtFirstSeen 1
    - DisableIOAVProtection 1
    - DisableIntrusionPreventionSystem 1
    - DisableRemovableDriveScanning 1
    - DisableScanningMappedNetworkDrivesForFullScan 1
    - DisableScanningNetworkFiles 1
    - DisableRealtimeMonitoring $true
    - DisableBehaviorMonitoring $true
    - DisableScriptScanning $true
    - DisableArchiveScanning $true
    - DisableBlockAtFirstSeen $true
    - DisableIOAVProtection $true
    - DisableIntrusionPreventionSystem $true
    - DisableRemovableDriveScanning $true
    - DisableScanningMappedNetworkDrivesForFullScan $true
    - DisableScanningNetworkFiles $true
  selection_options_disabling_preference:
    winlog.event_data.ScriptBlockText|contains: Set-MpPreference
falsepositives:
- Legitimate PowerShell scripts
id: 14c71865-6cd3-44ae-adaa-1db923fae5f2
level: high
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
modified: 2022/08/05
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md
- https://docs.microsoft.com/en-us/powershell/module/defender/set-mppreference?view=windowsserver2022-ps
- https://bidouillesecurity.com/disable-windows-defender-in-powershell/
related:
- id: ec19ebab-72dc-40e1-9728-4c0b805d722c
  type: derived
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001
title: Tamper Windows Defender - ScriptBlockLogging
