author: frack113
category: ps_script
date: 2022/01/07
definition: Script block logging must be enabled
description: 'Adversaries may steal data by exfiltrating it over an un-encrypted network
  protocol other than that of the existing command and control channel.

  The data may also be sent to an alternate network location from the main command
  and control server.

  '
detection:
  condition: selection_cmdlet
  selection_cmdlet:
    winlog.event_data.ScriptBlockText|contains: Send-MailMessage
falsepositives:
- Legitimate script
id: 9a7afa56-4762-43eb-807d-c3dc9ffe211b
level: medium
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1048.003/T1048.003.md#atomic-test-5---exfiltration-over-alternative-protocol---smtp
- https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.utility/send-mailmessage?view=powershell-7.2
- https://www.ietf.org/rfc/rfc2821.txt
status: experimental
tags:
- attack.exfiltration
- attack.t1048.003
title: Powershell Exfiltration Over SMTP
