author: frack113
category: ps_script
date: 2021/12/20
definition: Script block logging must be enabled
description: 'Adversaries may search for common password storage locations to obtain
  user credentials.

  Passwords are stored in several places on a system, depending on the operating system
  or application holding the credentials.

  '
detection:
  condition: all of selection_*
  selection_cmd:
    winlog.event_data.ScriptBlockText|contains|all:
    - vaultcmd
    - '/listcreds:'
  selection_option:
    winlog.event_data.ScriptBlockText|contains:
    - Windows Credentials
    - Web Credentials
falsepositives:
- Unknown
id: 603c6630-5225-49c1-8047-26c964553e0e
level: medium
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1555/T1555.md
status: experimental
tags:
- attack.credential_access
- attack.t1555
title: Enumerate Credentials from Windows Credential Manager With PowerShell
