author: Nikita Nazarov, oscd.community
category: ps_script
date: 2019/10/08
definition: Script block logging must be enabled
description: Detects Obfuscated Powershell via use Rundll32 in Scripts
detection:
  condition: selection_4104
  selection_4104:
    winlog.event_data.ScriptBlockText|contains:
    - value
    - invoke
    - comspec
    - iex
    winlog.event_data.ScriptBlockText|contains|all:
    - '&&'
    - rundll32
    - shell32.dll
    - shellexec_rundll
falsepositives:
- Unknown
id: a5a30a6e-75ca-4233-8b8c-42e0f2037d3b
level: high
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
modified: 2022/03/08
product: windows
references:
- https://github.com/Neo23x0/sigma/issues/1009
status: experimental
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
title: Invoke-Obfuscation Via Use Rundll32
