author: Max Altgelt
category: ps_script
date: 2021/09/21
definition: Script block logging must be enabled
description: Detects usage of a PowerShell command to dump the live memory of a Windows
  machine
detection:
  condition: selection
  selection:
    winlog.event_data.ScriptBlockText|contains|all:
    - Get-StorageDiagnosticInfo
    - -IncludeLiveDump
falsepositives:
- Diagnostics
id: cd185561-4760-45d6-a63e-a51325112cae
level: high
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
modified: 2021/10/16
product: windows
references:
- https://docs.microsoft.com/en-us/powershell/module/storage/get-storagediagnosticinfo
status: experimental
tags:
- attack.t1003
title: Live Memory Dump Using Powershell
