author: Nikita Nazarov, oscd.community
category: ps_script
date: 2020/10/09
definition: Script block logging must be enabled
description: Detects Obfuscated Powershell via use Clip.exe in Scripts
detection:
  condition: selection_4104
  selection_4104:
    winlog.event_data.ScriptBlockText|re: (?i).*?echo.*clip.*&&.*(Clipboard|i`?n`?v`?o`?k`?e`?).*
falsepositives:
- Unknown
id: db92dd33-a3ad-49cf-8c2c-608c3e30ace0
level: high
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
modified: 2021/10/16
product: windows
references:
- https://github.com/Neo23x0/sigma/issues/1009
status: experimental
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
title: Invoke-Obfuscation Via Use Clip
