author: frack113
category: ps_script
date: 2022/01/12
definition: Script block logging must be enabled
description: Adversaries may attempt to access or create a copy of the Active Directory
  domain database in order to steal credential information
detection:
  condition: selection
  selection:
    winlog.event_data.ScriptBlockText|contains|all:
    - win32_shadowcopy
    - ).Create(
    - ClientAccessible
falsepositives:
- Legitimate PowerShell scripts
id: afd12fed-b0ec-45c9-a13d-aa86625dac81
level: high
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
product: windows
references:
- https://attack.mitre.org/datasources/DS0005/
- https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.management/get-wmiobject?view=powershell-5.1&viewFallbackFrom=powershell-7
status: experimental
tags:
- attack.credential_access
- attack.t1003.003
title: Create Volume Shadow Copy with Powershell
