author: frack113
category: ps_script
date: 2022/01/07
definition: Script block logging must be enabled
description: Detects the use of various web request POST or PUT methods (including
  aliases) via Windows PowerShell command
detection:
  condition: all of selection_*
  selection_cmdlet:
    winlog.event_data.ScriptBlockText|contains:
    - Invoke-WebRequest
    - 'iwr '
  selection_method:
    winlog.event_data.ScriptBlockText|contains: '-Method '
  selection_verb:
  - ' Put '
  - ' Post '
falsepositives:
- Legitimate script
id: d2e3f2f6-7e09-4bf2-bc5d-90186809e7fb
level: medium
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1020/T1020.md
- https://www.w3.org/Protocols/rfc2616/rfc2616-sec9.html
- https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.utility/invoke-webrequest?view=powershell-7.2
status: experimental
tags:
- attack.exfiltration
- attack.t1020
title: Windows PowerShell Upload Web Request
