author: frack113
category: ps_script
date: 2022/01/19
definition: Script block logging must be enabled
description: 'Adversaries may abuse PowerShell commands and scripts for execution.

  PowerShell is a powerful interactive command-line interface and scripting environment
  included in the Windows operating system. (Citation: TechNet PowerShell)

  Adversaries can use PowerShell to perform a number of actions, including discovery
  of information and execution of code

  '
detection:
  condition: all of selection_*
  selection_exec:
  - IEX
  - Invoke-Expression
  selection_xml:
    winlog.event_data.ScriptBlockText|contains|all:
    - New-Object
    - System.Xml.XmlDocument
    - .Load
falsepositives:
- Legitimate administrative script
id: 6c6c6282-7671-4fe9-a0ce-a2dcebdc342b
level: medium
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1059.001/T1059.001.md#atomic-test-8---powershell-xml-requests
status: experimental
tags:
- attack.execution
- attack.t1059.001
title: Powershell XML Execute Command
