author: Nasreddine Bencherchali
category: ps_script
date: 2022/07/08
definition: Script block logging must be enabled
description: Detects powershell scripts that creates sockets/listeners which could
  be indicative of tunneling activity
detection:
  condition: selection
  selection:
    winlog.event_data.ScriptBlockText|contains|all:
    - '[System.Net.HttpWebRequest]'
    - System.Net.Sockets.TcpListener
    - AcceptTcpClient
falsepositives:
- Unknown
id: bd33d2aa-497e-4651-9893-5c5364646595
level: medium
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
product: windows
references:
- https://github.com/Arno0x/PowerShellScripts/blob/a6b7d5490fbf0b20f91195838f3a11156724b4f7/proxyTunnel.ps1
status: experimental
tags:
- attack.command_and_control
- attack.t1090
title: Suspicious TCP Tunnel Via PowerShell Script
