author: frack113
category: ps_script
date: 2021/07/30
definition: Script block logging must be enabled
description: Adversaries may log user keystrokes to intercept credentials as the user
  types them.
detection:
  condition: 1 of selection_*
  selection_basic:
    winlog.event_data.ScriptBlockText|contains: Get-Keystrokes
  selection_high:
    winlog.event_data.ScriptBlockText|contains|all:
    - Get-ProcAddress user32.dll GetAsyncKeyState
    - Get-ProcAddress user32.dll GetForegroundWindow
falsepositives:
- Unknown
id: 34f90d3c-c297-49e9-b26d-911b05a4866c
level: medium
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
modified: 2022/07/11
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218/T1218.md
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1056.001/src/Get-Keystrokes.ps1
status: experimental
tags:
- attack.collection
- attack.t1056.001
title: Powershell Keylogging
