author: Nasreddine Bencherchali
category: ps_script
date: 2022/08/16
definition: Script block logging must be enabled
description: Detects usage of the "Write-EventLog" cmdlet with 'RawData' flag. The
  cmdlet can be levreage to write malicious payloads to the EventLog and then retrieve
  them later for later use
detection:
  condition: selection
  selection:
    winlog.event_data.ScriptBlockText|contains|all:
    - Write-EventLog
    - '-RawData '
falsepositives:
- Legitimate applications writing events via this cmdlet. Investigate alerts to determine
  if the action is benign
id: 35f41cd7-c98e-469f-8a02-ec4ba0cc7a7e
level: medium
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
product: windows
references:
- https://www.blackhillsinfosec.com/windows-event-logs-for-red-teams/
status: experimental
tags:
- attack.defense_evasion
title: PowerShell Write-EventLog Usage
