author: frack113, Nasreddine Bencherchali
category: ps_script
date: 2021/12/27
definition: Script block logging must be enabled
description: Uses PowerShell to install/copy a a file into a system directory such
  as "System32" or "SysWOW64"
detection:
  condition: all of selection*
  selection_copy:
    winlog.event_data.ScriptBlockText|contains|all:
    - 'Copy-Item '
    - '-Destination '
  selection_paths:
    winlog.event_data.ScriptBlockText|contains:
    - \Windows\System32
    - \Windows\SysWOW64
falsepositives:
- Unknown
id: 63bf8794-9917-45bc-88dd-e1b5abc0ecfd
level: high
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
modified: 2022/07/07
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1556.002/T1556.002.md#atomic-test-1---install-and-register-password-filter-dll
status: experimental
tags:
- attack.credential_access
- attack.t1556.002
title: Powershell Install a DLL in System32
