author: Daniel Bohannon (@Mandiant/@FireEye), oscd.community
category: ps_script
date: 2019/11/08
definition: Script block logging must be enabled
description: Detects all variations of obfuscated powershell IEX invocation code generated
  by Invoke-Obfuscation framework from the following code block \u2014
detection:
  condition: selection_iex
  selection_iex:
  - winlog.event_data.ScriptBlockText|re: \$PSHome\[\s*\d{1,3}\s*\]\s*\+\s*\$PSHome\[
  - winlog.event_data.ScriptBlockText|re: \$ShellId\[\s*\d{1,3}\s*\]\s*\+\s*\$ShellId\[
  - winlog.event_data.ScriptBlockText|re: \$env:Public\[\s*\d{1,3}\s*\]\s*\+\s*\$env:Public\[
  - winlog.event_data.ScriptBlockText|re: \$env:ComSpec\[(\s*\d{1,3}\s*,){2}
  - winlog.event_data.ScriptBlockText|re: \\\\*mdr\\\\*\W\s*\)\.Name
  - winlog.event_data.ScriptBlockText|re: \$VerbosePreference\.ToString\(
falsepositives:
- Unknown
id: 1b9dc62e-6e9e-42a3-8990-94d7a10007f7
level: high
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
modified: 2022/01/27
product: windows
references:
- https://github.com/danielbohannon/Invoke-Obfuscation/blob/f20e7f843edd0a3a7716736e9eddfa423395dd26/Out-ObfuscatedStringCommand.ps1#L873-L888
status: experimental
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
title: Invoke-Obfuscation Obfuscated IEX Invocation
