author: frack113
category: ps_script
date: 2022/03/17
definition: Script block logging must be enabled
description: Detects AS-REP roasting is an attack that is often-overlooked. It is
  not very common as you have to explicitly set accounts that do not require pre-authentication.
detection:
  condition: selection
  selection:
    winlog.event_data.ScriptBlockText|contains|all:
    - Get-ADUser
    - -Filter
    - useraccountcontrol
    - -band
    - '4194304'
falsepositives:
- Legitimate PowerShell scripts
id: 96c982fe-3d08-4df4-bed2-eb14e02f21c8
level: medium
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1069.002/T1069.002.md#atomic-test-11---get-aduser-enumeration-using-useraccountcontrol-flags-as-rep-roasting
- https://shellgeek.com/useraccountcontrol-flags-to-manipulate-properties/
status: experimental
tags:
- attack.discovery
- attack.t1057
title: Get-ADUser Enumeration Using UserAccountControl Flags
