author: frack113
category: ps_script
date: 2021/12/28
definition: Script block logging must be enabled
description: Adversaries may abuse the Windows Task Scheduler to perform task scheduling
  for initial or recurring execution of malicious code
detection:
  condition: 1 of selection_*
  selection_cimmethod:
    winlog.event_data.ScriptBlockText|contains|all:
    - Invoke-CimMethod
    - -ClassName
    - PS_ScheduledTask
    - -NameSpace
    - Root\Microsoft\Windows\TaskScheduler
  selection_cmdlet:
    winlog.event_data.ScriptBlockText|contains:
    - New-ScheduledTaskAction
    - New-ScheduledTaskTrigger
    - New-ScheduledTaskPrincipal
    - New-ScheduledTaskSettingsSet
    - New-ScheduledTask
    - Register-ScheduledTask
falsepositives:
- Unknown
id: 363eccc0-279a-4ccf-a3ab-24c2e63b11fb
level: medium
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1053.005/T1053.005.md#atomic-test-4---powershell-cmdlet-scheduled-task
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1053.005/T1053.005.md#atomic-test-6---wmi-invoke-cimmethod-scheduled-task
status: experimental
tags:
- attack.persistence
- attack.t1053.005
title: Powershell Create Scheduled Task
