author: frack113, MatilJ
category: ps_script
date: 2022/01/19
definition: Script block logging must be enabled
description: 'Adversaries may abuse PowerShell commands and scripts for execution.

  PowerShell is a powerful interactive command-line interface and scripting environment
  included in the Windows operating system. (Citation: TechNet PowerShell)

  Adversaries can use PowerShell to perform a number of actions, including discovery
  of information and execution of code

  '
detection:
  condition: selection
  selection:
    winlog.event_data.ScriptBlockText|contains|all:
    - New-Object
    - -ComObject
    - MsXml2.
    - XmlHttp
falsepositives:
- Legitimate administrative script
id: 78aa1347-1517-4454-9982-b338d6df8343
level: medium
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
modified: 2022/05/19
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1059.001/T1059.001.md#atomic-test-7---powershell-msxml-com-object---with-prompt
- https://docs.microsoft.com/en-us/previous-versions/windows/desktop/ms766431(v=vs.85)
- https://www.trendmicro.com/en_id/research/22/e/uncovering-a-kingminer-botnet-attack-using-trend-micro-managed-x.html
status: experimental
tags:
- attack.execution
- attack.t1059.001
title: Powershell MsXml COM Object
