author: David Ledbetter (shellcode), Florian Roth (rule)
category: ps_script
date: 2018/11/17
definition: Script block logging must be enabled
description: Detects Base64 encoded Shellcode
detection:
  condition: selection and selection2
  selection:
    winlog.event_data.ScriptBlockText|contains: AAAAYInlM
  selection2:
    winlog.event_data.ScriptBlockText|contains:
    - OiCAAAAYInlM
    - OiJAAAAYInlM
falsepositives:
- Unknown
id: 16b37b70-6fcf-4814-a092-c36bd3aafcbd
level: high
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
modified: 2021/10/16
product: windows
references:
- https://twitter.com/cyb3rops/status/1063072865992523776
status: experimental
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1055
- attack.execution
- attack.t1059.001
title: PowerShell ShellCode
