author: Daniil Yugoslavskiy, oscd.community
category: ps_script
date: 2019/10/24
definition: Script block logging must be enabled
description: Dnscat exfiltration tool execution
detection:
  condition: selection
  selection:
    winlog.event_data.ScriptBlockText|contains: Start-Dnscat2
falsepositives:
- "Legitimate usage of PowerShell Dnscat2 \u2014 DNS Exfiltration tool (unlikely)"
id: a6d67db4-6220-436d-8afc-f3842fe05d43
level: critical
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
modified: 2021/10/16
product: windows
status: experimental
tags:
- attack.exfiltration
- attack.t1048
- attack.execution
- attack.t1059.001
title: Dnscat Execution
