author: frack113
category: ps_script
date: 2022/01/07
definition: Script block logging must be enabled
description: Adversaries may use Valid Accounts to interact with remote systems using
  Windows Remote Management (WinRM). The adversary may then perform actions as the
  logged-on user.
detection:
  condition: selection_cmdlet
  selection_cmdlet:
    winlog.event_data.ScriptBlockText|contains|all:
    - 'invoke-command '
    - ' -ComputerName '
falsepositives:
- Legitimate script
id: 7b836d7f-179c-4ba4-90a7-a7e60afb48e6
level: medium
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1021.006/T1021.006.md#atomic-test-2---invoke-command
- https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.core/invoke-command?view=powershell-7.2
status: experimental
tags:
- attack.lateral_movement
- attack.t1021.006
title: Execute Invoke-command on Remote Host
