author: frack113
category: ps_script
date: 2021/12/26
definition: Script block logging must be enabled
description: Deletes Windows Volume Shadow Copies with PowerShell code and Get-WMIObject.
  This technique is used by numerous ransomware families such as Sodinokibi/REvil
detection:
  condition: selection
  selection:
    winlog.event_data.ScriptBlockText|contains|all:
    - Get-WmiObject
    - Win32_Shadowcopy
    - .Delete()
falsepositives:
- Unknown
id: e17121b4-ef2a-4418-8a59-12fb1631fa9e
level: high
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1490/T1490.md#atomic-test-5---windows---delete-volume-shadow-copies-via-wmi-with-powershell
status: test
tags:
- attack.impact
- attack.t1490
title: Delete Volume Shadow Copies via WMI with PowerShell
