author: "Ensar \u015Eamil, @sblmsrsn, OSCD Community"
category: ps_script
date: 2020/10/05
definition: Script block logging must be enabled
description: Detects SyncAppvPublishingServer process execution which usually utilized
  by adversaries to bypass PowerShell execution restrictions.
detection:
  condition: selection
  selection:
    winlog.event_data.ScriptBlockText|contains: SyncAppvPublishingServer.exe
falsepositives:
- App-V clients
id: dddfebae-c46f-439c-af7a-fdb6bde90218
level: medium
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
modified: 2021/10/18
product: windows
references:
- https://lolbas-project.github.io/lolbas/Binaries/Syncappvpublishingserver/
related:
- id: fde7929d-8beb-4a4c-b922-be9974671667
  type: derived
- id: 9f7aa113-9da6-4a8d-907c-5f1a4b908299
  type: derived
status: experimental
tags:
- attack.defense_evasion
- attack.t1218
title: SyncAppvPublishingServer Execution to Bypass Powershell Restriction
