author: Max Altgelt, Tobias Michalski
category: ps_script
date: 2021/08/09
definition: Script Block Logging must be enabled
description: Detects Commandlet names from ShellIntel exploitation scripts.
detection:
  condition: selection
  selection:
    winlog.event_data.ScriptBlockText|contains:
    - Invoke-SMBAutoBrute
    - Invoke-GPOLinks
    - Out-Minidump
    - Invoke-Potato
falsepositives:
- Unknown
id: 402e1e1d-ad59-47b6-bf80-1ee44985b3a7
level: high
logsource:
  category: ps_script
  definition: Script Block Logging must be enabled
  product: windows
modified: 2021/10/16
product: windows
references:
- https://github.com/Shellntel/scripts/
status: experimental
tags:
- attack.execution
- attack.t1059.001
title: Malicious ShellIntel PowerShell Commandlets
