author: Nasreddine Bencherchali
category: ps_script
date: 2022/06/21
definition: Script block logging must be enabled
description: Detects call to "Win32_QuickFixEngineering" in order to enumerate installed
  hotfixes often used in "enum" scripts by attackers
detection:
  condition: selection
  selection:
    winlog.event_data.ScriptBlockText|contains|all:
    - Win32_QuickFixEngineering
    - HotFixID
falsepositives:
- Legitimate administration scripts
id: f5d1def8-1de0-4a0e-9794-1f6f27dd605c
level: medium
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
product: windows
references:
- https://github.com/411Hall/JAWS/blob/233f142fcb1488172aa74228a666f6b3c5c48f1d/jaws-enum.ps1
status: experimental
tags:
- attack.discovery
title: PowerShell Hotfix Enumeration
