author: Nikita Nazarov, oscd.community
category: ps_script
date: 2020/10/16
definition: Script block logging must be enabled
description: Adversaries may attempt to enumerate software for a variety of reasons,
  such as figuring out what security measures are present or if the compromised system
  has a version of software that is vulnerable.
detection:
  condition: selection
  selection:
    winlog.event_data.ScriptBlockText|contains|all:
    - get-itemProperty
    - \software\
    - select-object
    - format-table
falsepositives:
- Legitimate administration activities
id: 2650dd1a-eb2a-412d-ac36-83f06c4f2282
level: medium
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
modified: 2021/11/12
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1518/T1518.md
- https://github.com/harleyQu1nn/AggressorScripts
status: experimental
tags:
- attack.discovery
- attack.t1518
title: Detected Windows Software Discovery
