author: frack113, Duc.Le-GTSC
category: ps_script
date: 2021/08/03
definition: Script block logging must be enabled
description: Adversaries may employ various system checks to detect and avoid virtualization
  and analysis environments. This may include changing behaviors based on the results
  of checks for the presence of artifacts indicative of a virtual machine environment
  (VME) or sandbox
detection:
  condition: all of selection*
  selection_action:
    winlog.event_data.ScriptBlockText|contains:
    - Get-WmiObject
    - gwmi
  selection_module:
    winlog.event_data.ScriptBlockText|contains:
    - MSAcpi_ThermalZoneTemperature
    - Win32_ComputerSystem
falsepositives:
- Unknown
id: d93129cd-1ee0-479f-bc03-ca6f129882e3
level: medium
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
modified: 2022/03/03
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1497.001/T1497.001.md
- https://techgenix.com/malicious-powershell-scripts-evade-detection/
status: experimental
tags:
- attack.defense_evasion
- attack.t1497.001
title: Powershell Detect Virtualization Environment
