author: Nasreddine Bencherchali
category: ps_script
date: 2022/06/28
definition: Script block logging must be enabled
description: Detects usage of powershell cmdlets to disable or remove ETW trace sessions
detection:
  condition: 1 of selection*
  selection_pwsh_remove:
    winlog.event_data.ScriptBlockText|contains: 'Remove-EtwTraceProvider '
  selection_pwsh_set:
    winlog.event_data.ScriptBlockText|contains|all:
    - 'Set-EtwTraceProvider '
    - '0x11'
falsepositives:
- Unknown
id: 115fdba9-f017-42e6-84cf-d5573bf2ddf8
level: high
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
product: windows
references:
- https://medium.com/palantir/tampering-with-windows-event-tracing-background-offense-and-defense-4be7ac62ac63
related:
- id: a238b5d0-ce2d-4414-a676-7a531b3d13d6
  type: derived
status: experimental
tags:
- attack.defense_evasion
- attack.t1070
- attack.t1562.006
- car.2016-04-002
title: Disable of ETW Trace
