author: Florian Roth (rule), Jonhnathan Ribeiro
category: ps_script
date: 2017/03/05
definition: Script block logging must be enabled
description: Detects suspicious PowerShell invocation command parameters
detection:
  condition: 1 of select* and not 1 of filter*
  filter_chocolatey:
    winlog.event_data.ScriptBlockText|contains:
    - (New-Object System.Net.WebClient).DownloadString('https://community.chocolatey.org/install.ps1
    - (New-Object System.Net.WebClient).DownloadString('https://chocolatey.org/install.ps1')
    - Write-ChocolateyWarning
  select_convert_b64:
    winlog.event_data.ScriptBlockText|contains|all:
    - -nop
    - ' -w '
    - hidden
    - ' -c '
    - '[Convert]::FromBase64String'
  select_enc_selection:
    winlog.event_data.ScriptBlockText|contains|all:
    - ' -w '
    - hidden
    - -ep
    - bypass
    - -Enc
  select_iex_selection:
    winlog.event_data.ScriptBlockText|contains|all:
    - ' -w '
    - hidden
    - -noni
    - -nop
    - ' -c '
    - iex
    - New-Object
  select_iex_webclient:
    winlog.event_data.ScriptBlockText|contains|all:
    - iex
    - New-Object
    - Net.WebClient
    - .Download
  select_reg_selection:
    winlog.event_data.ScriptBlockText|contains|all:
    - powershell
    - reg
    - add
    - HKCU\software\microsoft\windows\currentversion\run
  select_webclient_selection:
    winlog.event_data.ScriptBlockText|contains|all:
    - bypass
    - -noprofile
    - -windowstyle
    - hidden
    - new-object
    - system.net.webclient
    - .download
falsepositives:
- Unknown
id: ae7fbf8e-f3cb-49fd-8db4-5f3bed522c71
level: high
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
modified: 2022/02/21
product: windows
related:
- id: fce5f582-cc00-41e1-941a-c6fabf0fdb8c
  type: derived
status: experimental
tags:
- attack.execution
- attack.t1059.001
title: Suspicious PowerShell Invocations - Specific
