author: frack113
category: ps_script
date: 2022/01/23
definition: Script block logging must be enabled
description: 'Adversaries may communicate using application layer protocols associated
  with web traffic to avoid detection/network filtering by blending in with existing
  traffic.

  Commands to the remote system, and often the results of those commands, will be
  embedded within the protocol traffic between the client and server.

  '
detection:
  condition: selection
  selection:
    winlog.event_data.ScriptBlockText|contains|all:
    - Invoke-WebRequest
    - '-UserAgent '
falsepositives:
- Unknown
id: d4488827-73af-4f8d-9244-7b7662ef046e
level: medium
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1071.001/T1071.001.md#t1071001---web-protocols
status: experimental
tags:
- attack.command_and_control
- attack.t1071.001
title: Change User Agents with WebRequest
