author: frack113
category: ps_script
date: 2021/12/15
definition: Script block logging must be enabled
description: 'Adversaries may look for folders and drives shared on remote systems
  as a means of identifying sources of information to gather as a precursor for Collection
  and to identify potential systems of interest for Lateral Movement.

  Networks often contain shared network drives and folders that enable users to access
  file directories on various systems across a network.

  '
detection:
  condition: selection
  selection:
    winlog.event_data.ScriptBlockText|contains: get-smbshare
falsepositives:
- Unknown
id: 95f0643a-ed40-467c-806b-aac9542ec5ab
level: low
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1069.002/T1069.002.md
status: experimental
tags:
- attack.discovery
- attack.t1069.001
title: Suspicious Get Information for SMB Share
