author: Sean Metcalf (source), Florian Roth (rule)
category: ps_script
date: 2017/03/05
definition: Script block logging must be enabled
description: Detects keywords from well-known PowerShell exploitation frameworks
detection:
  condition: selection
  selection:
    winlog.event_data.ScriptBlockText|contains:
    - AdjustTokenPrivileges
    - IMAGE_NT_OPTIONAL_HDR64_MAGIC
    - Microsoft.Win32.UnsafeNativeMethods
    - ReadProcessMemory.Invoke
    - SE_PRIVILEGE_ENABLED
    - LSA_UNICODE_STRING
    - MiniDumpWriteDump
    - PAGE_EXECUTE_READ
    - SECURITY_DELEGATION
    - TOKEN_ADJUST_PRIVILEGES
    - TOKEN_ALL_ACCESS
    - TOKEN_ASSIGN_PRIMARY
    - TOKEN_DUPLICATE
    - TOKEN_ELEVATION
    - TOKEN_IMPERSONATE
    - TOKEN_INFORMATION_CLASS
    - TOKEN_PRIVILEGES
    - TOKEN_QUERY
    - Metasploit
    - Mimikatz
falsepositives:
- Unknown
id: f62176f3-8128-4faa-bf6c-83261322e5eb
level: high
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
modified: 2021/10/16
product: windows
references:
- https://adsecurity.org/?p=2921
status: experimental
tags:
- attack.execution
- attack.t1059.001
title: Malicious PowerShell Keywords
