author: frack113
category: ps_script
date: 2022/03/17
definition: Script block logging must be enabled
description: Detects the use of Get-AdGroup to enumerate Groups within Active Directory
detection:
  condition: selection
  selection:
    winlog.event_data.ScriptBlockText|contains|all:
    - 'Get-AdGroup '
    - -Filter
falsepositives:
- Unknown
id: 8c3a6607-b7dc-4f0d-a646-ef38c00b76ee
level: low
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1018/T1018.md
status: experimental
tags:
- attack.discovery
- attack.t1069.002
title: Suspicious Enumerate Active Directory Groups with Get-AdComputer
