author: oscd.community, Natalia Shornikova
category: ps_script
date: 2020/10/14
definition: Script block logging must be enabled
description: Detects Execution via SyncInvoke in CL_Invocation.ps1 module
detection:
  condition: selection | count(ScriptBlockText) by Computer > 2
  selection:
    winlog.event_data.ScriptBlockText|contains:
    - CL_Invocation.ps1
    - SyncInvoke
falsepositives:
- Unknown
id: f588e69b-0750-46bb-8f87-0e9320d57536
level: high
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
modified: 2021/10/16
product: windows
references:
- https://lolbas-project.github.io/lolbas/Scripts/Cl_invocation/
- https://twitter.com/bohops/status/948061991012327424
status: experimental
tags:
- attack.defense_evasion
- attack.t1216
title: Execution via CL_Invocation.ps1 (2 Lines)
