author: oscd.community, Natalia Shornikova
category: ps_script
date: 2020/10/14
definition: Script block logging must be enabled
description: Detects Execution via runAfterCancelProcess in CL_Mutexverifiers.ps1
  module
detection:
  condition: selection | count(ScriptBlockText) by Computer > 2
  selection:
    winlog.event_data.ScriptBlockText|contains:
    - CL_Mutexverifiers.ps1
    - runAfterCancelProcess
falsepositives:
- Unknown
id: 6609c444-9670-4eab-9636-fe4755a851ce
level: high
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
modified: 2021/10/16
product: windows
references:
- https://lolbas-project.github.io/lolbas/Scripts/CL_mutexverifiers/
- https://twitter.com/pabraeken/status/995111125447577600
status: experimental
tags:
- attack.defense_evasion
- attack.t1216
title: Execution via CL_Mutexverifiers.ps1 (2 Lines)
