author: frack113
category: ps_script
date: 2022/04/04
definition: Script block logging must be enabled
description: Detects the use of PowerShell to identify the current logged user.
detection:
  condition: selection
  selection:
    winlog.event_data.ScriptBlockText|contains:
    - '[System.Environment]::UserName'
    - $env:UserName
    - '[System.Security.Principal.WindowsIdentity]::GetCurrent()'
falsepositives:
- Legitimate PowerShell scripts
id: 4096a49c-7de4-4da0-a230-c66ccd56ea5a
level: low
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1033/T1033.md#atomic-test-4---user-discovery-with-env-vars-powershell-script
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1033/T1033.md#atomic-test-5---getcurrent-user-with-powershell-script
status: experimental
tags:
- attack.discovery
- attack.t1033
title: Suspicious PowerShell Get Current User
