author: frack113
category: ps_script
date: 2022/01/30
definition: Script block logging must be enabled
description: 'Adversaries may acquire credentials from web browsers by reading files
  specific to the target browser.

  Web browsers commonly save credentials such as website usernames and passwords so
  that they do not need to be entered manually in the future.

  Web browsers typically store the credentials in an encrypted format within a credential
  store.

  '
detection:
  condition: all of selection_*
  selection_cmd:
    winlog.event_data.ScriptBlockText|contains|all:
    - Copy-Item
    - -Destination
  selection_path:
    winlog.event_data.ScriptBlockText|contains:
    - \Opera Software\Opera Stable\Login Data
    - \Mozilla\Firefox\Profiles
    - \Microsoft\Edge\User Data\Default
    - \Google\Chrome\User Data\Default\Login Data
    - \Google\Chrome\User Data\Default\Login Data For Account
falsepositives:
- Unknown
id: fc028194-969d-4122-8abe-0470d5b8f12f
level: medium
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1555.003/T1555.003.md
related:
- id: 98f4c75c-3089-44f3-b733-b327b9cd9c9d
  type: obsoletes
status: experimental
tags:
- attack.credential_access
- attack.t1555.003
title: Access to Browser Login Data
