author: Florian Roth
category: ps_script
date: 2017/03/05
definition: Script block logging must be enabled
description: Detects suspicious PowerShell download command
detection:
  condition: webclient and download
  download:
    winlog.event_data.ScriptBlockText|contains:
    - .DownloadFile(
    - .DownloadString(
  webclient:
    winlog.event_data.ScriptBlockText|contains: System.Net.WebClient
falsepositives:
- PowerShell scripts that download content from the Internet
id: 403c2cc0-7f6b-4925-9423-bfa573bed7eb
level: medium
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
modified: 2021/10/18
product: windows
related:
- id: 65531a81-a694-4e31-ae04-f8ba5bc33759
  type: derived
status: experimental
tags:
- attack.execution
- attack.t1059.001
title: Suspicious PowerShell Download
