author: frack113
category: ps_script
date: 2021/12/28
definition: Script block logging must be enabled
description: 'Adversaries may attempt to take screen captures of the desktop to gather
  information over the course of an operation.

  Screen capturing functionality may be included as a feature of a remote access tool
  used in post-compromise operations

  '
detection:
  condition: selection
  selection:
    winlog.event_data.ScriptBlockText|contains: .CopyFromScreen
falsepositives:
- Unknown
id: d4a11f63-2390-411c-9adf-d791fd152830
level: medium
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
modified: 2022/07/07
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1113/T1113.md#atomic-test-6---windows-screen-capture-copyfromscreen
status: experimental
tags:
- attack.collection
- attack.t1113
title: Windows Screen Capture with CopyFromScreen
