author: frack113
category: ps_script
date: 2022/08/13
definition: Script block logging must be enabled
description: Adversaries may use to interact with a remote network share using Server
  Message Block (SMB). The adversary may then perform actions as the logged-on user.
detection:
  condition: selection
  selection:
    winlog.event_data.ScriptBlockText|contains|all:
    - New-PSDrive
    - '-psprovider '
    - filesystem
    - '-root '
    - \\\\
    - $
falsepositives:
- Unknown
id: 1c563233-030e-4a07-af8c-ee0490a66d3a
level: medium
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1021.002/T1021.002.md#atomic-test-2---map-admin-share-powershell
- https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.management/new-psdrive?view=powershell-7.2
status: experimental
tags:
- attack.lateral_movement
- attack.t1021.002
title: Suspicious New-PSDrive to Admin Share
