author: frack113
category: ps_script
date: 2021/08/19
definition: EnableScriptBlockLogging must be set to enable
description: Adversaries may establish persistence and elevate privileges by executing
  malicious content triggered by a Windows Management Instrumentation (WMI) event
  subscription.
detection:
  condition: selection_ioc
  selection_ioc:
  - winlog.event_data.ScriptBlockText|contains|all:
    - 'New-CimInstance '
    - '-Namespace root/subscription '
    - '-ClassName __EventFilter '
    - '-Property '
  - winlog.event_data.ScriptBlockText|contains|all:
    - 'New-CimInstance '
    - '-Namespace root/subscription '
    - '-ClassName CommandLineEventConsumer '
    - '-Property '
falsepositives:
- Unknown
id: 9e07f6e7-83aa-45c6-998e-0af26efd0a85
level: medium
logsource:
  category: ps_script
  definition: EnableScriptBlockLogging must be set to enable
  product: windows
modified: 2021/10/16
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1546.003/T1546.003.md
- https://github.com/EmpireProject/Empire/blob/master/data/module_source/persistence/Persistence.psm1#L545
status: experimental
tags:
- attack.privilege_escalation
- attack.t1546.003
title: Powershell WMI Persistence
