author: oscd.community, Natalia Shornikova
category: ps_script
date: 2020/10/14
definition: Script block logging must be enabled
description: Detects Execution via SyncInvoke in CL_Invocation.ps1 module
detection:
  condition: selection
  selection:
    winlog.event_data.ScriptBlockText|contains|all:
    - CL_Invocation.ps1
    - SyncInvoke
falsepositives:
- Unknown
id: 4cd29327-685a-460e-9dac-c3ab96e549dc
level: high
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
modified: 2021/10/16
product: windows
references:
- https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OSScripts/Cl_invocation.yml
- https://twitter.com/bohops/status/948061991012327424
status: experimental
tags:
- attack.defense_evasion
- attack.t1216
title: Execution via CL_Invocation.ps1
