author: Austin Songer (@austinsonger)
category: ps_script
date: 2021/10/23
definition: Script Block Logging must be enable
description: null
detection:
  condition: selection
  selection:
    winlog.event_data.ScriptBlockText|contains:
    - Invoke-AzureHound
falsepositives:
- Penetration testing
id: 83083ac6-1816-4e76-97d7-59af9a9ae46e
level: high
logsource:
  category: ps_script
  definition: Script Block Logging must be enable
  product: windows
product: windows
references:
- https://github.com/BloodHoundAD/BloodHound/blob/master/Collectors/AzureHound.ps1
- https://bloodhound.readthedocs.io/en/latest/data-collection/azurehound.html
status: experimental
tags:
- attack.discovery
- attack.t1482
- attack.t1087
- attack.t1087.001
- attack.t1087.002
- attack.t1069.001
- attack.t1069.002
- attack.t1069
title: AzureHound PowerShell Commands
