author: frack113
category: ps_script
date: 2021/07/30
definition: Script block logging must be enabled
description: Once established within a system or network, an adversary may use automated
  techniques for collecting internal data
detection:
  condition: all of them
  selection_action:
    winlog.event_data.ScriptBlockText|contains:
    - 'Get-Service '
    - 'Get-ChildItem '
    - 'Get-Process '
  selection_redirect:
    winlog.event_data.ScriptBlockText|contains: '> $env:TEMP\'
falsepositives:
- Unknown
id: a9723fcc-881c-424c-8709-fd61442ab3c3
level: medium
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
modified: 2021/10/16
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1119/T1119.md
status: experimental
tags:
- attack.collection
- attack.t1119
title: Recon Information for Export with PowerShell
