author: Max Altgelt, Tobias Michalski
category: ps_script
date: 2021/08/09
definition: Script Block Logging must be enable
description: Detects Commandlet name for PrintNightmare exploitation.
detection:
  condition: selection
  selection:
    winlog.event_data.ScriptBlockText|contains: Invoke-Nightmare
falsepositives:
- Unknown
id: 6d3f1399-a81c-4409-aff3-1ecfe9330baf
level: high
logsource:
  category: ps_script
  definition: Script Block Logging must be enable
  product: windows
modified: 2021/10/16
product: windows
references:
- https://github.com/calebstewart/CVE-2021-1675
status: test
tags:
- attack.privilege_escalation
title: PrintNightmare Powershell Exploitation
