author: Nikita Nazarov, oscd.community
category: ps_script
date: 2020/10/08
definition: Script block logging must be enabled
description: Detects Obfuscated Powershell via use MSHTA in Scripts
detection:
  condition: selection_4104
  selection_4104:
    winlog.event_data.ScriptBlockText|re: (?i).*(set).*(&&).*(mshta).*(vbscript:createobject).*(\.run).*\(window\.close\).*"
falsepositives:
- Unknown
id: e55a5195-4724-480e-a77e-3ebe64bd3759
level: high
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
modified: 2021/10/16
product: windows
references:
- https://github.com/Neo23x0/sigma/issues/1009
status: experimental
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
title: Invoke-Obfuscation Via Use MSHTA
