author: James Pemberton / @4A616D6573
category: ps_script
date: 2019/10/24
definition: Script block logging must be enabled
description: Detects the use of various web request methods (including aliases) via
  Windows PowerShell command
detection:
  condition: selection
  selection:
    winlog.event_data.ScriptBlockText|contains:
    - Invoke-WebRequest
    - 'iwr '
    - 'wget '
    - 'curl '
    - Net.WebClient
    - Start-BitsTransfer
falsepositives:
- Use of Get-Command and Get-Help modules to reference Invoke-WebRequest and Start-BitsTransfer.
id: 1139d2e2-84b1-4226-b445-354492eba8ba
level: medium
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
modified: 2021/10/16
product: windows
references:
- https://4sysops.com/archives/use-powershell-to-download-a-file-with-http-https-and-ftp/
- https://blog.jourdant.me/post/3-ways-to-download-files-with-powershell
related:
- id: 9fc51a3c-81b3-4fa7-b35f-7c02cf10fd2d
  type: derived
status: experimental
tags:
- attack.execution
- attack.t1059.001
title: Windows PowerShell Web Request
