author: Roberto Rodriguez @Cyb3rWard0g
category: ps_classic_start
date: 2019/08/10
definition: fields have to be extract from event
description: Detects remote PowerShell sessions
detection:
  condition: selection
  selection:
    HostApplication|contains: wsmprovhost.exe
    HostName: ServerRemoteHost
falsepositives:
- Legitimate use remote PowerShell sessions
id: 60167e5c-84b2-4c95-a7ac-86281f27c445
level: high
logsource:
  category: ps_classic_start
  definition: fields have to be extract from event
  product: windows
modified: 2022/06/20
product: windows
references:
- https://threathunterplaybook.com/notebooks/windows/02_execution/WIN-190511223310.html
related:
- id: 96b9f619-aa91-478f-bacb-c3e50f8df575
  type: derived
status: test
tags:
- attack.execution
- attack.t1059.001
- attack.lateral_movement
- attack.t1021.006
title: Remote PowerShell Session (PS Classic)
