author: frack113
category: ps_classic_provider_start
date: 2021/06/07
definition: fields have to be extract from event
description: Attempting to disable scheduled scanning and other parts of windows defender
  atp. Or set default actions to allow.
detection:
  condition: all of tamper_ps_* or tamper_default_actions_allow
  tamper_default_actions_allow:
    HostApplication|contains:
    - LowThreatDefaultAction
    - ModerateThreatDefaultAction
    - HighThreatDefaultAction
    HostApplication|contains|all:
    - Set-MpPreference
    - Allow
  tamper_ps_action:
    HostApplication|contains: Set-MpPreference
  tamper_ps_option:
    HostApplication|contains:
    - DisableRealtimeMonitoring 1
    - DisableBehaviorMonitoring 1
    - DisableScriptScanning 1
    - DisableArchiveScanning 1
    - DisableBlockAtFirstSeen 1
    - DisableIOAVProtection 1
    - DisableIntrusionPreventionSystem 1
    - DisableRemovableDriveScanning 1
    - DisableScanningMappedNetworkDrivesForFullScan 1
    - DisableScanningNetworkFiles 1
    - DisableRealtimeMonitoring $true
    - DisableBehaviorMonitoring $true
    - DisableScriptScanning $true
    - DisableArchiveScanning $true
    - DisableBlockAtFirstSeen $true
    - DisableIOAVProtection $true
    - DisableIntrusionPreventionSystem $true
    - DisableRemovableDriveScanning $true
    - DisableScanningMappedNetworkDrivesForFullScan $true
    - DisableScanningNetworkFiles $true
falsepositives:
- Unknown
id: ec19ebab-72dc-40e1-9728-4c0b805d722c
level: high
logsource:
  category: ps_classic_provider_start
  definition: fields have to be extract from event
  product: windows
modified: 2022/08/05
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md
related:
- id: ec19ebab-72dc-40e1-9728-4c0b805d722c
  type: similar
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001
title: Tamper Windows Defender - PSClassic
