author: frack113
date: 2021/07/13
definition: fields have to be extract from event
description: RemoteFXvGPUDisablement.exe is an abusable, signed PowerShell host executable
  that was introduced in Windows 10 and Server 2019 (OS Build 17763.1339).
detection:
  condition: selection_cmd and selection_opt
  selection_cmd:
    HostApplication|contains: 'Invoke-ATHRemoteFXvGPUDisablementCommand '
  selection_opt:
    HostApplication|contains:
    - '-ModuleName '
    - '-ModulePath '
    - '-ScriptBlock '
    - -RemoteFXvGPUDisablementFilePath
falsepositives:
- Unknown
fields:
- winlog.ComputerName
- winlog.event_data.User
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: f65e22f9-819e-4f96-9c7b-498364ae7a25
level: medium
logsource:
  definition: fields have to be extract from event
  product: windows
  service: powershell-classic
modified: 2021/09/07
product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1218/T1218.md
- https://github.com/redcanaryco/AtomicTestHarnesses/blob/master/TestHarnesses/T1218_SignedBinaryProxyExecution/InvokeRemoteFXvGPUDisablementCommand.ps1
related:
- id: 38a7625e-b2cb-485d-b83d-aff137d859f4
  type: derived
service: powershell-classic
status: experimental
tags:
- attack.defense_evasion
- attack.t1218
title: Abusable Invoke-ATHRemoteFXvGPUDisablementCommand
