author: Florian Roth
category: create_remote_thread
date: 2022/03/16
description: Detects a remote thread creation in suspicious target images
detection:
  condition: selection and not filter
  filter:
    StartFunction: EtwpNotificationThread
  selection:
    winlog.event_data.TargetImage|endswith:
    - \mspaint.exe
    - \calc.exe
    - \notepad.exe
    - \sethc.exe
    - \write.exe
    - \wordpad.exe
    - \explorer.exe
falsepositives:
- Unknown
id: a1a144b7-5c9b-4853-a559-2172be8d4a03
level: high
logsource:
  category: create_remote_thread
  product: windows
modified: 2022/08/17
product: windows
references:
- https://blog.redbluepurple.io/offensive-research/bypassing-injection-detection
status: experimental
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1055.003
title: Remote Thread Creation in Suspicious Targets
