author: Timon Hackenjos
category: create_remote_thread
date: 2022/04/22
description: Detects remote thread creation in KeePass.exe indicating password dumping
  activity
detection:
  condition: selection
  selection:
    winlog.event_data.TargetImage|endswith: \KeePass.exe
falsepositives:
- Unknown
id: 77564cc2-7382-438b-a7f6-395c2ae53b9a
level: high
logsource:
  category: create_remote_thread
  product: windows
product: windows
references:
- https://www.cisa.gov/uscert/ncas/alerts/aa20-259a
- https://github.com/denandz/KeeFarce
- https://github.com/GhostPack/KeeThief
status: experimental
tags:
- attack.credential_access
- attack.t1555.005
title: KeePass Password Dumping
