author: Thomas Patzke
category: create_remote_thread
date: 2017/02/19
description: Detects password dumper activity by monitoring remote thread creation
  EventID 8 in combination with the lsass.exe process as TargetImage. The process
  in field Process is the malicious program. A single execution can lead to hundreds
  of events.
detection:
  condition: selection
  selection:
    winlog.event_data.StartModule: ''
    winlog.event_data.TargetImage|endswith: \lsass.exe
falsepositives:
- Antivirus products
id: f239b326-2f41-4d6b-9dfa-c846a60ef505
level: high
logsource:
  category: create_remote_thread
  product: windows
modified: 2021/06/21
product: windows
references:
- https://jpcertcc.github.io/ToolAnalysisResultSheet/details/WCE.htm
status: stable
tags:
- attack.credential_access
- attack.s0005
- attack.t1003.001
title: Password Dumper Remote Thread in LSASS
