author: Perez Diego (@darkquassar), oscd.community
category: create_remote_thread
date: 2019/10/27
description: Offensive tradecraft is switching away from using APIs like "CreateRemoteThread",
  however, this is still largely observed in the wild. This rule aims to detect suspicious
  processes (those we would not expect to behave in this way like word.exe or outlook.exe)
  creating remote threads on other processes. It is a generalistic rule, but it should
  have a low FP ratio due to the selected range of processes.
detection:
  condition: selection and not 1 of filter*
  filter2:
    winlog.event_data.SourceImage: C:\Windows\System32\winlogon.exe
    winlog.event_data.TargetImage:
    - C:\Windows\System32\services.exe
    - C:\Windows\System32\wininit.exe
    - C:\Windows\System32\csrss.exe
  filter3:
    TargetParentProcessId: 0
    winlog.event_data.SourceImage: C:\Windows\System32\provtool.exe
  filter4:
    winlog.event_data.SourceImage|endswith: \git.exe
    winlog.event_data.TargetImage|endswith:
    - \git.exe
    - C:\Windows\System32\conhost.exe
  filter5:
    winlog.event_data.SourceImage: C:\Windows\System32\VSSVC.exe
    winlog.event_data.TargetImage: System
  filter_powershell:
    SourceParentImage: C:\Windows\System32\CompatTelRunner.exe
  filter_schtasks_conhost:
    winlog.event_data.SourceImage:
    - C:\Windows\System32\schtasks.exe
    - C:\Windows\SysWOW64\schtasks.exe
    winlog.event_data.TargetImage: C:\Windows\System32\conhost.exe
  filter_vs:
  - winlog.event_data.SourceImage|contains: Visual Studio
  - SourceParentImage|contains: \Programs\Microsoft VS Code\
  selection:
    winlog.event_data.SourceImage|endswith:
    - \bash.exe
    - \cvtres.exe
    - \defrag.exe
    - \dnx.exe
    - \esentutl.exe
    - \excel.exe
    - \expand.exe
    - \explorer.exe
    - \find.exe
    - \findstr.exe
    - \forfiles.exe
    - \gpupdate.exe
    - \hh.exe
    - \iexplore.exe
    - \installutil.exe
    - \lync.exe
    - \makecab.exe
    - \mDNSResponder.exe
    - \monitoringhost.exe
    - \msbuild.exe
    - \mshta.exe
    - \msiexec.exe
    - \mspaint.exe
    - \outlook.exe
    - \ping.exe
    - \powerpnt.exe
    - \provtool.exe
    - \python.exe
    - \regsvr32.exe
    - \robocopy.exe
    - \runonce.exe
    - \sapcimc.exe
    - \schtasks.exe
    - \smartscreen.exe
    - \spoolsv.exe
    - \tstheme.exe
    - \userinit.exe
    - \vssadmin.exe
    - \vssvc.exe
    - \w3wp.exe
    - \winlogon.exe
    - \winscp.exe
    - \wmic.exe
    - \word.exe
    - \wscript.exe
falsepositives:
- Unknown
fields:
- winlog.ComputerName
- winlog.event_data.User
- winlog.event_data.SourceImage
- winlog.event_data.TargetImage
id: 66d31e5f-52d6-40a4-9615-002d3789a119
level: high
logsource:
  category: create_remote_thread
  product: windows
modified: 2022/08/26
notes:
- MonitoringHost.exe is a process that loads .NET CLR by default and thus a favorite
  for process injection for .NET in-memory offensive tools.
product: windows
references:
- Personal research, statistical analysis
- https://lolbas-project.github.io
status: experimental
tags:
- attack.privilege_escalation
- attack.defense_evasion
- attack.t1055
title: Suspicious Remote Thread Source
