author: faloker
date: 2020/02/12
description: Detects the change of database master password. It may be a part of data
  exfiltration.
detection:
  condition: selection_source
  selection_source:
    eventName: ModifyDBInstance
    eventSource: rds.amazonaws.com
    responseElements.pendingModifiedValues.masterUserPassword: '*'
falsepositives:
- Benign changes to a db instance
id: 8a63cdd4-6207-414a-85bc-7e032bd3c1a2
level: medium
logsource:
  product: aws
  service: cloudtrail
modified: 2021/08/20
product: aws
references:
- https://github.com/RhinoSecurityLabs/pacu/blob/866376cd711666c775bbfcde0524c817f2c5b181/pacu/modules/rds__explore_snapshots/main.py
service: cloudtrail
status: experimental
tags:
- attack.exfiltration
- attack.t1020
title: AWS RDS Master Password Change
