author: Austin Songer @austinsonger
date: 2021/10/03
description: Detects when an user creates or invokes a lambda function.
detection:
  condition: selection1 | near selection2
  selection1:
    eventName: CreateFunction
    eventSource: lambda.amazonaws.com
  selection2:
    eventName: Invoke
    eventSource: lambda.amazonaws.com
falsepositives:
- Lambda Function created or invoked may be performed by a system administrator. Verify
  whether the user identity, user agent, and/or hostname should be making changes
  in your environment.
- If known behavior is causing false positives, it can be exempted from the rule.
id: d914951b-52c8-485f-875e-86abab710c0b
level: low
logsource:
  product: aws
  service: cloudtrail
modified: 2021/10/13
product: aws
references:
- https://rhinosecuritylabs.com/aws/aws-privilege-escalation-methods-mitigation/
service: cloudtrail
status: experimental
tags:
- attack.privilege_escalation
- attack.t1078
title: AWS Lambda Function Created or Invoked
