author: Sittikorn S
date: 2021/07/06
description: Detects evade to Macie detection.
detection:
  condition: selection | count() by sourceIPAddress > 5
  selection:
    eventName:
    - ArchiveFindings
    - CreateFindingsFilter
    - DeleteMember
    - DisassociateFromMasterAccount
    - DisassociateMember
    - DisableMacie
    - DisableOrganizationAdminAccount
    - UpdateFindingsFilter
    - UpdateMacieSession
    - UpdateMemberSession
    - UpdateClassificationJob
  timeframe: 10m
falsepositives:
- System or Network administrator behaviors
fields:
- sourceIPAddress
- userIdentity.arn
id: 91f6a16c-ef71-437a-99ac-0b070e3ad221
level: medium
logsource:
  product: aws
  service: cloudtrail
product: aws
references:
- https://docs.aws.amazon.com/cli/latest/reference/macie/
service: cloudtrail
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001
title: AWS Macie Evasion
