author: vitaliy0x1
date: 2020/01/21
description: Detects disabling, deleting and updating of a Trail
detection:
  condition: selection_source
  selection_source:
    eventName:
    - StopLogging
    - UpdateTrail
    - DeleteTrail
    eventSource: cloudtrail.amazonaws.com
falsepositives:
- Valid change in a Trail
id: 4db60cc0-36fb-42b7-9b58-a5b53019fb74
level: medium
logsource:
  product: aws
  service: cloudtrail
modified: 2021/08/09
product: aws
references:
- https://docs.aws.amazon.com/awscloudtrail/latest/userguide/best-practices-security.html
service: cloudtrail
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001
title: AWS CloudTrail Important Change
