author: vitaliy0x1
date: 2020/01/21
description: Detects AWS root account usage
detection:
  condition: selection_usertype and not selection_eventtype
  selection_eventtype:
    eventType: AwsServiceEvent
  selection_usertype:
    userIdentity.type: Root
falsepositives:
- AWS Tasks That Require AWS Account Root User Credentials https://docs.aws.amazon.com/general/latest/gr/aws_tasks-that-require-root.html
id: 8ad1600d-e9dc-4251-b0ee-a65268f29add
level: medium
logsource:
  product: aws
  service: cloudtrail
modified: 2021/08/09
product: aws
references:
- https://docs.aws.amazon.com/IAM/latest/UserGuide/id_root-user.html
service: cloudtrail
status: experimental
tags:
- attack.privilege_escalation
- attack.t1078.004
title: AWS Root Credentials
