author: Darin Smith
date: 2021/05/17
description: Detects the modification of an EC2 snapshot's permissions to enable access
  from another account
detection:
  condition: selection_source
  selection_source:
    eventName: ModifySnapshotAttribute
    eventSource: ec2.amazonaws.com
falsepositives:
- Valid change to a snapshot's permissions
id: abae8fec-57bd-4f87-aff6-6e3db989843d
level: medium
logsource:
  product: aws
  service: cloudtrail
modified: 2021/08/19
product: aws
references:
- https://www.justice.gov/file/1080281/download
- https://attack.mitre.org/techniques/T1537/
service: cloudtrail
status: test
tags:
- attack.exfiltration
- attack.t1537
title: AWS Snapshot Backup Exfiltration
