author: Austin Songer @austinsonger
date: 2021/08/15
description: Detects when a EFS Fileshare is modified or deleted. You can't delete
  a file system that is in use. If the file system has any mount targets, the adversary
  must first delete them, so deletion of a mount will occur before deletion of a fileshare.
detection:
  condition: selection
  selection:
    eventName: DeleteFileSystem
    eventSource: elasticfilesystem.amazonaws.com
falsepositives:
- Unknown
id: 25cb1ba1-8a19-4a23-a198-d252664c8cef
level: medium
logsource:
  product: aws
  service: cloudtrail
product: aws
references:
- https://docs.aws.amazon.com/efs/latest/ug/API_DeleteFileSystem.html
service: cloudtrail
status: experimental
tags:
- attack.impact
title: AWS EFS Fileshare Modified or Deleted
