author: Sittikorn S
date: 2021/06/28
description: Detects the modification of the findings on SecurityHub.
detection:
  condition: selection
  selection:
    eventName:
    - BatchUpdateFindings
    - DeleteInsight
    - UpdateFindings
    - UpdateInsight
    eventSource: securityhub.amazonaws.com
falsepositives:
- System or Network administrator behaviors
- DEV, UAT, SAT environment. You should apply this rule with PROD environment only.
fields:
- sourceIPAddress
- userIdentity.arn
id: a607e1fe-74bf-4440-a3ec-b059b9103157
level: high
logsource:
  product: aws
  service: cloudtrail
product: aws
references:
- https://docs.aws.amazon.com/cli/latest/reference/securityhub/
service: cloudtrail
status: stable
tags:
- attack.defense_evasion
- attack.t1562
title: AWS SecurityHub Findings Evasion
