author: faloker
date: 2020/02/12
description: Detects AWS API key creation for a user by another user. Backdoored users
  can be used to obtain persistence in the AWS environment. Also with this alert,
  you can detect a flow of AWS keys in your org.
detection:
  condition: selection_source and not filter
  filter:
    userIdentity.arn|contains: responseElements.accessKey.userName
  selection_source:
    eventName: CreateAccessKey
    eventSource: iam.amazonaws.com
falsepositives:
- Adding user keys to their own accounts (the filter cannot cover all possible variants
  of user naming)
- AWS API keys legitimate exchange workflows
fields:
- userIdentity.arn
- responseElements.accessKey.userName
- errorCode
- errorMessage
id: 0a5177f4-6ca9-44c2-aacf-d3f3d8b6e4d2
level: medium
logsource:
  product: aws
  service: cloudtrail
modified: 2021/08/20
product: aws
references:
- https://github.com/RhinoSecurityLabs/pacu/blob/866376cd711666c775bbfcde0524c817f2c5b181/pacu/modules/iam__backdoor_users_keys/main.py
service: cloudtrail
status: experimental
tags:
- attack.persistence
- attack.t1098
title: AWS IAM Backdoor Users Keys
