author: faloker
date: 2020/02/11
description: Detects updates of the GuardDuty list of trusted IPs, perhaps to disable
  security alerts against malicious IPs.
detection:
  condition: selection_source
  selection_source:
    eventName: CreateIPSet
    eventSource: guardduty.amazonaws.com
falsepositives:
- Valid change in the GuardDuty (e.g. to ignore internal scanners)
id: 6e61ee20-ce00-4f8d-8aee-bedd8216f7e3
level: high
logsource:
  product: aws
  service: cloudtrail
modified: 2021/08/09
product: aws
references:
- https://github.com/RhinoSecurityLabs/pacu/blob/866376cd711666c775bbfcde0524c817f2c5b181/pacu/modules/guardduty__whitelist_ip/main.py#L9
service: cloudtrail
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001
title: AWS GuardDuty Important Change
