author: toffeebr33k
date: 2020/11/21
description: Detects enumeration of accounts configuration via api call to list different
  instances and services within a short period of time.
detection:
  condition: selection_eventname | count() > 50
  selection_eventname:
    eventName: list*
  timeframe: 10m
falsepositives:
- AWS Config or other configuration scanning activities
fields:
- userIdentity.arn
id: e9c14b23-47e2-4a8b-8a63-d36618e33d70
level: low
logsource:
  product: aws
  service: cloudtrail
modified: 2021/08/09
product: aws
service: cloudtrail
status: experimental
tags:
- attack.discovery
- attack.t1592
title: Account Enumeration on AWS
