author: faloker
date: 2020/02/12
description: Detects the recovery of a new public database instance from a snapshot.
  It may be a part of data exfiltration.
detection:
  condition: selection_source
  selection_source:
    eventName: RestoreDBInstanceFromDBSnapshot
    eventSource: rds.amazonaws.com
    responseElements.publiclyAccessible: 'true'
falsepositives:
- Unknown
id: c3f265c7-ff03-4056-8ab2-d486227b4599
level: high
logsource:
  product: aws
  service: cloudtrail
modified: 2021/08/20
product: aws
references:
- https://github.com/RhinoSecurityLabs/pacu/blob/866376cd711666c775bbfcde0524c817f2c5b181/pacu/modules/rds__explore_snapshots/main.py
service: cloudtrail
status: experimental
tags:
- attack.exfiltration
- attack.t1020
title: Restore Public AWS RDS Instance
