author: faloker
date: 2020/02/11
description: Detects bulk downloading of User Data associated with AWS EC2 instances.
  Instance User Data may include installation scripts and hard-coded secrets for deployment.
detection:
  condition: selection_source | count() > 10
  selection_source:
    eventName: DescribeInstanceAttribute
    eventSource: ec2.amazonaws.com
    requestParameters.attribute: userData
  timeframe: 30m
falsepositives:
- Assets management software like device42
id: 26ff4080-194e-47e7-9889-ef7602efed0c
level: medium
logsource:
  product: aws
  service: cloudtrail
modified: 2021/08/20
product: aws
references:
- https://github.com/RhinoSecurityLabs/pacu/blob/866376cd711666c775bbfcde0524c817f2c5b181/pacu/modules/ec2__download_userdata/main.py
service: cloudtrail
status: experimental
tags:
- attack.exfiltration
- attack.t1020
title: AWS EC2 Download Userdata
