author: Austin Songer @austinsonger
date: 2021/07/24
description: Detects when an ElastiCache security group has been created.
detection:
  condition: selection
  selection:
    eventName: CreateCacheSecurityGroup
    eventSource: elasticache.amazonaws.com
falsepositives:
- A ElastiCache security group may be created by a system or network administrator.
  Verify whether the user identity, user agent, and/or hostname should be making changes
  in your environment. Security group creations from unfamiliar users or hosts should
  be investigated. If known behavior is causing false positives, it can be exempted
  from the rule.
id: 4ae68615-866f-4304-b24b-ba048dfa5ca7
level: low
logsource:
  product: aws
  service: cloudtrail
modified: 2021/08/19
product: aws
references:
- https://github.com/elastic/detection-rules/blob/598f3d7e0a63221c0703ad9a0ea7e22e7bc5961e/rules/integrations/aws/persistence_elasticache_security_group_creation.toml
service: cloudtrail
status: experimental
tags:
- attack.persistence
- attack.t1136
- attack.t1136.003
title: AWS ElastiCache Security Group Created
