author: Sittikorn S
date: 2021/06/29
description: Identifies disabling of default Amazon Elastic Block Store (EBS) encryption
  in the current region. Disabling default encryption does not change the encryption
  status of your existing volumes.
detection:
  condition: selection
  selection:
    eventName: DisableEbsEncryptionByDefault
    eventSource: ec2.amazonaws.com
falsepositives:
- System Administrator Activities
- DEV, UAT, SAT environment. You should apply this rule with PROD account only.
id: 16124c2d-e40b-4fcc-8f2c-5ab7870a2223
level: medium
logsource:
  product: aws
  service: cloudtrail
modified: 2021/08/20
product: aws
references:
- https://docs.aws.amazon.com/AWSEC2/latest/APIReference/API_DisableEbsEncryptionByDefault.html
service: cloudtrail
status: stable
tags:
- attack.impact
- attack.t1486
- attack.t1565
title: AWS EC2 Disable EBS Encryption
