author: Daniil Yugoslavskiy, oscd.community
category: dns
date: 2019/10/24
description: High DNS requests amount from host per short period of time
detection:
  condition: selection | count() by src_ip > 1000
  selection:
    query: '*'
  timeframe: 1m
falsepositives:
- Legitimate high DNS requests rate to domain name which should be added to whitelist
id: b4163085-4001-46a3-a79a-55d8bbbc7a3a
level: medium
logsource:
  category: dns
  product: suricata
  service: dns
modified: 2021/09/21
product: suricata
service: dns
status: experimental
tags:
- attack.exfiltration
- attack.t1048.003
- attack.command_and_control
- attack.t1071.004
title: High DNS Requests Rate
