author: Daniil Yugoslavskiy, oscd.community
category: dns
date: 2019/10/24
description: Extremely high rate of TXT record type DNS requests from host per short
  period of time. Possible result of Do-exfiltration tool execution
detection:
  condition: selection | count() by src_ip > 50
  selection:
    record_type: TXT
  timeframe: 1m
falsepositives:
- Legitimate high DNS TXT requests rate to domain name which should be added to whitelist
id: f0a8cedc-1d22-4453-9c44-8d9f4ebd5d35
level: medium
logsource:
  category: dns
  product: suricata
  service: dns
modified: 2020/08/27
product: suricata
service: dns
status: experimental
tags:
- attack.exfiltration
- attack.t1048.003
- attack.command_and_control
- attack.t1071.004
title: High TXT Records Requests Rate
