author: Patrick Bareiss
category: dns
date: 2019/04/07
description: Normally, DNS logs contain a limited amount of different dns queries
  for a single domain. This rule detects a high amount of queries for a single domain,
  which can be an indicator that DNS is used to transfer data.
detection:
  condition: selection | count(dns_query) by parent_domain > 1000
  selection:
    parent_domain: '*'
falsepositives:
- Valid software, which uses dns for transferring data
id: 1ec4b281-aa65-46a2-bdae-5fd830ed914e
level: high
logsource:
  category: dns
  product: suricata
  service: dns
modified: 2020/08/27
product: suricata
references:
- https://zeltser.com/c2-dns-tunneling/
- https://patrick-bareiss.com/detect-c2-traffic-over-dns-using-sigma/
service: dns
status: experimental
tags:
- attack.command_and_control
- attack.t1071.004
- attack.exfiltration
- attack.t1048.003
title: Possible DNS Tunneling
