category: registry_event
detection:
  condition: 1 of them
  selection1:
    winlog.event_data.TargetObject|endswith: \EulaAccepted
id: 25ffa65d-76d8-4da5-a832-3f2b0136e133
logsource:
  category: registry_event
  product: windows
product: windows
