author: omkar72
category: registry_event
date: 2020/10/25
description: Detects the addition of office test registry that allows a user to specify
  an arbitrary DLL that will be executed every time an Office application is started
detection:
  condition: selection_registry
  selection_registry:
    winlog.event_data.TargetObject:
    - HKEY_CURRENT_USER\Software\Microsoft\Office test\Special\Perf
    - HKEY_LOCAL_MACHINE\Software\Microsoft\Office test\Special\Perf
falsepositives:
- Unlikely
id: 3d27f6dd-1c74-4687-b4fa-ca849d128d1c
level: medium
logsource:
  category: registry_event
  product: windows
product: windows
references:
- https://attack.mitre.org/techniques/T1137/002/
status: experimental
tags:
- attack.persistence
- attack.t1137.002
title: Office Application Startup - Office Test
