category: registry_event
detection:
  condition: 1 of them
  dnsregmod:
    winlog.event_data.TargetObject|endswith: \services\DNS\Parameters\ServerLevelPluginDll
id: e61e8a88-59a9-451c-874e-70fcc9740d67
logsource:
  category: registry_event
  product: windows
product: windows
