author: Austin Songer @austinsonger
category: registry_event
date: 2021/08/04
description: Detects disabling Windows Defender Tamper Protection
detection:
  condition: selection
  selection:
    winlog.event_data.Details: DWORD (0)
    winlog.event_data.EventType: SetValue
    winlog.event_data.TargetObject|contains: HKLM\SOFTWARE\Microsoft\Windows Defender\Features\TamperProtection
falsepositives:
- Unknown
id: 93d298a1-d28f-47f1-a468-d971e7796679
level: medium
logsource:
  category: registry_event
  product: windows
product: windows
references:
- https://www.tenforums.com/tutorials/123792-turn-off-tamper-protection-microsoft-defender-antivirus.html
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001
title: Disable Tamper Protection on Windows Defender
