author: Florian Roth
category: registry_event
date: 2019/10/01
description: Detects the suspicious RUN keys created by software located in Download
  or temporary Outlook/Internet Explorer directories
detection:
  condition: selection
  selection:
    winlog.event_data.Image|contains:
    - \Downloads\
    - \Temporary Internet Files\Content.Outlook\
    - \Local Settings\Temporary Internet Files\
    winlog.event_data.TargetObject|contains: \SOFTWARE\Microsoft\Windows\CurrentVersion\Run\
falsepositives:
- Software installers downloaded and used by users
id: 9c5037d1-c568-49b3-88c7-9846a5bdc2be
level: high
logsource:
  category: registry_event
  product: windows
modified: 2020/09/06
product: windows
references:
- https://app.any.run/tasks/c5bef5b7-f484-4c43-9cf3-d5c5c7839def/
status: experimental
tags:
- attack.persistence
- attack.t1547.001
title: Suspicious Run Key from Download
