author: Karneades, Jonhnathan Ribeiro
category: registry_event
date: 2018/04/11
description: Detects persistence registry keys
detection:
  condition: selection_reg1 and selection_reg2
  selection_reg1:
    winlog.event_data.TargetObject|contains:
    - \SOFTWARE\Microsoft\Windows NT\CurrentVersion
  selection_reg2:
  - winlog.event_data.TargetObject|contains|all:
    - \Image File Execution Options\
    - \GlobalFlag
  - winlog.event_data.TargetObject|contains|all:
    - SilentProcessExit\
    - \ReportingMode
  - winlog.event_data.TargetObject|contains|all:
    - SilentProcessExit\
    - \MonitorProcess
falsepositives:
- unknown
id: 36803969-5421-41ec-b92f-8500f79c23b0
level: critical
logsource:
  category: registry_event
  product: windows
modified: 2020/09/06
product: windows
references:
- https://oddvar.moe/2018/04/10/persistence-using-globalflags-in-image-file-execution-options-hidden-from-autoruns-exe/
tags:
- attack.privilege_escalation
- attack.persistence
- attack.defense_evasion
- attack.t1546.012
- car.2013-01-002
title: Registry Persistence Mechanisms
