author: Tom Ueltschi (@c_APT_ure)
category: registry_event
date: 2019/01/12
description: Detects creation or execution of UserInitMprLogonScript persistence method
detection:
  condition: create_keywords_reg
  create_keywords_reg:
    winlog.event_data.TargetObject|contains: UserInitMprLogonScript
falsepositives:
- exclude legitimate logon scripts
- penetration tests, red teaming
id: 9ace0707-b560-49b8-b6ca-5148b42f39fb
level: high
logsource:
  category: registry_event
  product: windows
modified: 2020/07/01
product: windows
references:
- https://attack.mitre.org/techniques/T1037/
status: experimental
tags:
- attack.t1037.001
- attack.persistence
- attack.lateral_movement
title: Logon Scripts (UserInitMprLogonScript) Registry
