category: process_creation
detection:
  condition: 1 of them
  selection_process:
    winlog.event_data.CommandLine|contains:
    - sethc.exe
    - utilman.exe
    - osk.exe
    - Magnify.exe
    - Narrator.exe
    - DisplaySwitch.exe
    winlog.event_data.Image|endswith: \cmd.exe
    winlog.event_data.ParentImage|endswith: \winlogon.exe
id: 2fdefcb3-dbda-401e-ae23-f0db027628bc
logsource:
  category: process_creation
  product: windows
product: windows
