author: Alexander Rausch
category: registry_event
date: 2020/06/24
description: Detects actions caused by the RedMimicry Winnti playbook
detection:
  condition: selection
  selection:
    winlog.event_data.TargetObject|contains: HKLM\SOFTWARE\Microsoft\HTMLHelp\data
falsepositives:
- Unknown
id: 5b175490-b652-4b02-b1de-5b5b4083c5f8
level: high
logsource:
  category: registry_event
  product: windows
product: windows
references:
- https://redmimicry.com
tags:
- attack.defense_evasion
- attack.t1112
title: RedMimicry Winnti Playbook Registry Manipulation
