category: process_creation
detection:
  condition: 1 of them
  selection2:
    winlog.event_data.CommandLine|contains: 'loaddll -a '
id: 9fefd33c-339d-4495-9cba-b96ca006f512
logsource:
  category: process_creation
  product: windows
product: windows
