author: Antonlovesdnb
category: registry_event
date: 2020/02/19
description: Alerts on trust record modification within the registry, indicating usage
  of macros
detection:
  condition: selection
  selection:
    winlog.event_data.TargetObject|contains: TrustRecords
falsepositives:
- Alerts on legitimate macro usage as well, will need to filter as appropriate
id: 295a59c1-7b79-4b47-a930-df12c15fc9c2
level: medium
logsource:
  category: registry_event
  product: windows
modified: 2020/09/06
product: windows
references:
- https://outflank.nl/blog/2018/01/16/hunting-for-evil-detect-macros-being-executed/
- http://az4n6.blogspot.com/2016/02/more-on-trust-records-macros-and.html
status: experimental
tags:
- attack.initial_access
- attack.t1566.001
title: Windows Registry Trust Record Modification
