author: Christian Burkard
category: registry_event
date: 2021/08/30
description: Detects the pattern of UAC Bypass using a path parsing issue in winsat.exe
  (UACMe 52)
detection:
  condition: selection
  selection:
    winlog.event_data.Details|endswith: \appdata\local\temp\system32\winsat.exe
    winlog.event_data.Details|startswith: c:\users\
    winlog.event_data.TargetObject|contains: \Root\InventoryApplicationFile\winsat.exe|
    winlog.event_data.TargetObject|endswith: \LowerCaseLongPath
falsepositives:
- Unknown
id: 6597be7b-ac61-4ac8-bef4-d3ec88174853
level: high
logsource:
  category: registry_event
  product: windows
product: windows
references:
- https://github.com/hfiref0x/UACME
status: experimental
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1548.002
title: UAC Bypass Abusing Winsat Path Parsing - Registry
