category: registry_event
detection:
  condition: 1 of them
  selection1:
    winlog.event_data.TargetObject|contains: \SYSTEM\CurrentControlSet\services\null\Instance
id: 47e0852a-cf81-4494-a8e6-31864f8c86ed
logsource:
  category: registry_event
  product: windows
product: windows
