author: oscd.community, Natalia Shornikova
category: registry_event
date: 2020/10/06
description: Detects that a powershell code is written to the registry as a service.
detection:
  condition: selection
  selection:
    winlog.event_data.Details|contains:
    - powershell
    - pwsh
    winlog.event_data.TargetObject|contains: \Services\
    winlog.event_data.TargetObject|endswith: \ImagePath
falsepositives:
- Unknown
id: 4a5f5a5e-ac01-474b-9b4e-d61298c9df1d
level: high
logsource:
  category: registry_event
  product: windows
modified: 2021/05/21
product: windows
references:
- https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse
status: experimental
tags:
- attack.execution
- attack.t1569.002
title: PowerShell as a Service in Registry
