category: process_creation
detection:
  condition: methprocess and not filterprocess
  filterprocess:
    winlog.event_data.Image|endswith: \mmc.exe
  methprocess:
    winlog.event_data.ParentImage|endswith: \eventvwr.exe
fields:
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: be344333-921d-4c4d-8bb8-e584cf584780
logsource:
  category: process_creation
  product: windows
product: windows
