author: Omkar Gudhate
category: registry_event
date: 2020/09/27
description: Detects changes to 'HKCU\Software\Classes\Folder\shell\open\command\DelegateExecute'
detection:
  condition: selection
  selection:
    winlog.event_data.TargetObject:
    - HKCU\Software\Classes\Folder\shell\open\command\DelegateExecute
falsepositives:
- unknown
id: 07743f65-7ec9-404a-a519-913db7118a8d
level: high
logsource:
  category: registry_event
  product: windows
product: windows
references:
- http://blog.sevagas.com/?Yet-another-sdclt-UAC-bypass
- https://www.exploit-db.com/exploits/47696
status: experimental
tags:
- attack.privilege_escalation
- attack.t1546
- attack.t1548
title: COM Hijack via Sdclt
