author: Florian Roth
category: registry_event
date: 2021/02/26
description: Detects changes to the Registry in which a monitor program gets registered
  to monitor the exit of another process
detection:
  condition: selection
  selection:
    winlog.event_data.Details|contains: MonitorProcess
    winlog.event_data.TargetObject|contains: Microsoft\Windows NT\CurrentVersion\SilentProcessExit
falsepositives:
- Unknown
id: c81fe886-cac0-4913-a511-2822d72ff505
level: high
logsource:
  category: registry_event
  product: windows
product: windows
references:
- https://oddvar.moe/2018/04/10/persistence-using-globalflags-in-image-file-execution-options-hidden-from-autoruns-exe/
- https://www.deepinstinct.com/2021/02/16/lsass-memory-dumps-are-stealthier-than-ever-before-part-2/
tags:
- attack.persistence
- attack.t1546.012
title: SilentProcessExit Monitor Registrytion
