author: Ilyas Ochkov, oscd.community
category: registry_event
date: 2019/10/25
description: DLLs that are specified in the AppInit_DLLs value in the Registry key
  HKLM\Software\Microsoft\Windows NT\CurrentVersion\Windows are loaded by user32.dll
  into every process that loads user32.dll
detection:
  condition: selection
  selection:
  - winlog.event_data.TargetObject|endswith:
    - \SOFTWARE\Microsoft\Windows NT\CurrentVersion\Windows\AppInit_Dlls
    - \SOFTWARE\Wow6432Node\Microsoft\Windows NT\CurrentVersion\Windows\AppInit_Dlls
  - winlog.event_data.NewName|endswith:
    - \SOFTWARE\Microsoft\Windows NT\CurrentVersion\Windows\AppInit_Dlls
    - \SOFTWARE\Wow6432Node\Microsoft\Windows NT\CurrentVersion\Windows\AppInit_Dlls
falsepositives:
- Unknown
fields:
- winlog.event_id
- winlog.event_data.Image
- winlog.event_data.TargetObject
- winlog.event_data.NewName
id: 4f84b697-c9ed-4420-8ab5-e09af5b2345d
level: medium
logsource:
  category: registry_event
  product: windows
modified: 2020/09/06
product: windows
references:
- https://eqllib.readthedocs.io/en/latest/analytics/822dc4c5-b355-4df8-bd37-29c458997b8f.html
status: experimental
tags:
- attack.persistence
- attack.t1546.010
title: New DLL Added to AppInit_DLLs Registry Key
