author: Tobias Michalski
category: registry_event
date: 2021/06/10
description: Detects the manipulation of persistent URLs which could execute malicious
  code
detection:
  condition: selection1 and (selectionStamp or selectionUserDefined)
  selection1:
    winlog.event_data.TargetObject|contains:
    - Software\Microsoft\Office\
    - \Outlook\Today\
  selectionStamp:
    winlog.event_data.Details: DWORD (0x00000001)
    winlog.event_data.TargetObject|endswith:
    - Stamp
  selectionUserDefined:
    winlog.event_data.TargetObject|endswith:
    - UserDefinedUrl
falsepositives:
- unknown
fields:
- winlog.event_data.Details
id: 487bb375-12ef-41f6-baae-c6a1572b4dd1
level: high
logsource:
  category: registry_event
  product: windows
product: windows
references:
- https://speakerdeck.com/heirhabarov/hunting-for-persistence-via-microsoft-exchange-server-or-outlook?slide=70
status: experimental
tags:
- attack.persistence
- attack.t1112
title: Persistent Outlook Landing Pages
