author: Aleksandr Akhremchik, @aleqs4ndr, ocsd.community
date: 2020/10/15
description: Detects Netlogon Elevation of Privilege Vulnerability aka Zerologon (CVE-2020-1472)
detection:
  condition: selection and not filter
  filter:
    PasswordLastSet: '-'
  selection:
    winlog.event_data.SubjectUserName: ANONYMOUS LOGON
    winlog.event_data.TargetUserName: '%DC-MACHINE-NAME%'
    winlog.event_id: 4742
falsepositives:
- automatic DC computer account password change
- legitimate DC computer account password change
id: dd7876d8-0f09-11eb-adc1-0242ac120002
level: high
logsource:
  product: windows
  service: security
modified: 2021/07/07
product: windows
references:
- https://portal.msrc.microsoft.com/en-US/security-guidance/advisory/CVE-2020-1472
- https://www.logpoint.com/en/blog/detecting-zerologon-vulnerability-in-logpoint/
service: security
status: experimental
tags:
- attack.t1068
- attack.privilege_escalation
title: Possible Zerologon (CVE-2020-1472) Exploitation
