category: file_event
detection:
  condition: selection
  selection:
    winlog.event_data.TargetFilename: C:\Windows\System32\drivers\MoriyaStreamWatchmen.sys
id: a1507d71-0b60-44f6-b17c-bf53220fdd88
logsource:
  category: file_event
  product: windows
product: windows
