detection:
  condition: selection
  selection:
    winlog.event_id:
    - 517
    - 1102
id: d99b79d2-0a6f-4f46-ad8b-260b6e17f982
logsource:
  product: windows
  service: security
product: windows
service: security
