category: process_creation
detection:
  condition: selection
  selection:
    winlog.event_data.CommandLine|contains|all:
    - 'Compress-Archive '
    - ' -Path '
    - ' -DestinationPath '
    - $env:TEMP\
id: 85a8e5ba-bd03-4bfb-bbfa-a4409a8f8b98
logsource:
  category: process_creation
  product: windows
product: windows
