author: Roberto Rodriguez @Cyb3rWard0g
date: 2019/08/10
description: Detects access to a protected_storage service over the network. Potential
  abuse of DPAPI to extract domain backup keys from Domain Controllers
detection:
  condition: selection
  selection:
    winlog.event_data.RelativeTargetName: protected_storage
    winlog.event_data.ShareName|contains: IPC
    winlog.event_id: 5145
falsepositives:
- Unknown
id: 45545954-4016-43c6-855e-eae8f1c369dc
level: critical
logsource:
  product: windows
  service: security
modified: 2020/08/23
product: windows
references:
- https://threathunterplaybook.com/notebooks/windows/06_credential_access/WIN-190620024610.html
service: security
status: experimental
tags:
- attack.lateral_movement
- attack.t1021.002
title: Protected Storage Service Access
