author: Thomas Patzke
date: 2019/12/03
description: Addition of domains is seldom and should be verified for legitimacy.
detection:
  condition: selection
  selection:
    winlog.event_id: 4706
falsepositives:
- Legitimate extension of domain structure
id: 0255a820-e564-4e40-af2b-6ac61160335c
level: medium
logsource:
  product: windows
  service: security
product: windows
service: security
status: stable
tags:
- attack.persistence
title: Addition of Domain Trusts
