author: Sreeman
date: 2020/03/13
description: The .SettingContent-ms file type was introduced in Windows 10 and allows
  a user to create "shortcuts" to various Windows 10 setting pages. These files are
  simply XML and contain paths to various Windows 10 settings binaries.
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.FilePath|contains: immersivecontrolpanel
  selection:
    winlog.event_data.CommandLine|contains: .SettingContent-ms
falsepositives:
- unknown
fields:
- winlog.event_data.ParentProcess
- winlog.event_data.CommandLine
- winlog.event_data.ParentCommandLine
id: 24de4f3b-804c-4165-b442-5a06a2302c7e
level: medium
logsource:
  product: windows
  service: security
modified: 2021/08/09
product: windows
references:
- https://posts.specterops.io/the-tale-of-settingcontent-ms-files-f1ea253e4d39
service: security
tags:
- attack.t1204
- attack.t1566.001
- attack.execution
- attack.initial_access
title: Arbitrary Shell Command Execution Via Settingcontent-Ms
