definition: 'Requirements: Audit Policy : Object Access > Audit Registry (Success)'
detection:
  condition: selection
  selection:
    winlog.event_data.ObjectName|contains|all:
    - \REGISTRY\MACHINE\SYSTEM
    - ControlSet
    - \Control\Lsa
    winlog.event_data.ObjectValueName:
    - LmCompatibilityLevel
    - NtlmMinClientSec
    - RestrictSendingNTLMTraffic
    winlog.event_id: 4657
falsepositives:
- Unknown
id: d3abac66-f11c-4ed0-8acb-50cc29c97eed
level: critical
logsource:
  definition: 'Requirements: Audit Policy : Object Access > Audit Registry (Success)'
  product: windows
  service: security
product: windows
service: security
