author: Syed Hasan (@syedhasan009)
date: 2021/05/29
definition: The advanced audit policy setting "Object Access > Audit Removable Storage"
  must be configured for Success/Failure
description: Detects the mount of ISO images on an endpoint
detection:
  condition: selection
  selection:
    ObjectServer: Security
    winlog.event_data.ObjectName: \Device\CdRom*
    winlog.event_data.ObjectType: File
    winlog.event_id: 4663
falsepositives:
- Software installation ISO files
id: 0248a7bc-8a9a-4cd8-a57e-3ae8e073a073
level: medium
logsource:
  definition: The advanced audit policy setting "Object Access > Audit Removable Storage"
    must be configured for Success/Failure
  product: windows
  service: security
product: windows
references:
- https://www.trendmicro.com/vinfo/hk-en/security/news/cybercrime-and-digital-threats/malicious-spam-campaign-uses-iso-image-files-to-deliver-lokibot-and-nanocore
- https://www.proofpoint.com/us/blog/threat-insight/threat-actor-profile-ta2719-uses-colorful-lures-deliver-rats-local-languages
- https://twitter.com/MsftSecIntel/status/1257324139515269121
service: security
status: experimental
tags:
- attack.initial_access
- attack.t1566.001
title: ISO Image Mount
