author: Samir Bousseaden
date: 2019/04/03
definition: The advanced audit policy setting "Object Access > Audit Detailed File
  Share" must be configured for Success/Failure
description: Detects remote service activity via remote access to the svcctl named
  pipe
detection:
  condition: selection
  selection:
    Accesses|contains: WriteData
    winlog.event_data.RelativeTargetName: svcctl
    winlog.event_data.ShareName: \\*\IPC$
    winlog.event_id: 5145
falsepositives:
- pentesting
id: 586a8d6b-6bfe-4ad9-9d78-888cd2fe50c3
level: medium
logsource:
  definition: The advanced audit policy setting "Object Access > Audit Detailed File
    Share" must be configured for Success/Failure
  product: windows
  service: security
product: windows
references:
- https://blog.menasec.net/2019/03/threat-hunting-26-remote-windows.html
service: security
tags:
- attack.lateral_movement
- attack.persistence
- attack.t1021.002
title: Remote Service Activity via SVCCTL Named Pipe
