author: '@neu5ron'
date: 2017/07/30
definition: 'Requirements: Audit Policy : Account Management > Audit User Account
  Management, Group Policy : Computer Configuration\Windows Settings\Security Settings\Advanced
  Audit Policy Configuration\Audit Policies\Account Management\Audit User Account
  Management'
description: Detects scenario where weak encryption is enabled for a user profile
  which could be used for hash/password cracking.
detection:
  condition: selection and ((newuac_des and not olduac_des) or (newuac_preauth and
    not olduac_preauth) or (newuac_encrypted and not olduac_encrypted))
  newuac_des:
    NewUacValue|endswith:
    - 8???
    - 9???
    - A???
    - B???
    - C???
    - D???
    - E???
    - F???
  newuac_encrypted:
    NewUacValue|endswith:
    - 8??
    - 9??
    - A??
    - B??
    - C??
    - D??
    - E??
    - F??
  newuac_preauth:
    NewUacValue|endswith:
    - 1????
    - 3????
    - 5????
    - 7????
    - 9????
    - B????
    - D????
    - F????
  olduac_des:
    OldUacValue|endswith:
    - 8???
    - 9???
    - A???
    - B???
    - C???
    - D???
    - E???
    - F???
  olduac_encrypted:
    OldUacValue|endswith:
    - 8??
    - 9??
    - A??
    - B??
    - C??
    - D??
    - E??
    - F??
  olduac_preauth:
    OldUacValue|endswith:
    - 1????
    - 3????
    - 5????
    - 7????
    - 9????
    - B????
    - D????
    - F????
  selection:
    winlog.event_id: 4738
falsepositives:
- Unknown
id: f6de9536-0441-4b3f-a646-f4e00f300ffd
level: high
logsource:
  definition: 'Requirements: Audit Policy : Account Management > Audit User Account
    Management, Group Policy : Computer Configuration\Windows Settings\Security Settings\Advanced
    Audit Policy Configuration\Audit Policies\Account Management\Audit User Account
    Management'
  product: windows
  service: security
product: windows
references:
- https://adsecurity.org/?p=2053
- https://www.harmj0y.net/blog/activedirectory/roasting-as-reps/
service: security
tags:
- attack.defense_evasion
- attack.t1562.001
title: Weak Encryption Enabled and Kerberoast
