detection:
  condition: selection
  selection:
    ContextInfo|contains|all:
    - 'Compress-Archive '
    - ' -Path '
    - ' -DestinationPath '
    - $env:TEMP\
id: b7a3c9a3-09ea-4934-8864-6a32cacd98d9
logsource:
  product: windows
  service: powershell
product: windows
service: powershell
