author: Mauricio Velazco, Michael Haag
date: 2021/09/02
definition: The advanced audit policy setting "Account Logon > Kerberos Authentication
  Service" must be configured for Success/Failure
description: Detect suspicious Kerberos TGT requests. Once an attacer obtains a computer
  certificate by abusing Active Directory Certificate Services in combination with
  PetitPotam, the next step would be to leverage the certificate for malicious purposes.
  One way of doing this is to request a Kerberos Ticket Granting Ticket using a tool
  like Rubeus. This request will generate a 4768 event with some unusual fields depending
  on the environment. This analytic will require tuning, we recommend filtering Account_Name
  to the Domain Controller computer accounts.
detection:
  condition: selection and not filter_local
  filter_local:
    winlog.event_data.IpAddress: ::1
  selection:
    CertThumbprint: '*'
    winlog.event_data.TargetUserName|endswith: $
    winlog.event_id: 4768
falsepositives:
- False positives are possible if the environment is using certificates for authentication.
  We recommend filtering Account_Name to the Domain Controller computer accounts.
id: 6a53d871-682d-40b6-83e0-b7c1a6c4e3a5
level: high
logsource:
  definition: The advanced audit policy setting "Account Logon > Kerberos Authentication
    Service" must be configured for Success/Failure
  product: windows
  service: security
product: windows
references:
- https://github.com/topotam/PetitPotam
- https://isc.sans.edu/forums/diary/Active+Directory+Certificate+Services+ADCS+PKI+domain+admin+vulnerability/27668/
- https://github.com/splunk/security_content/blob/develop/detections/endpoint/petitpotam_suspicious_kerberos_tgt_request.yml
service: security
tags:
- attack.credential_access
- attack.t1187
title: PetitPotam Suspicious Kerberos TGT Request
