author: Roberto Rodriguez (source), Dominik Schaudel (rule)
date: 2018/02/12
description: Detects successful logon with logon type 9 (NewCredentials) which matches
  the Overpass the Hash behavior of e.g Mimikatz's sekurlsa::pth module.
detection:
  condition: selection
  selection:
    winlog.event_data.AuthenticationPackageName: Negotiate
    winlog.event_data.LogonProcessName: seclogo
    winlog.event_data.LogonType: 9
    winlog.event_id: 4624
falsepositives:
- Runas command-line tool using /netonly parameter
id: 192a0330-c20b-4356-90b6-7b7049ae0b87
level: high
logsource:
  product: windows
  service: security
product: windows
references:
- https://cyberwardog.blogspot.de/2017/04/chronicles-of-threat-hunter-hunting-for.html
service: security
status: experimental
tags:
- attack.lateral_movement
- attack.s0002
- attack.t1550.002
title: Successful Overpass the Hash Attempt
