author: Florian Roth
date: 2017/05/31
description: This events that are generated when using the hacktool Ruler by Sensepost
detection:
  condition: (1 of selection*)
  selection1:
    winlog.event_data.Workstation: RULER
    winlog.event_id: 4776
  selection2:
    winlog.event_data.WorkstationName: RULER
    winlog.event_id:
    - 4624
    - 4625
falsepositives:
- Go utilities that use staaldraad awesome NTLM library
id: 24549159-ac1b-479c-8175-d42aea947cae
level: high
logsource:
  product: windows
  service: security
modified: 2021/08/09
product: windows
references:
- https://github.com/sensepost/ruler
- https://github.com/sensepost/ruler/issues/47
- https://github.com/staaldraad/go-ntlm/blob/master/ntlm/ntlmv1.go#L427
- https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4776
- https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4624
service: security
tags:
- attack.discovery
- attack.execution
- attack.t1087
- attack.t1114
- attack.t1059
- attack.t1550.002
title: Hacktool Ruler
