detection:
  condition: selection
  selection:
    winlog.event_data.Source: Microsoft-Windows-Eventlog
    winlog.event_id: 104
id: a62b37e0-45d3-48d9-a517-90c1a1b0186b
logsource:
  product: windows
  service: system
product: windows
service: system
