author: Bhabesh Raj
date: 2020/12/14
definition: The advanced audit policy setting "Object Access > Audit Detailed File
  Share" must be configured for Success/Failure
description: Detects execution of Impacket's psexec.py.
detection:
  condition: selection1
  selection1:
    winlog.event_data.RelativeTargetName|contains:
    - RemCom_stdint
    - RemCom_stdoutt
    - RemCom_stderrt
    winlog.event_data.ShareName: \\*\IPC$
    winlog.event_id: 5145
falsepositives:
- nothing observed so far
id: 32d56ea1-417f-44ff-822b-882873f5f43b
level: high
logsource:
  definition: The advanced audit policy setting "Object Access > Audit Detailed File
    Share" must be configured for Success/Failure
  product: windows
  service: security
product: windows
references:
- https://blog.menasec.net/2019/02/threat-hunting-3-detecting-psexec.html
service: security
tags:
- attack.lateral_movement
- attack.t1021.002
title: Impacket PsExec Execution
