author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2021/04/12
description: Rule to detect the Hybrid Connection Manager service installation.
detection:
  condition: selection
  selection:
    winlog.event_data.ServiceFileName|contains: HybridConnectionManager
    winlog.event_data.ServiceName: HybridConnectionManager
    winlog.event_id: 4697
falsepositives:
- Legitimate use of Hybrid Connection Manager via Azure function apps.
id: 0ee4d8a5-4e67-4faf-acfa-62a78457d1f2
level: high
logsource:
  product: windows
  service: security
modified: 2021/08/09
product: windows
references:
- https://twitter.com/Cyb3rWard0g/status/1381642789369286662
service: security
status: experimental
tags:
- attack.persistence
title: HybridConnectionManager Service Installation
