author: Roberto Rodriguez @Cyb3rWard0g
date: 2019/07/26
description: Detects potential abuse of Active Directory Replication Service (ADRS)
  from a non machine account to request credentials.
detection:
  condition: selection and not filter
  filter:
  - winlog.event_data.SubjectUserName|endswith: $
  - winlog.event_data.SubjectUserName|startswith: MSOL_
  selection:
    winlog.event_data.AccessMask: '0x100'
    winlog.event_data.Properties|contains:
    - 1131f6aa-9c07-11d1-f79f-00c04fc2dcd2
    - 1131f6ad-9c07-11d1-f79f-00c04fc2dcd2
    - 89e95b76-444d-4c62-991a-0facbeda640c
    winlog.event_id: 4662
falsepositives:
- Unknown
fields:
- winlog.ComputerName
- winlog.event_data.SubjectDomainName
- winlog.event_data.SubjectUserName
id: 17d619c1-e020-4347-957e-1d1207455c93
level: critical
logsource:
  product: windows
  service: security
modified: 2020/08/23
product: windows
references:
- https://threathunterplaybook.com/notebooks/windows/06_credential_access/WIN-180815210510.html
service: security
status: experimental
tags:
- attack.credential_access
- attack.t1003.006
title: Active Directory Replication from Non Machine Account
