author: oscd.community, Teymur Kheirkhabarov @HeirhabarovT, Zach Stanford @svch0st
date: 2020/10/05
definition: null
description: Detects suspicious processes logging on with explicit credentials
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.TargetServerName: localhost
  selection:
    winlog.event_data.Image|endswith:
    - \cmd.exe
    - \powershell.exe
    - \pwsh.exe
    - \winrs.exe
    - \wmic.exe
    - \net.exe
    - \net1.exe
    - \reg.exe
    winlog.event_id: 4648
falsepositives:
- Administrators that use the RunAS command or scheduled tasks
id: 941e5c45-cda7-4864-8cea-bbb7458d194a
level: medium
logsource:
  definition: null
  product: windows
  service: security
modified: 2021/07/07
product: windows
references:
- https://drive.google.com/file/d/1lKya3_mLnR3UQuCoiYruO3qgu052_iS_/view
service: security
status: experimental
tags:
- attack.t1078
- attack.lateral_movement
title: Suspicious Remote Logon with Explicit Credentials
