author: Roberto Rodriguez @Cyb3rWard0g
date: 2019/06/20
description: Detects potential mimikatz-like tools accessing LSASS from non system
  account
detection:
  condition: selection and not filter1 and not filter2
  filter1:
    winlog.event_data.SubjectUserName|endswith: $
  filter2:
    winlog.event_data.ProcessName|startswith: C:\Program Files
  selection:
    winlog.event_data.AccessMask:
    - '0x40'
    - '0x1400'
    - '0x1000'
    - '0x100000'
    - '0x1410'
    - '0x1010'
    - '0x1438'
    - '0x143a'
    - '0x1418'
    - '0x1f0fff'
    - '0x1f1fff'
    - '0x1f2fff'
    - '0x1f3fff'
    - '40'
    - '1400'
    - '1000'
    - '100000'
    - '1410'
    - '1010'
    - '1438'
    - 143a
    - '1418'
    - 1f0fff
    - 1f1fff
    - 1f2fff
    - 1f3fff
    winlog.event_data.ObjectName|endswith: \lsass.exe
    winlog.event_data.ObjectType: Process
    winlog.event_id:
    - 4663
    - 4656
falsepositives:
- Unknown
fields:
- winlog.ComputerName
- winlog.event_data.ObjectName
- winlog.event_data.SubjectUserName
- winlog.event_data.ProcessName
id: 962fe167-e48d-4fd6-9974-11e5b9a5d6d1
level: critical
logsource:
  product: windows
  service: security
modified: 2021/03/17
product: windows
references:
- https://threathunterplaybook.com/notebooks/windows/06_credential_access/WIN-170105221010.html
service: security
status: experimental
tags:
- attack.credential_access
- attack.t1003.001
title: LSASS Access from Non System Account
