category: process_creation
detection:
  condition: selection_cmd and selection_opt
  selection_cmd:
    winlog.event_data.CommandLine|contains: 'Invoke-ATHRemoteFXvGPUDisablementCommand '
  selection_opt:
    winlog.event_data.CommandLine|contains:
    - '-ModuleName '
    - '-ModulePath '
    - '-ScriptBlock '
    - -RemoteFXvGPUDisablementFilePath
id: a6fc3c46-23b8-4996-9ea2-573f4c4d88c5
logsource:
  category: process_creation
  product: windows
product: windows
