author: James Pemberton
date: 2020/05/22
definition: Requires events from Microsoft-Windows-NTLM/Operational
description: Detects logons using NTLM to hosts that are potentially not part of the
  domain.
detection:
  condition: selection
  selection:
    winlog.event_data.TargetName|startswith: TERMSRV
    winlog.event_id: 8001
falsepositives:
- Host connections to valid domains, exclude these.
- Host connections not using host FQDN.
- Host connections to external legitimate domains.
fields:
- winlog.event_data.Computer
- winlog.event_data.UserName
- winlog.event_data.DomainName
- winlog.event_data.TargetName
id: ce5678bb-b9aa-4fb5-be4b-e57f686256ad
level: medium
logsource:
  definition: Requires events from Microsoft-Windows-NTLM/Operational
  product: windows
  service: ntlm
product: windows
references:
- n/a
service: ntlm
status: experimental
tags:
- attack.command_and_control
- attack.t1219
title: Potential Remote Desktop Connection to Non-Domain Host
