author: Florian Roth
date: 2017/08/24
description: Detects suspicious command sequence that JexBoss
detection:
  condition: selection1 and selection2
  selection1:
  - bash -c /bin/bash
  selection2:
  - '&/dev/tcp/'
falsepositives:
- Unknown
id: 8ec2c8b4-557a-4121-b87c-5dfb3a602fae
level: high
logsource:
  product: linux
product: linux
references:
- https://www.us-cert.gov/ncas/analysis-reports/AR18-312A
tags:
- attack.execution
- attack.t1059.004
title: JexBoss Command Sequence
