author: "\xD6mer G\xFCnal"
date: 2020/06/16
description: Detects suspicious change of file privileges with chown and chmod commands
detection:
  condition: (selection1 and selection2) or (selection1 and selection3)
  selection1:
  - '*chown root*'
  selection2:
  - '* chmod u+s*'
  selection3:
  - '* chmod g+s*'
falsepositives:
- Legitimate administration activities
id: c21c4eaa-ba2e-419a-92b2-8371703cbe21
level: low
logsource:
  product: linux
product: linux
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1166/T1166.md
- https://attack.mitre.org/techniques/T1166/
status: experimental
tags:
- attack.persistence
title: Setuid and Setgid
