author: Florian Roth
date: 2017/03/01
description: Detects buffer overflow attempts in Unix system log files
detection:
  condition: keywords
  keywords:
  - attempt to execute code on stack by
  - FTP LOGIN FROM .* 0bin0sh
  - 'rpc.statd[\d+]: gethostbyname error for'
  - AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA
falsepositives:
- Unknown
id: 18b042f0-2ecd-4b6e-9f8d-aa7a7e7de781
level: high
logsource:
  product: linux
product: linux
references:
- https://github.com/ossec/ossec-hids/blob/master/etc/rules/attack_rules.xml
status: stable
tags:
- attack.t1068
- attack.privilege_escalation
title: Buffer Overflow Attempts
