author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2021/04/12
description: Rule to detect the Hybrid Connection Manager service running on an endpoint.
detection:
  condition: selection and keywords
  keywords:
  - HybridConnection
  - sb://
  - servicebus.windows.net
  - HybridConnectionManage
  selection:
    winlog.event_id:
    - 40300
    - 40301
    - 40302
falsepositives:
- Legitimate use of Hybrid Connection Manager via Azure function apps.
id: b55d23e5-6821-44ff-8a6e-67218891e49f
level: high
logsource:
  product: windows
  service: microsoft-servicebus-client
product: windows
references:
- https://twitter.com/Cyb3rWard0g/status/1381642789369286662
service: microsoft-servicebus-client
status: experimental
tags:
- attack.persistence
- attack.t1554
title: HybridConnectionManager Service Running
