author: Aleksandr Akhremchik, oscd.community
category: authentication
date: 2019/10/25
description: Detects many authentication failures from one source to one destination
  which is may indicate Brute Force activity
detection:
  condition: selection | count(category) by dst_ip > 30
  selection:
    action: failure
  timeframe: 600s
falsepositives:
- Inventarization
- Penetration testing
- Vulnerability scanner
- Legitimate application
fields:
- src_ip
- dst_ip
- user
id: 53c7cca0-2901-493a-95db-d00d6fcf0a37
level: medium
logsource:
  category: authentication
modified: 2020/09/01
status: experimental
tags:
- attack.credential_access
- attack.t1110
title: Brute Force
