author: Igor Fits, oscd.community
date: 2020/10/13
description: Adversaries may use binary padding to add junk data and change the on-disk
  representation of malware. This rule detect using dd and truncate to add a junk
  data to file.
detection:
  condition: execve and (all of truncate or (all of dd and not filter))
  dd:
  - dd
  - if=
  execve:
    type: EXECVE
  filter:
  - of=
  truncate:
  - truncate
  - -s
falsepositives:
- Legitimate script work
id: c52a914f-3d8b-4b2a-bb75-b3991e75f8ba
level: high
logsource:
  product: linux
  service: auditd
product: linux
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1027.001/T1027.001.md
service: auditd
status: experimental
tags:
- attack.defense_evasion
- attack.t1027.001
title: Binary Padding
