author: Marie Euler
date: 2020/05/18
description: Detects the creation of a new user account. Such accounts may be used
  for persistence that do not require persistent remote access tools to be deployed
  on the system.
detection:
  condition: selection
  selection:
    exe|endswith: /useradd
    type: SYSCALL
falsepositives:
- Admin activity
id: 759d0d51-bc99-4b5e-9add-8f5b2c8e7512
level: medium
logsource:
  product: linux
  service: auditd
product: linux
references:
- 'MITRE Attack technique T1136; Create Account '
service: auditd
status: experimental
tags:
- attack.t1136.001
- attack.persistence
title: Creation Of An User Account
