author: Timur Zinniatullin, oscd.community
date: 2019/10/21
description: Adversaries may use the information from System Owner/User Discovery
  during automated discovery to shape follow-on behaviors, including whether or not
  the adversary fully infects the target and/or attempts specific actions.
detection:
  condition: selection
  selection:
    a0:
    - users
    - w
    - who
    type: EXECVE
falsepositives:
- Admin activity
id: 9a0d8ca0-2385-4020-b6c6-cb6153ca56f3
level: low
logsource:
  product: linux
  service: auditd
product: linux
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1033/T1033.md
service: auditd
status: experimental
tags:
- attack.discovery
- attack.t1033
title: System Owner or User Discovery
