author: Florian Roth
date: 2017/02/16
description: Detects suspicious failed logins with different user accounts from a
  single source system
detection:
  condition: selection | count(pam_user) by pam_rhost > 3
  selection:
    pam_message: authentication failure
    pam_rhost: '*'
    pam_user: '*'
  timeframe: 24h
falsepositives:
- Terminal servers
- Jump servers
- Workstations with frequently changing users
id: fc947f8e-ea81-4b14-9a7b-13f888f94e18
level: medium
logsource:
  product: linux
  service: auth
modified: 2021/11/27
product: linux
service: auth
status: test
tags:
- attack.credential_access
- attack.t1110
title: Failed Logins with Different Accounts from Single Source System
