author: "\xD6mer G\xFCnal, Alejandro Ortuno, oscd.community"
date: 2020/06/17
description: Detects disabling security tools
detection:
  condition: keywords
  keywords:
  - '*stopping iptables*'
  - '*stopping ip6tables*'
  - '*stopping firewalld*'
  - '*stopping cbdaemon*'
  - '*stopping falcon-sensor*'
falsepositives:
- Legitimate administration activities
id: 49f5dfc1-f92e-4d34-96fa-feba3f6acf36
level: medium
logsource:
  product: linux
  service: syslog
modified: 2021/09/14
product: linux
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.004/T1562.004.md
related:
- id: e3a8a052-111f-4606-9aee-f28ebeb76776
  type: derived
service: syslog
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.004
title: Disabling Security Tools
