author: Bhabesh Raj, Jonhnathan Ribeiro
category: process_access
date: 2020/09/09
description: Detects LSASS process access by LaZagne for credential dumping.
detection:
  condition: selection
  selection:
    winlog.event_data.CallTrace|contains|all:
    - C:\Windows\SYSTEM32\ntdll.dll+
    - '|C:\Windows\System32\KERNELBASE.dll+'
    - _ctypes.pyd+
    - python27.dll+
    winlog.event_data.GrantedAccess: '0x1FFFFF'
    winlog.event_data.TargetImage|endswith: \lsass.exe
falsepositives:
- Unknown
id: 4b9a8556-99c4-470b-a40c-9c8d02c77ed0
level: critical
logsource:
  category: process_access
  product: windows
modified: 2022/08/13
product: windows
references:
- https://twitter.com/bh4b3sh/status/1303674603819081728
status: stable
tags:
- attack.credential_access
- attack.t1003.001
- attack.s0349
title: Credential Dumping by LaZagne
