author: Florian Roth
category: process_access
date: 2022/02/10
description: Detects a possible process memory dump based on a keyword in the file
  name of the accessing process
detection:
  condition: selection
  selection:
    winlog.event_data.GrantedAccess|endswith:
    - '10'
    - '30'
    - '50'
    - '70'
    - '90'
    - B0
    - D0
    - F0
    - '18'
    - '38'
    - '58'
    - '78'
    - '98'
    - B8
    - D8
    - F8
    - 1A
    - 3A
    - 5A
    - 7A
    - 9A
    - BA
    - DA
    - FA
    - '0x14C2'
    - FF
    winlog.event_data.SourceImage|contains: dump
    winlog.event_data.TargetImage|endswith: \lsass.exe
falsepositives:
- Rare programs that contain the word dump in their name and access lsass
id: 9bd012ee-0dff-44d7-84a0-aa698cfd87a3
level: high
logsource:
  category: process_access
  product: windows
product: windows
references:
- https://twitter.com/_xpn_/status/1491557187168178176
- https://www.ired.team/offensive-security/credential-access-and-credential-dumping/dump-credentials-from-lsass-process-without-mimikatz
status: experimental
tags:
- attack.credential_access
- attack.t1003.001
- attack.s0002
title: LSASS Memory Access by Tool Named Dump
