author: Florian Roth
category: process_access
date: 2021/11/27
description: Detects process access to LSASS memory with suspicious access flags and
  from a suspicious folder
detection:
  condition: selection and not 1 of filter*
  filter1:
    winlog.event_data.GrantedAccess: '0x410'
    winlog.event_data.SourceImage|contains|all:
    - C:\Users\
    - \AppData\Local\
    winlog.event_data.SourceImage|endswith:
    - \Microsoft VS Code\Code.exe
    - \software_reporter_tool.exe
    - \DropboxUpdate.exe
    - \MBAMInstallerService.exe
    - \WebexMTA.exe
    - \WebEx\WebexHost.exe
  filter2:
    winlog.event_data.GrantedAccess: '0x410'
    winlog.event_data.SourceImage|endswith: .tmp\DropboxUpdate.exe
    winlog.event_data.SourceImage|startswith: C:\Windows\Temp\
  filter_chrome:
    winlog.event_data.GrantedAccess: '0x410'
    winlog.event_data.SourceImage|endswith: .tmp\GoogleUpdate.exe
    winlog.event_data.SourceImage|startswith: C:\Program Files (x86)\Google\Temp\
  filter_ms_products:
    winlog.event_data.GrantedAccess: '0x1410'
    winlog.event_data.SourceImage|contains|all:
    - \AppData\Local\Temp\
    - \vs_bootstrapper_
  filter_nextron:
    winlog.event_data.GrantedAccess:
    - '0x1fffff'
    - '0x1010'
    winlog.event_data.SourceImage|endswith:
    - \thor64.exe
    - \thor.exe
    winlog.event_data.SourceImage|startswith: C:\Windows\Temp\asgard2-agent\
  selection:
    winlog.event_data.GrantedAccess|endswith:
    - '10'
    - '30'
    - '50'
    - '70'
    - '90'
    - B0
    - D0
    - F0
    - '18'
    - '38'
    - '58'
    - '78'
    - '98'
    - B8
    - D8
    - F8
    - 1A
    - 3A
    - 5A
    - 7A
    - 9A
    - BA
    - DA
    - FA
    - '0x14C2'
    - FF
    winlog.event_data.SourceImage|contains:
    - \Temp\
    - \Users\Public\
    - \PerfLogs\
    - \AppData\
    - \Temporary
    winlog.event_data.TargetImage|endswith: \lsass.exe
falsepositives:
- Legitimate software accessing LSASS process for legitimate reason
fields:
- winlog.event_data.User
- winlog.event_data.SourceImage
- winlog.event_data.GrantedAccess
id: fa34b441-961a-42fa-a100-ecc28c886725
level: high
logsource:
  category: process_access
  product: windows
modified: 2022/07/07
product: windows
references:
- https://docs.microsoft.com/en-us/windows/win32/procthread/process-security-and-access-rights
- https://onedrive.live.com/view.aspx?resid=D026B4699190F1E6!2843&ithint=file%2cpptx&app=PowerPoint&authkey=!AMvCRTKB_V1J5ow
- https://cyberwardog.blogspot.com/2017/03/chronicles-of-threat-hunter-hunting-for_22.html
- https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
- http://security-research.dyndns.org/pub/slides/FIRST2017/FIRST-2017_Tom-Ueltschi_Sysmon_FINAL_notes.pdf
status: experimental
tags:
- attack.credential_access
- attack.t1003.001
- attack.s0002
title: LSASS Access from Program in Suspicious Folder
