author: Florian Roth
category: process_access
date: 2012/06/27
description: Detects process LSASS memory dump using Mimikatz, NanoDump, Invoke-Mimikatz,
  Procdump or Taskmgr based on the CallTrace pointing to ntdll.dll, dbghelp.dll or
  dbgcore.dll for win10, server2016 and up.
detection:
  condition: selection
  selection:
    winlog.event_data.GrantedAccess: '0x1FFFFF'
    winlog.event_data.SourceImage|endswith: \WerFault.exe
    winlog.event_data.TargetImage|endswith: \lsass.exe
falsepositives:
- Actual failures in lsass.exe that trigger a crash dump (unlikely)
- Unknown cases in which WerFault accesses lsass.exe
id: e5b33f7d-eb93-48b6-9851-09e1e610b6d7
level: high
logsource:
  category: process_access
  product: windows
product: windows
references:
- https://github.com/helpsystems/nanodump/commit/578116faea3d278d53d70ea932e2bbfe42569507
status: experimental
tags:
- attack.credential_access
- attack.t1003.001
- attack.s0002
title: WerFault Accassing LSASS
