author: Patryk Prauze - ING Tech
category: process_access
date: 2019/05/20
description: Detects usage of mimikatz through WinRM protocol by monitoring access
  to lsass process by wsmprovhost.exe.
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.GrantedAccess: '0x80000000'
  selection:
    winlog.event_data.SourceImage: C:\Windows\system32\wsmprovhost.exe
    winlog.event_data.TargetImage|endswith: \lsass.exe
falsepositives:
- Unlikely
id: aa35a627-33fb-4d04-a165-d33b4afca3e8
level: high
logsource:
  category: process_access
  product: windows
modified: 2021/06/21
product: windows
references:
- https://pentestlab.blog/2018/05/15/lateral-movement-winrm/
status: stable
tags:
- attack.credential_access
- attack.execution
- attack.t1003.001
- attack.t1059.001
- attack.lateral_movement
- attack.t1021.006
- attack.s0002
title: Mimikatz through Windows Remote Management
