author: oscd.community, Dmitry Uchakin
category: process_access
date: 2020/10/07
description: COM interface (EditionUpgradeManager) that is not used by standard executables.
detection:
  condition: selection
  selection:
    winlog.event_data.CallTrace|contains: editionupgrademanagerobj.dll
falsepositives:
- Unknown
fields:
- winlog.ComputerName
- winlog.event_data.User
- winlog.event_data.SourceImage
- winlog.event_data.TargetImage
- winlog.event_data.CallTrace
id: fb3722e4-1a06-46b6-b772-253e2e7db933
level: high
logsource:
  category: process_access
  product: windows
modified: 2021/11/27
product: windows
references:
- https://www.snip2code.com/Snippet/4397378/UAC-bypass-using-EditionUpgradeManager-C/
- https://gist.github.com/hfiref0x/de9c83966623236f5ebf8d9ae2407611
status: test
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1548.002
title: Load Undocumented Autoelevated COM Interface
