author: Florian Roth
category: process_access
date: 2022/09/07
description: Detects the use of SysmonEnte, a tool to attack the integrity of Sysmon
detection:
  condition: ( selection_1 and not filter_1 ) or selection_calltrace
  filter_1:
    winlog.event_data.SourceImage|startswith:
    - C:\Program Files
    - C:\Windows\System32\
  selection_1:
    winlog.event_data.GrantedAccess: '0x1400'
    winlog.event_data.TargetImage: C:\Windows\Sysmon64.exe
  selection_calltrace:
    winlog.event_data.CallTrace: Ente
falsepositives:
- Unknown
id: d29ada0f-af45-4f27-8f32-f7b77c3dbc4e
level: high
logsource:
  category: process_access
  product: windows
product: windows
references:
- https://codewhitesec.blogspot.com/2022/09/attacks-on-sysmon-revisited-sysmonente.html
- https://github.com/codewhitesec/SysmonEnte/
- https://github.com/codewhitesec/SysmonEnte/blob/main/screens/1.png
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.002
title: SysmonEnte Usage
