author: Florian Roth, Roberto Rodriguez, Dimitrios Slamaris, Mark Russinovich, Thomas
  Patzke, Teymur Kheirkhabarov, Sherif Eldeeb, James Dickenson, Aleksey Potapov, oscd.community
  (update)
category: process_access
date: 2017/02/16
description: Detects process access LSASS memory which is typical for credentials
  dumping tools
detection:
  condition: selection and not 1 of filter*
  filter1:
    winlog.event_data.SourceImage:
    - C:\WINDOWS\system32\taskmgr.exe
    - C:\Windows\System32\perfmon.exe
  filter10:
    winlog.event_data.GrantedAccess: '0x1000000'
    winlog.event_data.SourceImage:
    - C:\Windows\system32\wininit.exe
    - C:\Windows\System32\lsass.exe
  filter11:
    winlog.event_data.GrantedAccess:
    - '0x1410'
    - '0x1418'
    winlog.event_data.SourceImage: C:\Windows\system32\MRT.exe
  filter2:
    winlog.event_data.SourceImage|endswith: \MsMpEng.exe
    winlog.event_data.SourceImage|startswith: C:\ProgramData\Microsoft\Windows Defender\
  filter2b:
    winlog.event_data.CallTrace|contains|all:
    - '|C:\ProgramData\Microsoft\Windows Defender\Definition Updates\{'
    - '}\mpengine.dll+'
    winlog.event_data.GrantedAccess: '0x1418'
    winlog.event_data.SourceImage: C:\Windows\System32\svchost.exe
  filter3:
    winlog.event_data.GrantedAccess:
    - '0x1410'
    - '0x410'
    winlog.event_data.SourceImage|endswith: \GamingServices.exe
    winlog.event_data.SourceImage|startswith: C:\Program Files\WindowsApps\
  filter4:
    winlog.event_data.GrantedAccess:
    - '0x1410'
    - '0x410'
    - '0x40'
    winlog.event_data.SourceImage|endswith:
    - \PROCEXP64.EXE
    - \PROCEXP.EXE
    - C:\WINDOWS\system32\taskhostw.exe
    - \MBAMInstallerService.exe
  filter5:
    winlog.event_data.SourceImage|endswith: \vmtoolsd.exe
    winlog.event_data.SourceImage|startswith: C:\ProgramData\VMware\VMware Tools\
  filter6:
    winlog.event_data.GrantedAccess: '0x100000'
    winlog.event_data.SourceImage: C:\WINDOWS\system32\svchost.exe
  filter7:
    winlog.event_data.GrantedAccess:
    - '0x1410'
    - '0x410'
    winlog.event_data.SourceImage:
    - C:\WINDOWS\system32\wbem\wmiprvse.exe
    - C:\Windows\syswow64\MsiExec.exe
    - C:\Windows\System32\msiexec.exe
  filter8:
    winlog.event_data.GrantedAccess:
    - '0x40'
    - '0x1010'
    winlog.event_data.SourceImage|endswith:
    - \thor.exe
    - \thor64.exe
    - \aurora-agent.exe
    - \aurora-agent-64.exe
  filter9:
    winlog.event_data.GrantedAccess: '0x401'
    winlog.event_data.SourceImage|endswith: \explorer.exe
  filter_edge:
    winlog.event_data.SourceImage|endswith: \Installer\setup.exe
    winlog.event_data.SourceImage|startswith: C:\Program Files (x86)\Microsoft\Edge\Application\
  filter_generic:
    winlog.event_data.GrantedAccess:
    - '0x1410'
    - '0x410'
    winlog.event_data.SourceImage|startswith:
    - C:\Program Files\
    - C:\Program Files (x86)\
  filter_handle:
    winlog.event_data.GrantedAccess: '0x40'
    winlog.event_data.SourceImage|endswith:
    - \handle.exe
    - \handle64.exe
  filter_webex:
    winlog.event_data.GrantedAccess: '0x401'
    winlog.event_data.SourceImage|endswith: \AppData\Local\WebEx\WebexHost.exe
  selection:
    winlog.event_data.GrantedAccess|startswith:
    - '0x40'
    - '0x100000'
    - '0x1410'
    - '0x1438'
    - '0x143a'
    - '0x1418'
    - '0x1f0fff'
    - '0x1f1fff'
    - '0x1f2fff'
    - '0x1f3fff'
    winlog.event_data.TargetImage|endswith: \lsass.exe
falsepositives:
- Legitimate software accessing LSASS process for legitimate reason; please add more
  filters
fields:
- winlog.ComputerName
- winlog.event_data.User
- winlog.event_data.SourceImage
id: 32d0d3e2-e58d-4d41-926b-18b520b2b32d
level: high
logsource:
  category: process_access
  product: windows
modified: 2022/07/05
product: windows
references:
- https://onedrive.live.com/view.aspx?resid=D026B4699190F1E6!2843&ithint=file%2cpptx&app=PowerPoint&authkey=!AMvCRTKB_V1J5ow
- https://cyberwardog.blogspot.com/2017/03/chronicles-of-threat-hunter-hunting-for_22.html
- https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
- http://security-research.dyndns.org/pub/slides/FIRST2017/FIRST-2017_Tom-Ueltschi_Sysmon_FINAL_notes.pdf
status: experimental
tags:
- attack.credential_access
- attack.t1003.001
- attack.s0002
- car.2019-04-004
title: Credentials Dumping Tools Accessing LSASS Memory
