author: Perez Diego (@darkquassar), oscd.community, Jonhnathan Ribeiro
category: process_access
date: 2019/10/27
description: Detects the access to processes by other suspicious processes which have
  reflectively loaded libraries in their memory space. An example is SilentTrinity
  C2 behaviour. Generally speaking, when Sysmon EventID 10 cannot reference a stack
  call to a dll loaded from disk (the standard way), it will display "UNKNOWN" as
  the module name. Usually this means the stack call points to a module that was reflectively
  loaded in memory. Adding to this, it is not common to see such few calls in the
  stack (ntdll.dll --> kernelbase.dll --> unknown) which essentially means that most
  of the functions required by the process to execute certain routines are already
  present in memory, not requiring any calls to external libraries. The latter should
  also be considered suspicious.
detection:
  condition: ( selection1 or selection2 or selection3 ) and not 1 of filter*
  filter:
  - winlog.event_data.SourceImage|endswith:
    - \Windows\System32\sdiagnhost.exe
    - \procexp64.exe
    - \procexp.exe
    - \Microsoft VS Code\Code.exe
    - \aurora-agent-64.exe
    - \aurora-agent.exe
    - \git\usr\bin\sh.exe
    - \IDE\devenv.exe
    - \GitHubDesktop\Update.exe
    - \RuntimeBroker.exe
    - \backgroundTaskHost.exe
    - \GitHubDesktop.exe
  - winlog.event_data.SourceImage|startswith:
    - C:\Program Files (x86)\
    - C:\Program Files\
    - C:\Windows\Microsoft.NET\Framework\\*\NGenTask.exe
    - C:\Program Files (x86)\Microsoft Visual Studio\
    - C:\Program Files\Microsoft Visual Studio\
    - C:\Windows\Microsoft.NET\Framework
    - C:\WINDOWS\System32\DriverStore\
    - C:\Windows\System32\WindowsPowerShell\
  - winlog.event_data.SourceImage:
    - C:\Users\\*\AppData\Local\Programs\Microsoft VS Code\Code.exe
    - C:\WINDOWS\system32\taskhostw.exe
    - C:\WINDOWS\system32\ctfmon.exe
    - C:\WINDOWS\system32\NhNotifSys.exe
    - C:\Windows\ImmersiveControlPanel\SystemSettings.exe
    - C:\Windows\explorer.exe
  - winlog.event_data.TargetImage: C:\Windows\System32\RuntimeBroker.exe
  - winlog.event_data.TargetImage|endswith: \Microsoft VS Code\Code.exe
  - winlog.event_data.CallTrace|contains: '|C:\WINDOWS\System32\RPCRT4.dll+'
  filter_eclipse:
    winlog.event_data.CallTrace|contains:
    - \jre\bin\java.dll
    - '|C:\Windows\SYSTEM32\windows.storage.dll+'
    - \configuration\org.eclipse.osgi\
    winlog.event_data.SourceImage|endswith: \eclipse.exe
  filter_msmpeng:
    winlog.event_data.SourceImage|endswith: \MsMpEng.exe
    winlog.event_data.SourceImage|startswith: C:\ProgramData\Microsoft\Windows Defender\Platform\
  filter_openwith:
    winlog.event_data.SourceImage: C:\Windows\system32\OpenWith.exe
    winlog.event_data.TargetImage: C:\Windows\Explorer.EXE
  filter_set_1:
    winlog.event_data.SourceImage: C:\WINDOWS\Explorer.EXE
    winlog.event_data.TargetImage:
    - C:\WINDOWS\system32\backgroundTaskHost.exe
    - C:\WINDOWS\explorer.exe
  selection1:
    winlog.event_data.CallTrace|contains|all:
    - C:\WINDOWS\SYSTEM32\ntdll.dll+
    - '|C:\WINDOWS\System32\KERNELBASE.dll+'
    - '|UNKNOWN('
    - )
  selection2:
    winlog.event_data.CallTrace|contains|all:
    - UNKNOWN(
    - )|UNKNOWN(
    winlog.event_data.CallTrace|endswith: )
  selection3:
    winlog.event_data.CallTrace|contains: UNKNOWN
    winlog.event_data.GrantedAccess:
    - '0x1F0FFF'
    - '0x1F1FFF'
    - '0x143A'
    - '0x1410'
    - '0x1010'
    - '0x1F2FFF'
    - '0x1F3FFF'
    - '0x1FFFFF'
falsepositives:
- SysInternals Process Explorer
fields:
- winlog.ComputerName
- winlog.event_data.User
- winlog.event_data.SourceImage
- winlog.event_data.TargetImage
- winlog.event_data.CallTrace
id: 5f113a8f-8b61-41ca-b90f-d374fa7e4a39
level: low
logsource:
  category: process_access
  product: windows
modified: 2022/03/16
product: windows
references:
- https://azure.microsoft.com/en-ca/blog/detecting-in-memory-attacks-with-sysmon-and-azure-security-center/
status: experimental
tags:
- attack.privilege_escalation
- attack.defense_evasion
- attack.t1055.001
- attack.t1055.002
title: Suspicious In-Memory Module Execution
