author: Christian Burkard
category: process_access
date: 2021/08/23
description: Detects the pattern of UAC Bypass using a WoW64 logger DLL hijack (UACMe
  30)
detection:
  condition: selection
  selection:
    winlog.event_data.CallTrace|startswith: UNKNOWN(0000000000000000)|UNKNOWN(0000000000000000)|
    winlog.event_data.GrantedAccess: '0x1fffff'
    winlog.event_data.SourceImage|contains: :\Windows\SysWOW64\
falsepositives:
- Unknown
id: 4f6c43e2-f989-4ea5-bcd8-843b49a0317c
level: high
logsource:
  category: process_access
  product: windows
product: windows
references:
- https://github.com/hfiref0x/UACME
status: experimental
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1548.002
title: UAC Bypass Using WOW64 Logger DLL Hijack
