author: Samir Bousseaden, Michael Haag
category: process_access
date: 2019/04/03
description: Detects process LSASS memory dump using Mimikatz, NanoDump, Invoke-Mimikatz,
  Procdump or Taskmgr based on the CallTrace pointing to ntdll.dll, dbghelp.dll or
  dbgcore.dll for win10, server2016 and up.
detection:
  condition: selection and not 1 of filter*
  filter_thor:
    winlog.event_data.CallTrace|contains|all:
    - '|C:\Windows\Temp\asgard2-agent\'
    - \thor\thor64.exe+
    - '|UNKNOWN('
    winlog.event_data.GrantedAccess: '0x103800'
  selection:
    winlog.event_data.CallTrace|contains:
    - dbghelp.dll
    - dbgcore.dll
    - ntdll.dll
    winlog.event_data.GrantedAccess|contains:
    - '0x1038'
    - '0x1438'
    - '0x143a'
    winlog.event_data.TargetImage|endswith: \lsass.exe
falsepositives:
- False positives are present when looking for 0x1410. Exclusions may be required.
id: 5ef9853e-4d0e-4a70-846f-a9ca37d876da
level: high
logsource:
  category: process_access
  product: windows
modified: 2022/03/20
product: windows
references:
- https://blog.menasec.net/2019/02/threat-hunting-21-procdump-or-taskmgr.html
- https://cyberwardog.blogspot.com/2017/03/chronicles-of-threat-hunter-hunting-for_22.html
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1003.001/T1003.001.md
- https://research.splunk.com/endpoint/windows_possible_credential_dumping/
status: experimental
tags:
- attack.credential_access
- attack.t1003.001
- attack.s0002
title: LSASS Memory Dump
