author: Florian Roth
category: process_access
date: 2022/03/13
description: Detects process access to LSASS memory with suspicious access flags 0x410
  and 0x01410 (spin-off of similar rule)
detection:
  condition: selection and not 1 of filter*
  filter1:
    winlog.event_data.SourceImage:
    - C:\WINDOWS\system32\taskmgr.exe
    - C:\Program Files\Malwarebytes\Anti-Malware\MBAMService.exe
    - C:\PROGRAMDATA\MALWAREBYTES\MBAMSERVICE\ctlrupdate\mbupdatr.exe
    - C:\WINDOWS\system32\taskhostw.exe
    - C:\Program Files\Windows Defender\MsMpEng.exe
    - C:\Windows\SysWOW64\msiexec.exe
    - C:\Windows\System32\msiexec.exe
    - C:\Windows\System32\lsass.exe
    - C:\WINDOWS\System32\perfmon.exe
    - C:\WINDOWS\system32\wbem\wmiprvse.exe
    - C:\Windows\sysWOW64\wbem\wmiprvse.exe
    - C:\Program Files\Common Files\McAfee\MMSSHost\MMSSHOST.exe
  filter2:
    winlog.event_data.SourceImage|endswith: \MsMpEng.exe
    winlog.event_data.SourceImage|startswith: C:\ProgramData\Microsoft\Windows Defender\
  filter3:
    winlog.event_data.SourceImage|endswith: \GamingServices.exe
    winlog.event_data.SourceImage|startswith: C:\Program Files\WindowsApps\
  filter4:
    winlog.event_data.SourceImage|endswith:
    - \PROCEXP64.EXE
    - \PROCEXP.EXE
  filter5:
    winlog.event_data.SourceImage|endswith: \vmtoolsd.exe
    winlog.event_data.SourceImage|startswith: C:\ProgramData\VMware\VMware Tools\
  filter6:
    winlog.event_data.SourceImage|contains: Antivirus
    winlog.event_data.SourceImage|startswith:
    - C:\Program Files\
    - C:\Program Files (x86)\
  filter_generic:
    winlog.event_data.SourceImage|startswith:
    - C:\Program Files\
    - C:\Program Files (x86)\
    - C:\WINDOWS\system32\
  filter_localappdata:
    winlog.event_data.SourceImage|contains|all:
    - C:\Users\
    - \AppData\Local\
    winlog.event_data.SourceImage|endswith:
    - \Microsoft VS Code\Code.exe
    - \software_reporter_tool.exe
    - \DropboxUpdate.exe
    - \MBAMInstallerService.exe
    - '\WebEx\WebexHost.exe '
    - \Programs\Microsoft VS Code\Code.exe
  filter_ms_products:
    winlog.event_data.GrantedAccess: '0x1410'
    winlog.event_data.SourceImage|contains|all:
    - \AppData\Local\Temp\
    - \vs_bootstrapper_
  filter_nextron:
    winlog.event_data.SourceImage|endswith:
    - \thor64.exe
    - \thor.exe
  filter_wer:
    SourceCommandLine: C:\WINDOWS\system32\wermgr.exe -upload
  selection:
    winlog.event_data.GrantedAccess|endswith: '10'
    winlog.event_data.TargetImage|endswith: \lsass.exe
falsepositives:
- Legitimate software accessing LSASS process for legitimate reason
fields:
- winlog.event_data.User
- winlog.event_data.SourceImage
- winlog.event_data.GrantedAccess
id: 678dfc63-fefb-47a5-a04c-26bcf8cc9f65
level: medium
logsource:
  category: process_access
  product: windows
modified: 2022/08/13
product: windows
references:
- https://docs.microsoft.com/en-us/windows/win32/procthread/process-security-and-access-rights
- https://onedrive.live.com/view.aspx?resid=D026B4699190F1E6!2843&ithint=file%2cpptx&app=PowerPoint&authkey=!AMvCRTKB_V1J5ow
- https://cyberwardog.blogspot.com/2017/03/chronicles-of-threat-hunter-hunting-for_22.html
- https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
- http://security-research.dyndns.org/pub/slides/FIRST2017/FIRST-2017_Tom-Ueltschi_Sysmon_FINAL_notes.pdf
related:
- id: 32d0d3e2-e58d-4d41-926b-18b520b2b32d
  type: obsoletes
status: experimental
tags:
- attack.credential_access
- attack.t1003.001
- attack.s0002
title: Rare GrantedAccess Flags on LSASS Access
