author: Christian Burkard
category: process_access
date: 2021/08/04
description: Detects a typical pattern of a CobaltStrike BOF which inject into other
  processes
detection:
  condition: selection
  selection:
    winlog.event_data.CallTrace|re: ^C:\\\\Windows\\\\SYSTEM32\\\\ntdll\\.dll\+[a-z0-9]{4,6}\|C:\\\\Windows\\\\System32\\\\KERNELBASE\\.dll\+[a-z0-9]{4,6}\|UNKNOWN\([A-Z0-9]{16}\)$
    winlog.event_data.GrantedAccess:
    - '0x1028'
    - '0x1fffff'
falsepositives:
- Unknown
id: 09706624-b7f6-455d-9d02-adee024cee1d
level: high
logsource:
  category: process_access
  product: windows
product: windows
references:
- https://github.com/boku7/injectAmsiBypass
- https://github.com/boku7/spawn
status: experimental
tags:
- attack.execution
- attack.t1106
- attack.defense_evasion
- attack.t1562.001
title: CobaltStrike BOF Injection Pattern
