author: Andreas Hunkeler (@Karneades), Markus Neis
category: process_creation
date: 2021/05/20
description: Detects suspicious shell spawn from WinRM host process
detection:
  condition: selection
  selection:
    winlog.event_data.Image:
    - '*\cmd.exe'
    - '*\sh.exe'
    - '*\bash.exe'
    - '*\powershell.exe'
    - '*\schtasks.exe'
    - '*\certutil.exe'
    - '*\whoami.exe'
    - '*\bitsadmin.exe'
    winlog.event_data.ParentImage: '*\wsmprovhost.exe'
falsepositives:
- Legitimate WinRM usage
id: 5cc2cda8-f261-4d88-a2de-e9e193c86716
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/05/22
product: windows
status: experimental
tags:
- attack.t1190
- attack.initial_access
- attack.persistence
- attack.privilege_escalation
title: Suspicious Shells Spawn by WinRM
