author: Austin Songer @austinsonger
date: 2021/08/23
description: Detects when a Microsoft Cloud App Security reported when an activity
  occurs from a location that wasn't recently or never visited by any user in the
  organization.
detection:
  condition: selection
  selection:
    eventName: Activity from infrequent country
    eventSource: SecurityComplianceCenter
    status: success
falsepositives:
- Unknown
id: 0f2468a2-5055-4212-a368-7321198ee706
level: medium
logsource:
  product: m365
  service: threat_management
product: m365
references:
- https://docs.microsoft.com/en-us/cloud-app-security/anomaly-detection-policy
- https://docs.microsoft.com/en-us/cloud-app-security/policy-template-reference
service: threat_management
status: experimental
tags:
- attack.command_and_control
- attack.t1573
title: Activity from Infrequent Country
