author: Austin Songer @austinsonger
date: 2021/08/23
description: Detects when a Microsoft Cloud App Security reported users were active
  from an IP address identified as risky by Microsoft Threat Intelligence. These IP
  addresses are involved in malicious activities, such as Botnet C&C, and may indicate
  compromised account.
detection:
  condition: selection
  selection:
    eventName: Activity from suspicious IP addresses
    eventSource: SecurityComplianceCenter
    status: success
falsepositives:
- Unknown
id: a3501e8e-af9e-43c6-8cd6-9360bdaae498
level: medium
logsource:
  product: m365
  service: threat_detection
product: m365
references:
- https://docs.microsoft.com/en-us/cloud-app-security/anomaly-detection-policy
- https://docs.microsoft.com/en-us/cloud-app-security/policy-template-reference
service: threat_detection
status: experimental
tags:
- attack.command_and_control
- attack.t1573
title: Activity from Suspicious IP Addresses
