author: austinsonger
date: 2021/08/19
description: Detects when a Microsoft Cloud App Security reported a user has deleted
  a unusual a large volume of files.
detection:
  condition: selection
  selection:
    eventName: Unusual volume of file deletion
    eventSource: SecurityComplianceCenter
    status: success
falsepositives:
- Unknown
id: 78a34b67-3c39-4886-8fb4-61c46dc18ecd
level: medium
logsource:
  product: m365
  service: threat_management
product: m365
references:
- https://docs.microsoft.com/en-us/cloud-app-security/anomaly-detection-policy
- https://docs.microsoft.com/en-us/cloud-app-security/policy-template-reference
service: threat_management
status: experimental
tags:
- attack.impact
- attack.t1485
title: Microsoft 365 - Unusual Volume of File Deletion
