author: austinsonger
date: 2021/08/19
description: Detects when a Security Compliance Center reported a user who exceeded
  sending limits of the service policies and because of this has been restricted from
  sending email.
detection:
  condition: selection
  selection:
    eventName: User restricted from sending email
    eventSource: SecurityComplianceCenter
    status: success
falsepositives:
- Unknown
id: ff246f56-7f24-402a-baca-b86540e3925c
level: medium
logsource:
  product: m365
  service: threat_management
product: m365
references:
- https://docs.microsoft.com/en-us/cloud-app-security/anomaly-detection-policy
- https://docs.microsoft.com/en-us/cloud-app-security/policy-template-reference
service: threat_management
status: experimental
tags:
- attack.initial_access
- attack.t1199
title: Microsoft 365 - User Restricted from Sending Email
