author: Austin Songer @austinsonger
date: 2021/08/22
description: Detects when a Microsoft Cloud App Security reported suspicious email
  forwarding rules, for example, if a user created an inbox rule that forwards a copy
  of all emails to an external address.
detection:
  condition: selection
  selection:
    eventName: Suspicious inbox forwarding
    eventSource: SecurityComplianceCenter
    status: success
falsepositives:
- Unknown
id: 6c220477-0b5b-4b25-bb90-66183b4089e8
level: low
logsource:
  product: m365
  service: threat_management
product: m365
references:
- https://docs.microsoft.com/en-us/cloud-app-security/anomaly-detection-policy
- https://docs.microsoft.com/en-us/cloud-app-security/policy-template-reference
service: threat_management
status: experimental
tags:
- attack.exfiltration
- attack.t1020
title: Suspicious Inbox Forwarding
