author: Austin Songer
date: 2021/08/26
description: Detects when multi-factor authentication (MFA) is disabled.
detection:
  condition: all of them
  eventValue:
    new_value: 'false'
  selection:
    eventName:
    - ENFORCE_STRONG_AUTHENTICATION
    - ALLOW_STRONG_AUTHENTICATION
    eventService: admin.googleapis.com
falsepositives:
- MFA may be disabled and performed by a system administrator.
id: 780601d1-6376-4f2a-884e-b8d45599f78c
level: medium
logsource:
  service: google_workspace.admin
modified: 2021/08/29
references:
- https://cloud.google.com/logging/docs/audit/gsuite-audit-logging#3
- https://developers.google.com/admin-sdk/reports/v1/appendix/activity/admin-security-settings#ENFORCE_STRONG_AUTHENTICATION
- https://developers.google.com/admin-sdk/reports/v1/appendix/activity/admin-security-settings?hl=en#ALLOW_STRONG_AUTHENTICATION
service: google_workspace.admin
status: experimental
tags:
- attack.impact
title: Google Workspace MFA Disabled
