author: "\xD6mer G\xFCnal, oscd.community"
category: process_creation
date: 2020/10/06
description: Detects the use of at/atd
detection:
  condition: selection
  selection:
    ProcessName|endswith:
    - /at
    - /atd
falsepositives:
- Legitimate administration activities
id: d2d642d7-b393-43fe-bae4-e81ed5915c4b
level: low
logsource:
  category: process_creation
  product: linux
product: linux
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1053.001/T1053.001.md
status: stable
tags:
- attack.persistence
- attack.t1053.001
title: Scheduled Task/Job At
