author: Florian Roth
date: 2017/03/01
description: Detects relevant ClamAV messages
detection:
  condition: keywords
  keywords:
  - Trojan*FOUND
  - VirTool*FOUND
  - Webshell*FOUND
  - Rootkit*FOUND
  - Htran*FOUND
falsepositives:
- Unknown
id: 36aa86ca-fd9d-4456-814e-d3b1b8e1e0bb
level: high
logsource:
  product: linux
  service: clamav
product: linux
references:
- https://github.com/ossec/ossec-hids/blob/master/etc/rules/clam_av_rules.xml
service: clamav
status: stable
title: Relevant ClamAV Message
