author: Daniil Yugoslavskiy, oscd.community
category: process_creation
date: 2020/10/19
description: Detects usage of system utilities (only grep for now) to discover security
  software discovery
detection:
  condition: grep_execution and security_services_and_processes
  grep_execution:
    Image|endswith: /grep
  security_services_and_processes:
    CommandLine|contains:
    - nessusd
    - td-agent
    - packetbeat
    - filebeat
    - auditbeat
    - osqueryd
    - cbagentd
    - falcond
falsepositives:
- Legitimate activities
id: c9d8b7fd-78e4-44fe-88f6-599135d46d60
level: low
logsource:
  category: process_creation
  product: linux
product: linux
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1518.001/T1518.001.md
status: experimental
tags:
- attack.discovery
- attack.t1518.001
title: Security Software Discovery
