author: Daniil Yugoslavskiy, oscd.community
category: process_creation
date: 2020/10/19
description: Detects usage of system utilities to discover files and directories
detection:
  condition: 1 of them
  file_with_asterisk:
    CommandLine|re: (.){200,}
    Image|endswith: /file
  find_execution:
    Image|endswith: /find
  recursive_ls:
    CommandLine|contains: -R
    Image|endswith: /ls
  tree_execution:
    Image|endswith: /tree
falsepositives:
- Legitimate activities
id: d3feb4ee-ff1d-4d3d-bd10-5b28a238cc72
level: informational
logsource:
  category: process_creation
  product: linux
product: linux
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1083/T1083.md
status: experimental
tags:
- attack.discovery
- attack.t1083
title: File and Directory Discovery
