author: Alejandro Ortuno, oscd.community
category: process_creation
date: 2020/10/22
description: Detects the enumeration of other remote systems.
detection:
  condition: 1 of them
  selection_1:
    CommandLine|contains: -a
    Image|endswith: /arp
  selection_2:
    CommandLine|contains:
    - ' 10.'
    - ' 192.168.'
    - ' 172.16.'
    - ' 172.17.'
    - ' 172.18.'
    - ' 172.19.'
    - ' 172.20.'
    - ' 172.21.'
    - ' 172.22.'
    - ' 172.23.'
    - ' 172.24.'
    - ' 172.25.'
    - ' 172.26.'
    - ' 172.27.'
    - ' 172.28.'
    - ' 172.29.'
    - ' 172.30.'
    - ' 172.31.'
    - ' 127.'
    - ' 169.254.'
    Image|endswith: /ping
falsepositives:
- Legitimate administration activities
id: 11063ec2-de63-4153-935e-b1a8b9e616f1
level: low
logsource:
  category: process_creation
  product: linux
product: linux
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1018/T1018.md
status: experimental
tags:
- attack.discovery
- attack.t1018
title: Linux Remote System Discovery
