author: "\xD6mer G\xFCnal, oscd.community"
category: process_creation
date: 2020/10/07
description: Detects file deletion commands
detection:
  condition: selection
  selection:
    Image|endswith:
    - /rm
    - /shred
falsepositives:
- Legitimate administration activities
id: 30aed7b6-d2c1-4eaf-9382-b6bc43e50c57
level: informational
logsource:
  category: process_creation
  product: linux
product: linux
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1070.004/T1070.004.md
status: stable
tags:
- attack.defense_evasion
- attack.t1070.004
title: File Deletion
