category: process_creation
definition: Detect netcat and filter our listening mode
detection:
  condition: (netcat and not netcat_listen_flag) or network_scanning_tools
  netcat:
    Image|endswith:
    - /nc
    - /netcat
  netcat_listen_flag:
    CommandLine|contains: l
  network_scanning_tools:
    Image|endswith:
    - /telnet
    - /nmap
id: 3e102cd9-a70d-4a7a-9508-403963092f31
logsource:
  category: process_creation
  definition: Detect netcat and filter our listening mode
  product: linux
product: linux
