author: Florian Roth
date: 2020/07/03
description: Detects suspicious session with two users present
detection:
  condition: selection
  selection:
  - (2 users now present)
falsepositives:
- Unknown
id: 1edd77db-0669-4fef-9598-165bda82826d
level: high
logsource:
  product: linux
  service: guacamole
product: linux
references:
- https://research.checkpoint.com/2020/apache-guacamole-rce/
service: guacamole
status: experimental
title: Guacamole Two Users Sharing Session Anomaly
