detection:
  condition: keywords
  keywords:
  - '*stopping iptables*'
  - '*stopping ip6tables*'
  - '*stopping firewalld*'
  - '*stopping cbdaemon*'
  - '*stopping falcon-sensor*'
id: 49f5dfc1-f92e-4d34-96fa-feba3f6acf36
logsource:
  product: linux
  service: syslog
product: linux
service: syslog
