author: "\xD6mer G\xFCnal"
date: 2020/06/18
description: Detects the use of tools that copy files from or to remote systems
detection:
  condition: tools and filter
  filter:
  - '@'
  - ':'
  tools:
  - 'scp '
  - 'rsync '
  - 'sftp '
falsepositives:
- Legitimate administration activities
id: 7a14080d-a048-4de8-ae58-604ce58a795b
level: low
logsource:
  product: linux
product: linux
references:
- https://attack.mitre.org/techniques/T1105/
status: stable
tags:
- attack.command_and_control
- attack.lateral_movement
- attack.t1105
title: Remote File Copy
