definition: Configure these rules https://github.com/Neo23x0/auditd/blob/master/audit.rules#L182-L183
detection:
  condition: selection
  selection:
    exe|endswith:
    - /telnet
    - /nmap
    - /netcat
    - /nc
    key: network_connect_4
    type: SYSCALL
id: 3761e026-f259-44e6-8826-719ed8079408
logsource:
  definition: Configure these rules https://github.com/Neo23x0/auditd/blob/master/audit.rules#L182-L183
  product: linux
  service: auditd
product: linux
service: auditd
