category: process_creation
detection:
  condition: selection
  selection:
    Image|endswith:
    - /uname
    - /hostname
    - /uptime
    - /lspci
    - /dmidecode
    - /lscpu
    - /lsmod
id: 42df45e7-e6e9-43b5-8f26-bec5b39cc239
logsource:
  category: process_creation
  product: linux
product: linux
