author: Florian Roth
date: 2017/08/24
description: Detects exploitation attempt using public exploit code for CVE-2018-15473
detection:
  condition: keywords
  keywords:
  - 'error: buffer_get_ret: trying to get more bytes 1907 than in buffer 308 [preauth]'
falsepositives:
- Unknown
id: 4c9d903d-4939-4094-ade0-3cb748f4d7da
level: medium
logsource:
  product: linux
  service: sshd
product: linux
references:
- https://github.com/Rhynorater/CVE-2018-15473-Exploit
service: sshd
status: experimental
title: SSHD Error Message CVE-2018-15473
