author: Alejandro Ortuno, oscd.community
category: file_event
date: 2020/10/23
description: Detects additions to the Emond Launch Daemon that adversaries may use
  to gain persistence and elevate privileges.
detection:
  condition: selection_1 or selection_2
  selection_1:
    TargetFilename|contains: /etc/emond.d/rules/
    TargetFilename|endswith: .plist
  selection_2:
    TargetFilename|contains: /private/var/db/emondClients/
falsepositives:
- Legitimate administration activities
id: 23c43900-e732-45a4-8354-63e4a6c187ce
level: medium
logsource:
  category: file_event
  product: macos
product: macos
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1546.014/T1546.014.md
- https://posts.specterops.io/leveraging-emond-on-macos-for-persistence-a040a2785124
status: experimental
tags:
- attack.persistence
- attack.privilege_escalation
- attack.t1546.014
title: MacOS Emond Launch Daemon
