author: Tim Ismilyaev, oscd.community, Florian Roth
category: process_creation
date: 2020/10/19
description: Detects passwords dumps from Keychain
detection:
  condition: 1 of them
  selection1:
    CommandLine|contains:
    - find-certificate
    - ' export '
    Image: /usr/bin/security
  selection2:
    CommandLine|contains:
    - ' dump-keychain '
    - ' login-keychain '
falsepositives:
- Legitimate administration activities
id: b120b587-a4c2-4b94-875d-99c9807d6955
level: medium
logsource:
  category: process_creation
  product: macos
product: macos
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1555.001/T1555.001.md
- https://gist.github.com/Capybara/6228955
status: experimental
tags:
- attack.credential_access
- attack.t1555.001
title: Credentials from Password Stores - Keychain
