author: Igor Fits, Mikhail Larin, oscd.community
category: process_creation
date: 2020/10/15
description: Detection use of the command "split" to split files into parts and possible
  transfer.
detection:
  condition: selection
  selection:
    Image|endswith: /split
falsepositives:
- Legitimate administrative activity
id: 7f2bb9d5-6395-4de5-969c-70c11fbe6b12
level: low
logsource:
  category: process_creation
  product: macos
product: macos
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1030/T1030.md
status: experimental
tags:
- attack.exfiltration
- attack.t1030
title: Split A File Into Pieces
