author: Daniil Yugoslavskiy, oscd.community
category: process_creation
date: 2020/10/19
description: Detects usage of system utilities (only grep for now) to discover security
  software discovery
detection:
  condition: grep_execution and security_services_and_processes or grep_execution
    and little_snitch_process
  grep_execution:
    Image: /usr/bin/grep
  little_snitch_process:
    CommandLine|contains|all:
    - Little
    - Snitch
  security_services_and_processes:
    CommandLine|contains:
    - nessusd
    - santad
    - CbDefense
    - falcond
    - td-agent
    - packetbeat
    - filebeat
    - auditbeat
    - osqueryd
    - BlockBlock
    - LuLu
falsepositives:
- Legitimate activities
id: 0ed75b9c-c73b-424d-9e7d-496cd565fbe0
level: medium
logsource:
  category: process_creation
  product: macos
product: macos
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1518.001/T1518.001.md
status: experimental
tags:
- attack.discovery
- attack.t1518.001
title: Security Software Discovery
