author: Austin Songer @austinsonger
date: 2021/09/12
description: Detects when an Okta policy is modified or deleted.
detection:
  condition: selection
  selection:
    eventtype:
    - policy.lifecycle.update
    - policy.lifecycle.delete
falsepositives:
- Okta Policies being modified or deleted may be performed by a system administrator.
- Verify whether the user identity, user agent, and/or hostname should be making changes
  in your environment.
- Okta Policies modified or deleted from unfamiliar users should be investigated.
  If known behavior is causing false positives, it can be exempted from the rule.
id: 1667a172-ed4c-463c-9969-efd92195319a
level: low
logsource:
  product: okta
  service: okta
modified: 2021/09/22
product: okta
references:
- https://developer.okta.com/docs/reference/api/system-log/
- https://developer.okta.com/docs/reference/api/event-types/
service: okta
status: experimental
tags:
- attack.impact
title: Okta Policy Modified or Deleted
