author: frack113
category: file_access
date: 2022/04/09
description: Detects suspicious processes based on name and location that access the
  browser credential stores which can be the sign of credential stealing
detection:
  condition: selection and not 1 of filter_*
  filter_antimalware:
    winlog.event_data.Image|endswith:
    - \MsMpEng.exe
    - \MpCopyAccelerator.exe
    - \thor64.exe
    - \thor.exe
  filter_browser:
    winlog.event_data.Image|endswith:
    - \firefox.exe
    - \chrome.exe
  filter_msiexec:
    winlog.event_data.ParentImage: C:\Windows\System32\msiexec.exe
  filter_programfile:
    winlog.event_data.Image|startswith:
    - C:\Program Files\
    - C:\Program Files (x86)\
    - C:\WINDOWS\system32\
  filter_system:
    winlog.event_data.Image: System
    winlog.event_data.ParentImage: Idle
  selection:
  - winlog.event_data.FileName|contains:
    - \AppData\Local\Google\Chrome\User Data\Default\Network\Cookies
    - \Appdata\Local\Chrome\User Data\Default\Login Data
    - \AppData\Local\Google\Chrome\User Data\Local State
  - winlog.event_data.FileName|endswith:
    - \Appdata\Local\Microsoft\Windows\WebCache\WebCacheV01.dat
    - \cookies.sqlite
    - release\key3.db
    - release\key4.db
    - release\logins.json
falsepositives:
- Antivirus, Anti-Spyware, Anti-Malware Software
- Backup software
id: 91cb43db-302a-47e3-b3c8-7ede481e27bf
level: medium
logsource:
  category: file_access
  product: windows
modified: 2022/07/27
product: windows
references:
- https://www.zscaler.com/blogs/security-research/ffdroider-stealer-targeting-social-media-platform-users
- https://github.com/lclevy/firepwd
status: experimental
tags:
- attack.t1003
- attack.credential_access
title: Browser Credential Store Access
