author: frack113
date: 2022/02/19
description: A rule has been deleted in the Windows Firewall exception list.
detection:
  condition: selection and not filter
  filter:
  - ModifyingApplication: C:\Windows\System32\svchost.exe
  - ModifyingApplication|startswith:
    - C:\Program Files\
    - C:\Program Files (x86)\
  selection:
    winlog.event_id:
    - 2006
    - 2033
id: c187c075-bb3e-4c62-b4fa-beae0ffc211f
level: medium
logsource:
  product: windows
  service: firewall-as
modified: 2022/02/22
product: windows
references:
- https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2008-r2-and-2008/dd364427(v=ws.10)
service: firewall-as
status: experimental
title: Delete Rule in Windows Firewall with Advanced Security
