author: Florian Roth, Gleb Sukhodolskiy, Timur Zinniatullin oscd.community
date: 2017/08/22
definition: WMI Namespaces Auditing and SACL should be configured, EventID 5861 and
  5859 detection requires Windows 10, 2012 and higher
description: Detects suspicious WMI event filter and command line event consumer based
  on WMI and Security Logs.
detection:
  condition: ( (wmi_filter_to_consumer_binding and consumer_keywords) or (wmi_filter_registration)
    ) and not filter_scmevent
  consumer_keywords:
  - ActiveScriptEventConsumer
  - CommandLineEventConsumer
  - CommandLineTemplate
  filter_scmevent:
    PossibleCause: Permanent
    Provider: SCM Event Provider
    Query: select * from MSFT_SCMEventLogEvent
    winlog.event_data.User: S-1-5-32-544
  wmi_filter_registration:
    winlog.event_id: 5859
  wmi_filter_to_consumer_binding:
    winlog.event_id: 5861
falsepositives:
- Unknown (data set is too small; further testing needed)
id: 0b7889b4-5577-4521-a60a-3376ee7f9f7b
level: medium
logsource:
  definition: WMI Namespaces Auditing and SACL should be configured, EventID 5861
    and 5859 detection requires Windows 10, 2012 and higher
  product: windows
  service: wmi
modified: 2022/02/10
product: windows
references:
- https://twitter.com/mattifestation/status/899646620148539397
- https://www.eideon.com/2018-03-02-THL03-WMIBackdoors/
service: wmi
status: experimental
tags:
- attack.persistence
- attack.privilege_escalation
- attack.t1546.003
title: WMI Persistence
