author: frack113
category: file_rename
date: 2022/02/19
description: Detects cases in which a file gets renamed to .dll, which often happens
  to bypass perimeter protection
detection:
  condition: to_dll and not 1 of filter*
  filter_from_dll:
  - OriginalFilename|endswith:
    - .dll
    - .tmp
  - OriginalFilename|contains:
    - .dll.
    - \SquirrelTemp\temp
  filter_tiworker:
    winlog.event_data.Image|endswith: \TiWorker.exe
    winlog.event_data.Image|startswith: C:\Windows\WinSxS\
  to_dll:
    winlog.event_data.TargetFilename|endswith: .dll
falsepositives:
- Application installation
id: bbfd974c-248e-4435-8de6-1e938c79c5c1
level: medium
logsource:
  category: file_rename
  product: windows
modified: 2022/03/13
product: windows
references:
- https://twitter.com/ffforward/status/1481672378639912960
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1036/T1036.md#atomic-test-1---system-file-copied-to-unusual-location
status: experimental
title: Rename Common File to DLL File
