author: Florian Roth
category: antivirus
date: 2021/08/16
description: Detects a highly relevant Antivirus alert that reports a hack tool or
  other attack tool
detection:
  condition: selection
  selection:
  - Signature|startswith:
    - HTOOL
    - HKTL
    - SecurityTool
    - ATK/
  - Signature|contains:
    - Hacktool
falsepositives:
- Unlikely
fields:
- FileName
- User
id: fa0c05b6-8ad3-468d-8231-c1cbccb64fba
level: high
logsource:
  category: antivirus
references:
- https://www.nextron-systems.com/2021/08/16/antivirus-event-analysis-cheat-sheet-v1-8-2/
status: experimental
tags:
- attack.execution
- attack.t1204
title: Antivirus Hacktool Detection
