author: Florian Roth
category: antivirus
date: 2022/05/12
description: Detects a highly relevant Antivirus alert that reports ransomware
detection:
  condition: selection
  selection:
    Signature|contains:
    - Ransom
    - Filecoder
falsepositives:
- Unlikely
id: 4c6ca276-d4d0-4a8c-9e4c-d69832f8671f
level: critical
logsource:
  category: antivirus
references:
- https://www.nextron-systems.com/?s=antivirus
status: experimental
tags:
- attack.t1486
title: Antivirus Ransomware Detection
