author: Florian Roth, Arnim Rupp
category: antivirus
date: 2018/09/09
description: Detects an Antivirus alert in a highly relevant file path or with a relevant
  file name
detection:
  condition: selection or selection2
  selection:
  - Filename|startswith:
    - C:\Windows\
    - C:\Temp\
    - C:\PerfLogs\
    - C:\Users\Public\
    - C:\Users\Default\
  - Filename|contains:
    - \Client\
    - \tsclient\
    - \inetpub\
    - /www/
    - apache
    - tomcat
    - nginx
    - weblogic
  selection2:
    Filename|endswith:
    - .asax
    - .ashx
    - .asmx
    - .asp
    - .aspx
    - .bat
    - .cfm
    - .cgi
    - .chm
    - .cmd
    - .dat
    - .ear
    - .gif
    - .hta
    - .jpeg
    - .jpg
    - .jsp
    - .jspx
    - .lnk
    - .php
    - .pl
    - .png
    - .ps1
    - .psm1
    - .py
    - .pyc
    - .rb
    - .scf
    - .sct
    - .sh
    - .svg
    - .txt
    - .vbe
    - .vbs
    - .war
    - .wsf
    - .wsh
    - .xml
falsepositives:
- Unlikely
fields:
- Signature
- User
id: c9a88268-0047-4824-ba6e-4d81ce0b907c
level: high
logsource:
  category: antivirus
modified: 2021/11/23
references:
- https://www.nextron-systems.com/2021/03/25/antivirus-event-analysis-cheat-sheet-v1-8/
status: experimental
tags:
- attack.resource_development
- attack.t1588
title: Antivirus Relevant File Paths Alerts
