author: Austin Songer @austinsonger
category: ThreatManagement
date: 2021/08/23
description: Detects when a Microsoft Cloud App Security reported when an app downloads
  multiple files from Microsoft SharePoint or Microsoft OneDrive in a manner that
  is unusual for the user.
detection:
  condition: selection
  selection:
    eventName: Suspicious OAuth app file download activities
    eventSource: SecurityComplianceCenter
    status: success
falsepositives:
- Unknown
id: ee111937-1fe7-40f0-962a-0eb44d57d174
level: medium
logsource:
  category: ThreatManagement
  service: m365
references:
- https://docs.microsoft.com/en-us/cloud-app-security/anomaly-detection-policy
- https://docs.microsoft.com/en-us/cloud-app-security/policy-template-reference
service: m365
status: experimental
tags:
- attack.exfiltration
title: Suspicious OAuth App File Download Activities
