author: Austin Songer @austinsonger
category: ThreatManagement
date: 2021/08/23
description: Detects when a Microsoft Cloud App Security reported when a user signs
  into your sanctioned apps from a risky IP address.
detection:
  condition: selection
  selection:
    eventName: Log on from a risky IP address
    eventSource: SecurityComplianceCenter
    status: success
falsepositives:
- Unknown
id: c191e2fa-f9d6-4ccf-82af-4f2aba08359f
level: medium
logsource:
  category: ThreatManagement
  service: m365
references:
- https://docs.microsoft.com/en-us/cloud-app-security/anomaly-detection-policy
- https://docs.microsoft.com/en-us/cloud-app-security/policy-template-reference
service: m365
status: experimental
tags:
- attack.initial_access
- attack.t1078
title: Logon from a Risky IP Address
