author: Markus Neis
category: dns
date: 2018/08/08
description: Detects strings used in command execution in DNS TXT Answer
detection:
  condition: selection
  selection:
    answer|contains:
    - IEX
    - Invoke-Expression
    - cmd.exe
    record_type: TXT
falsepositives:
- Unknown
id: 8ae51330-899c-4641-8125-e39f2e07da72
level: high
logsource:
  category: dns
  product: suricata
  service: dns
modified: 2021/11/27
product: suricata
references:
- https://twitter.com/stvemillertime/status/1024707932447854592
- https://github.com/samratashok/nishang/blob/414ee1104526d7057f9adaeee196d91ae447283e/Backdoors/DNS_TXT_Pwnage.ps1
service: dns
status: test
tags:
- attack.command_and_control
- attack.t1071.004
title: DNS TXT Answer with Possible Execution Strings
