author: Florian Roth
category: dns
date: 2018/05/10
description: Detects suspicious DNS queries known from Cobalt Strike beacons
detection:
  condition: 1 of selection*
  selection1:
    query|startswith:
    - aaa.stage.
    - post.1
  selection2:
    query|contains: .stage.123456.
falsepositives:
- Unknown
id: 2975af79-28c4-4d2f-a951-9095f229df29
level: critical
logsource:
  category: dns
  product: suricata
  service: dns
modified: 2021/03/24
product: suricata
references:
- https://www.icebrg.io/blog/footprints-of-fin7-tracking-actor-patterns
- https://www.sekoia.io/en/hunting-and-detecting-cobalt-strike/
service: dns
status: experimental
tags:
- attack.command_and_control
- attack.t1071.004
title: Cobalt Strike DNS Beaconing
