author: Daniil Yugoslavskiy, oscd.community
category: dns
date: 2019/10/24
description: High DNS queries bytes amount from host per short period of time
detection:
  condition: selection | sum(question_length) by src_ip > 300000
  selection:
    query: '*'
  timeframe: 1m
falsepositives:
- Legitimate high DNS bytes out rate to domain name which should be added to whitelist
id: 0f6c1bf5-70a5-4963-aef9-aab1eefb50bd
level: medium
logsource:
  category: dns
  product: suricata
  service: dns
modified: 2021/09/21
product: suricata
service: dns
status: experimental
tags:
- attack.exfiltration
- attack.t1048.003
title: High DNS Bytes Out
