author: Roberto Rodriguez @Cyb3rWard0g
category: network_connection
date: 2019/09/12
description: Detects remote PowerShell connections by monitoring network outbound
  connections to ports 5985 or 5986 from a non-network service account.
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.User: NT AUTHORITY\NETWORK SERVICE
  selection:
    winlog.event_data.DestinationPort:
    - 5985
    - 5986
falsepositives:
- Legitimate usage of remote PowerShell, e.g. remote administration and monitoring.
id: c539afac-c12a-46ed-b1bd-5a5567c9f045
level: high
logsource:
  category: network_connection
  product: windows
modified: 2020/08/24
product: windows
references:
- https://threathunterplaybook.com/notebooks/windows/02_execution/WIN-190511223310.html
status: experimental
tags:
- attack.execution
- attack.t1059.001
- attack.lateral_movement
- attack.t1021.006
title: Remote PowerShell Session
