author: EagleEye Team
category: network_connection
date: 2020/05/14
description: Detects suspicious network connection by Notepad
detection:
  condition: selection and not filter
  filter:
    winlog.event_data.DestinationPort: '9100'
  selection:
    winlog.event_data.Image|endswith: \notepad.exe
falsepositives:
- None observed so far
id: e81528db-fc02-45e8-8e98-4e84aba1f10b
level: high
logsource:
  category: network_connection
  product: windows
modified: 2020/08/24
product: windows
references:
- https://www.sans.org/cyber-security-summit/archives/file/summit-archive-1492186586.pdf
- https://blog.cobaltstrike.com/2013/08/08/why-is-notepad-exe-connecting-to-the-internet/
status: experimental
tags:
- attack.command_and_control
- attack.execution
- attack.defense_evasion
- attack.t1055
title: Notepad Making Network Connection
