author: frack113
category: webserver
date: 2021/08/10
definition: w3c-logging must be enable https://docs.microsoft.com/en-us/windows/win32/http/w3c-logging
description: "When exploiting this vulnerability with CVE-2021\u201326858, an SSRF\
  \ attack is used to manipulate virtual directories"
detection:
  condition: selection or all of keywords
  keywords:
  - POST
  - '200'
  - /ecp/DDI/DDIService.svc/SetObject
  - schema=Reset
  - VirtualDirectory
  - $
  selection:
    cs-method: POST
    cs-uri-query|contains|all:
    - schema=Reset
    - VirtualDirectory
    cs-uri-stem: /ecp/DDI/DDIService.svc/SetObject
    cs-username|endswith: $
    sc-status: 200
falsepositives:
- Unlikely
id: effee1f6-a932-4297-a81f-acb44064fa3a
level: critical
logsource:
  category: webserver
  definition: w3c-logging must be enable https://docs.microsoft.com/en-us/windows/win32/http/w3c-logging
  product: windows
product: windows
references:
- https://bi-zone.medium.com/hunting-down-ms-exchange-attacks-part-1-proxylogon-cve-2021-26855-26858-27065-26857-6e885c5f197c
status: experimental
title: ProxyLogon Reset Virtual Directories Based On IIS Log
