author: Florian Roth
category: webserver
date: 2020/02/29
description: Detects the exploitation of Microsoft Exchange vulnerability as described
  in CVE-2020-0688
detection:
  condition: selection1 and selection2
  selection1:
    http.http_method: GET
    http.url|contains:
    - /ecp/
    - /owa/
  selection2:
    http.url|contains: __VIEWSTATE=
falsepositives:
- Unknown
fields:
- src_ip
- http.hostname
id: fce2c2e2-0fb5-41ab-a14c-5391e1fd70a5
level: critical
logsource:
  category: webserver
  product: suricata
  service: http
product: suricata
references:
- https://www.trustedsec.com/blog/detecting-cve-20200688-remote-code-execution-vulnerability-on-microsoft-exchange-server/
service: http
status: experimental
tags:
- attack.initial_access
- attack.t1190
title: CVE-2020-0688 Exchange Exploitation via Web Log
