author: Florian Roth, Rich Warren
category: webserver
date: 2021/08/09
description: Detects URP patterns and status codes that indicate a successful ProxyShell
  exploitation attack against Exchange servers
detection:
  condition: selection_auto and selection_uri and selection_success
  selection_auto:
    http.url|contains: /autodiscover.json
  selection_success:
    sc-status:
    - 200
    - 301
  selection_uri:
    http.url|contains:
    - /powershell
    - /mapi/nspi
    - /EWS
    - X-Rps-CAT
falsepositives:
- Unknown
id: 992be1eb-e5da-437e-9a54-6d13b57bb4d8
level: critical
logsource:
  category: webserver
  product: suricata
  service: http
product: suricata
references:
- https://youtu.be/5mqid-7zp8k?t=2231
- https://blog.orange.tw/2021/08/proxylogon-a-new-attack-surface-on-ms-exchange-part-1.html
- https://peterjson.medium.com/reproducing-the-proxyshell-pwn2own-exploit-49743a4ea9a1
service: http
status: experimental
tags:
- attack.initial_access
title: Successful Exchange ProxyShell Attack
