author: Bhabesh Raj
category: webserver
date: 2020/12/27
description: Detects CVE-2020-10148 SolarWinds Orion API authentication bypass attempts
detection:
  condition: selection and not valid_request_1 and not valid_request_2
  selection:
    http.url|contains:
    - WebResource.axd
    - ScriptResource.axd
    - i18n.ashx
    - Skipi18n
  valid_request_1:
    http.url|contains: Orion/Skipi18n/Profiler/
  valid_request_2:
    http.url|contains:
    - css.i18n.ashx
    - js.i18n.ashx
falsepositives:
- Unknown
id: 5a35116f-43bc-4901-b62d-ef131f42a9af
level: critical
logsource:
  category: webserver
  product: suricata
  service: http
product: suricata
references:
- https://kb.cert.org/vuls/id/843464
service: http
status: experimental
tags:
- attack.initial_access
- attack.t1190
title: CVE-2020-10148 SolarWinds Orion API Auth Bypass
