author: Florian Roth
category: webserver
date: 2021/05/22
description: Detects the exploitation of the Wazuh RCE vulnerability described in
  CVE-2021-26814
detection:
  condition: selection
  selection:
    http.url|contains: /manager/files?path=etc/lists/../../../../..
falsepositives:
- None
fields:
- src_ip
- http.hostname
id: b9888738-29ed-4c54-96a4-f38c57b84bb3
level: high
logsource:
  category: webserver
  product: suricata
  service: http
product: suricata
references:
- https://cve.mitre.org/cgi-bin/cvename.cgi?name=2021-26814
- https://github.com/WickdDavid/CVE-2021-26814/blob/main/PoC.py
- https://nvd.nist.gov/vuln/detail/cve-2021-21978
service: http
status: experimental
tags:
- attack.initial_access
- attack.t1190
title: Exploitation of CVE-2021-26814 in Wazuh
